[
  {
    "id": "http://arxiv.org/abs/2502.10115v1",
    "arxiv_id": "2502.10115v1",
    "title": "SWAP Attack: Stealthy Side-Channel Attack on Multi-Tenant Quantum Cloud System",
    "summary": "The rapid advancement of quantum computing has spurred widespread adoption, with cloud-based quantum devices gaining traction in academia and industry. This shift raises critical concerns about the privacy and security of computations on shared, multi-tenant quantum platforms accessed remotely. Recent studies have shown that crosstalk on shared quantum devices allows adversaries to interfere with victim circuits within a neighborhood. While insightful, these works left unresolved questions regarding the root cause of crosstalk, effective countermeasures, and replicability across circuits. We revisit the crosstalk effect, tracing its origins to the SWAP path between qubits and demonstrating its impact even over long distances. Our results significantly improve the understanding of this phenomenon beyond prior works. The proposed SWAP-based side-channel attack operates in both active and passive modes, as verified on real IBM quantum devices. In the active attack, an attacker executing a single CNOT gate can perturb victim circuits running Grover's Algorithm, reducing expected output accuracy by $81.62\\%$ through strategic qubit placement. Moreover, this effect can be modeled to identify qubits more susceptible to attack. The passive attack, leveraging a stealthy circuit as small as $6.25\\%$ of the victim's, achieves $100\\%$ accuracy in predicting the victim's circuit size when running Simon's Algorithm. These findings challenge the existing defense strategy of maximizing topological distance between circuits, showing that attackers can still extract sensitive information or manipulate results remotely. Our work highlights the urgent need for robust security measures to safeguard quantum computations against emerging threats.",
    "published": "2025-02-14T12:25:08Z",
    "updated": "2025-02-14T12:25:08Z",
    "authors": [
      "Wei Jie Bryan Lee",
      "Siyi Wang",
      "Suman Dutta",
      "Walid El Maouaki",
      "Anupam Chattopadhyay"
    ],
    "affiliations": [],
    "first_author": "Wei Jie Bryan Lee",
    "pdf_url": "https://arxiv.org/pdf/2502.10115v1",
    "primary_category": "quant-ph",
    "relevance_score": 16.0
  },
  {
    "id": "http://arxiv.org/abs/2505.00817v1",
    "arxiv_id": "2505.00817v1",
    "title": "Spill The Beans: Exploiting CPU Cache Side-Channels to Leak Tokens from Large Language Models",
    "summary": "Side-channel attacks on shared hardware resources increasingly threaten confidentiality, especially with the rise of Large Language Models (LLMs). In this work, we introduce Spill The Beans, a novel application of cache side-channels to leak tokens generated by an LLM. By co-locating an attack process on the same hardware as the victim model, we flush and reload embedding vectors from the embedding layer, where each token corresponds to a unique embedding vector. When accessed during token generation, it results in a cache hit detectable by our attack on shared lower-level caches.   A significant challenge is the massive size of LLMs, which, by nature of their compute intensive operation, quickly evicts embedding vectors from the cache. We address this by balancing the number of tokens monitored against the amount of information leaked. Monitoring more tokens increases potential vocabulary leakage but raises the chance of missing cache hits due to eviction; monitoring fewer tokens improves detection reliability but limits vocabulary coverage.   Through extensive experimentation, we demonstrate the feasibility of leaking tokens from LLMs via cache side-channels. Our findings reveal a new vulnerability in LLM deployments, highlighting that even sophisticated models are susceptible to traditional side-channel attacks. We discuss the implications for privacy and security in LLM-serving infrastructures and suggest considerations for mitigating such threats. For proof of concept we consider two concrete attack scenarios: Our experiments show that an attacker can recover as much as 80%-90% of a high entropy API key with single shot monitoring. As for English text we can reach a 40% recovery rate with a single shot. We should note that the rate highly depends on the monitored token set and these rates can be improved by targeting more specialized output domains.",
    "published": "2025-05-01T19:18:56Z",
    "updated": "2025-05-01T19:18:56Z",
    "authors": [
      "Andrew Adiletta",
      "Berk Sunar"
    ],
    "affiliations": [],
    "first_author": "Andrew Adiletta",
    "pdf_url": "https://arxiv.org/pdf/2505.00817v1",
    "primary_category": "cs.CR",
    "relevance_score": 14.0
  },
  {
    "id": "http://arxiv.org/abs/2412.10507v1",
    "arxiv_id": "2412.10507v1",
    "title": "Crosstalk-induced Side Channel Threats in Multi-Tenant NISQ Computers",
    "summary": "As quantum computing rapidly advances, its near-term applications are becoming increasingly evident. However, the high cost and under-utilization of quantum resources are prompting a shift from single-user to multi-user access models. In a multi-tenant environment, where multiple users share one quantum computer, protecting user confidentiality becomes crucial. The varied uses of quantum computers increase the risk that sensitive data encoded by one user could be compromised by others, rendering the protection of data integrity and confidentiality essential. In the evolving quantum computing landscape, it is imperative to study these security challenges within the scope of realistic threat model assumptions, wherein an adversarial user can mount practical attacks without relying on any heightened privileges afforded by physical access to a quantum computer or rogue cloud services. In this paper, we demonstrate the potential of crosstalk as an attack vector for the first time on a Noisy Intermediate Scale Quantum (NISQ) machine, that an adversarial user can exploit within a multi-tenant quantum computing model. The proposed side-channel attack is conducted with minimal and realistic adversarial privileges, with the overarching aim of uncovering the quantum algorithm being executed by a victim. Crosstalk signatures are used to estimate the presence of CNOT gates in the victim circuit, and subsequently, this information is encoded and classified by a graph-based learning model to identify the victim quantum algorithm. When evaluated on up to 336 benchmark circuits, our attack framework is found to be able to unveil the victim's quantum algorithm with up to 85.7\\% accuracy.",
    "published": "2024-12-13T19:00:21Z",
    "updated": "2024-12-13T19:00:21Z",
    "authors": [
      "Navnil Choudhury",
      "Chaithanya Naik Mude",
      "Sanjay Das",
      "Preetham Chandra Tikkireddi",
      "Swamit Tannu",
      "Kanad Basu"
    ],
    "affiliations": [],
    "first_author": "Navnil Choudhury",
    "pdf_url": "https://arxiv.org/pdf/2412.10507v1",
    "primary_category": "cs.ET",
    "relevance_score": 11.0
  },
  {
    "id": "http://arxiv.org/abs/2409.11258v1",
    "arxiv_id": "2409.11258v1",
    "title": "Attacking Slicing Network via Side-channel Reinforcement Learning Attack",
    "summary": "Network slicing in 5G and the future 6G networks will enable the creation of multiple virtualized networks on a shared physical infrastructure. This innovative approach enables the provision of tailored networks to accommodate specific business types or industry users, thus delivering more customized and efficient services. However, the shared memory and cache in network slicing introduce security vulnerabilities that have yet to be fully addressed. In this paper, we introduce a reinforcement learning-based side-channel cache attack framework specifically designed for network slicing environments. Unlike traditional cache attack methods, our framework leverages reinforcement learning to dynamically identify and exploit cache locations storing sensitive information, such as authentication keys and user registration data. We assume that one slice network is compromised and demonstrate how the attacker can induce another shared slice to send registration requests, thereby estimating the cache locations of critical data. By formulating the cache timing channel attack as a reinforcement learning-driven guessing game between the attack slice and the victim slice, our model efficiently explores possible actions to pinpoint memory blocks containing sensitive information. Experimental results showcase the superiority of our approach, achieving a success rate of approximately 95\\% to 98\\% in accurately identifying the storage locations of sensitive data. This high level of accuracy underscores the potential risks in shared network slicing environments and highlights the need for robust security measures to safeguard against such advanced side-channel attacks.",
    "published": "2024-09-17T15:07:05Z",
    "updated": "2024-09-17T15:07:05Z",
    "authors": [
      "Wei Shao",
      "Chandra Thapa",
      "Rayne Holland",
      "Sarah Ali Siddiqui",
      "Seyit Camtepe"
    ],
    "affiliations": [],
    "first_author": "Wei Shao",
    "pdf_url": "https://arxiv.org/pdf/2409.11258v1",
    "primary_category": "cs.CR",
    "relevance_score": 9.0
  }
]