[
  {
    "title": "An Explainable AI Model for the Detecting Malicious Smart Contracts Based on EVM Opcode Based Features",
    "authors": [
      "Roopak Surendran"
    ],
    "published": "2025-12-09 16:34:23+00:00",
    "arxiv_id": "2512.08782v1",
    "summary": "Hackers may create malicious solidity programs and deploy it in the Ethereum block chain. These malicious smart contracts try to attack legitimate programs by exploiting its vulnerabilities such as reentrancy, tx.origin attack, bad randomness, deligatecall and so on. This may lead to drain of the fu",
    "pdf_url": "https://arxiv.org/pdf/2512.08782v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Agentic Artificial Intelligence for Ethical Cybersecurity in Uganda: A Reinforcement Learning Framework for Threat Detection in Resource-Constrained Environments",
    "authors": [
      "Ibrahim Adabara",
      "Bashir Olaniyi Sadiq",
      "Aliyu Nuhu Shuaibu",
      "Yale Ibrahim Danjuma",
      "Venkateswarlu Maninti",
      "Mutebi Joe"
    ],
    "published": "2025-12-08 05:44:25+00:00",
    "arxiv_id": "2512.07909v1",
    "summary": "Uganda's rapid digital transformation, supported by national strategies such as Vision 2040 and the Digital Transformation Roadmap, has expanded reliance on networked services while simultaneously increasing exposure to sophisticated cyber threats. In resource-constrained settings, commonly deployed",
    "pdf_url": "https://arxiv.org/pdf/2512.07909v1",
    "categories": [
      "cs.CR",
      "cs.CY"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "ThinkTrap: Denial-of-Service Attacks against Black-box LLM Services via Infinite Thinking",
    "authors": [
      "Yunzhe Li",
      "Jianan Wang",
      "Hongzi Zhu",
      "James Lin",
      "Shan Chang",
      "Minyi Guo"
    ],
    "published": "2025-12-08 01:41:57+00:00",
    "arxiv_id": "2512.07086v1",
    "summary": "Large Language Models (LLMs) have become foundational components in a wide range of applications, including natural language understanding and generation, embodied intelligence, and scientific discovery. As their computational requirements continue to grow, these models are increasingly deployed as ",
    "pdf_url": "https://arxiv.org/pdf/2512.07086v1",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "A Comprehensive Study of Supervised Machine Learning Models for Zero-Day Attack Detection: Analyzing Performance on Imbalanced Data",
    "authors": [
      "Zahra Lotfi",
      "Mostafa Lotfi"
    ],
    "published": "2025-12-07 22:42:37+00:00",
    "arxiv_id": "2512.07030v1",
    "summary": "Among the various types of cyberattacks, identifying zero-day attacks is problematic because they are unknown to security systems as their pattern and characteristics do not match known blacklisted attacks. There are many Machine Learning (ML) models designed to analyze and detect network attacks, e",
    "pdf_url": "https://arxiv.org/pdf/2512.07030v1",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Web Technologies Security in the AI Era: A Survey of CDN-Enhanced Defenses",
    "authors": [
      "Mehrab Hosain",
      "Sabbir Alom Shuvo",
      "Matthew Ogbe",
      "Md Shah Jalal Mazumder",
      "Yead Rahman",
      "Md Azizul Hakim",
      "Anukul Pandey"
    ],
    "published": "2025-12-06 10:42:14+00:00",
    "arxiv_id": "2512.06390v1",
    "summary": "The modern web stack, which is dominated by browser-based applications and API-first backends, now operates under an adversarial equilibrium where automated, AI-assisted attacks evolve continuously. Content Delivery Networks (CDNs) and edge computing place programmable defenses closest to users and ",
    "pdf_url": "https://arxiv.org/pdf/2512.06390v1",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG",
      "cs.NI",
      "cs.PF"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Hybrid Quantum-Classical Autoencoders for Unsupervised Network Intrusion Detection",
    "authors": [
      "Mohammad Arif Rasyidi",
      "Omar Alhussein",
      "Sami Muhaidat",
      "Ernesto Damiani"
    ],
    "published": "2025-12-04 18:29:05+00:00",
    "arxiv_id": "2512.05069v1",
    "summary": "Unsupervised anomaly-based intrusion detection requires models that can generalize to attack patterns not observed during training. This work presents the first large-scale evaluation of hybrid quantum-classical (HQC) autoencoders for this task. We construct a unified experimental framework that ite",
    "pdf_url": "https://arxiv.org/pdf/2512.05069v1",
    "categories": [
      "cs.LG",
      "cs.CR",
      "quant-ph"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "A Novel Trust-Based DDoS Cyberattack Detection Model for Smart Business Environments",
    "authors": [
      "Oghenetejiri Okporokpo",
      "Funminiyi Olajide",
      "Nemitari Ajienka",
      "Xiaoqi Ma"
    ],
    "published": "2025-12-04 14:37:55+00:00",
    "arxiv_id": "2512.04855v1",
    "summary": "As the frequency and complexity of Distributed Denial-of-Service (DDoS) attacks continue to increase, the level of threats posed to Smart Internet of Things (SIoT) business environments have also increased. These environments generally have several interconnected SIoT systems and devices that are in",
    "pdf_url": "https://arxiv.org/pdf/2512.04855v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Modeling Wavelet Transformed Quantum Support Vector for Network Intrusion Detection",
    "authors": [
      "Swati Kumari",
      "Shiva Raj Pokhrel",
      "Swathi Chandrasekhar",
      "Navneet Singh",
      "Hridoy Sankar Dutta",
      "Adnan Anwar",
      "Sutharshan Rajasegarar",
      "Robin Doss"
    ],
    "published": "2025-12-01 07:23:20+00:00",
    "arxiv_id": "2512.01365v1",
    "summary": "Network traffic anomaly detection is a critical cy- bersecurity challenge requiring robust solutions for complex Internet of Things (IoT) environments. We present a novel hybrid quantum-classical framework integrating an enhanced Quantum Support Vector Machine (QSVM) with the Quantum Haar Wavelet Pa",
    "pdf_url": "https://arxiv.org/pdf/2512.01365v1",
    "categories": [
      "quant-ph",
      "cs.LG"
    ],
    "primary_category": "quant-ph"
  },
  {
    "title": "SD-CGAN: Conditional Sinkhorn Divergence GAN for DDoS Anomaly Detection in IoT Networks",
    "authors": [
      "Henry Onyeka",
      "Emmanuel Samson",
      "Liang Hong",
      "Tariqul Islam",
      "Imtiaz Ahmed",
      "Kamrul Hasan"
    ],
    "published": "2025-11-28 23:57:51+00:00",
    "arxiv_id": "2512.00251v1",
    "summary": "The increasing complexity of IoT edge networks presents significant challenges for anomaly detection, particularly in identifying sophisticated Denial-of-Service (DoS) attacks and zero-day exploits under highly dynamic and imbalanced traffic conditions. This paper proposes SD-CGAN, a Conditional Gen",
    "pdf_url": "https://arxiv.org/pdf/2512.00251v1",
    "categories": [
      "cs.LG",
      "cs.CR"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "A Digital Twin Platform for QoS Optimization Under DoS Attacks for Next Generation Radio Networks",
    "authors": [
      "Mehmet Ali Erturk",
      "Kubra Duran",
      "Ahmed Al-Dubai",
      "Berk Canberk"
    ],
    "published": "2025-11-23 18:44:12+00:00",
    "arxiv_id": "2511.18577v1",
    "summary": "Digital Twins are being used as an enabling technology in 6G applications across various domains, valued for their data-driven insights and real-time decision-making capabilities. However, integrating Digital Twins into 6G environments presents challenges in maintaining consistent network services u",
    "pdf_url": "https://arxiv.org/pdf/2511.18577v1",
    "categories": [
      "cs.NI"
    ],
    "primary_category": "cs.NI"
  },
  {
    "title": "Carbon-Aware Intrusion Detection: A Comparative Study of Supervised and Unsupervised DRL for Sustainable IoT Edge Gateways",
    "authors": [
      "Saeid Jamshidi",
      "Foutse Khomh",
      "Kawser Wazed Nafi",
      "Amin Nikanjam",
      "Samira Keivanpour",
      "Omar Abdul-Wahab",
      "Martine Bellaiche"
    ],
    "published": "2025-11-23 00:59:27+00:00",
    "arxiv_id": "2511.18240v1",
    "summary": "The rapid expansion of the Internet of Things (IoT) has intensified cybersecurity challenges, particularly in mitigating Distributed Denial-of-Service (DDoS) attacks at the network edge. Traditional Intrusion Detection Systems (IDSs) face significant limitations, including poor adaptability to evolv",
    "pdf_url": "https://arxiv.org/pdf/2511.18240v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Think Fast: Real-Time IoT Intrusion Reasoning Using IDS and LLMs at the Edge Gateway",
    "authors": [
      "Saeid Jamshidi",
      "Amin Nikanjam",
      "Negar Shahabi",
      "Kawser Wazed Nafi",
      "Foutse Khomh",
      "Samira Keivanpour",
      "Rolando Herrero"
    ],
    "published": "2025-11-23 00:33:51+00:00",
    "arxiv_id": "2511.18230v1",
    "summary": "As the number of connected IoT devices continues to grow, securing these systems against cyber threats remains a major challenge, especially in environments with limited computational and energy resources. This paper presents an edge-centric Intrusion Detection System (IDS) framework that integrates",
    "pdf_url": "https://arxiv.org/pdf/2511.18230v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Federated Anomaly Detection and Mitigation for EV Charging Forecasting Under Cyberattacks",
    "authors": [
      "Oluleke Babayomi",
      "Dong-Seong Kim"
    ],
    "published": "2025-11-22 08:41:58+00:00",
    "arxiv_id": "2511.17978v1",
    "summary": "Electric Vehicle (EV) charging infrastructure faces escalating cybersecurity threats that can severely compromise operational efficiency and grid stability. Existing forecasting techniques are limited by the lack of combined robust anomaly mitigation solutions and data privacy preservation. Therefor",
    "pdf_url": "https://arxiv.org/pdf/2511.17978v1",
    "categories": [
      "cs.LG",
      "cs.CR"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "AutoGraphAD: A novel approach using Variational Graph Autoencoders for anomalous network flow detection",
    "authors": [
      "Georgios Anyfantis",
      "Pere Barlet-Ros"
    ],
    "published": "2025-11-21 10:22:00+00:00",
    "arxiv_id": "2511.17113v1",
    "summary": "Network Intrusion Detection Systems (NIDS) are essential tools for detecting network attacks and intrusions. While extensive research has explored the use of supervised Machine Learning for attack detection and characterisation, these methods require accurately labelled datasets, which are very cost",
    "pdf_url": "https://arxiv.org/pdf/2511.17113v1",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Distributed Pulse-Wave Simulator for DDoS Dataset Generation",
    "authors": [
      "Karim Khamaisi",
      "Pascal Kiechl",
      "Katharina Müller",
      "Burkhard Stiller",
      "Bruno Rodrigues"
    ],
    "published": "2025-11-16 20:56:55+00:00",
    "arxiv_id": "2511.12774v1",
    "summary": "Pulse-wave Distributed Denial-of-Service (DDoS) attacks generate short, synchronized bursts of traffic that circumvent pattern-based detection and quickly exhaust traditional defense systems. This transient and spatially distributed behavior makes analysis extremely challenging, as no public dataset",
    "pdf_url": "https://arxiv.org/pdf/2511.12774v1",
    "categories": [
      "cs.NI"
    ],
    "primary_category": "cs.NI"
  },
  {
    "title": "Cybersecurity of High-Altitude Platform Stations: Threat Taxonomy, Attacks and Defenses with Standards Mapping - DDoS Attack Use Case",
    "authors": [
      "Chaouki Hjaiji",
      "Bassem Ouni",
      "Mohamed-Slim Alouini"
    ],
    "published": "2025-11-16 20:28:58+00:00",
    "arxiv_id": "2511.12766v1",
    "summary": "High-Altitude Platform Stations (HAPS) are emerging stratospheric nodes within non-terrestrial networks. We provide a structured overview of HAPS subsystems and principal communication links, map cybersecurity and privacy exposure across communication, control, and power subsystems, and propose a st",
    "pdf_url": "https://arxiv.org/pdf/2511.12766v1",
    "categories": [
      "cs.CR",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "SecTracer: A Framework for Uncovering the Root Causes of Network Intrusions via Security Provenance",
    "authors": [
      "Seunghyeon Lee",
      "Hyunmin Seo",
      "Hwanjo Heo",
      "Anduo Wang",
      "Seungwon Shin",
      "Jinwoo Kim"
    ],
    "published": "2025-11-12 12:25:36+00:00",
    "arxiv_id": "2511.09266v1",
    "summary": "Modern enterprise networks comprise diverse and heterogeneous systems that support a wide range of services, making it challenging for administrators to track and analyze sophisticated attacks such as advanced persistent threats (APTs), which often exploit multiple vectors. To address this challenge",
    "pdf_url": "https://arxiv.org/pdf/2511.09266v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Binary and Multiclass Cyberattack Classification on GeNIS Dataset",
    "authors": [
      "Miguel Silva",
      "Daniela Pinto",
      "João Vitorino",
      "Eva Maia",
      "Isabel Praça",
      "Ivone Amorim",
      "Maria João Viamonte"
    ],
    "published": "2025-11-11 15:46:14+00:00",
    "arxiv_id": "2511.08660v1",
    "summary": "The integration of Artificial Intelligence (AI) in Network Intrusion Detection Systems (NIDS) is a promising approach to tackle the increasing sophistication of cyberattacks. However, since Machine Learning (ML) and Deep Learning (DL) models rely heavily on the quality of their training data, the la",
    "pdf_url": "https://arxiv.org/pdf/2511.08660v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Revisiting Network Traffic Analysis: Compatible network flows for ML models",
    "authors": [
      "João Vitorino",
      "Daniela Pinto",
      "Eva Maia",
      "Ivone Amorim",
      "Isabel Praça"
    ],
    "published": "2025-11-11 15:23:56+00:00",
    "arxiv_id": "2511.08345v1",
    "summary": "To ensure that Machine Learning (ML) models can perform a robust detection and classification of cyberattacks, it is essential to train them with high-quality datasets with relevant features. However, it can be difficult to accurately represent the complex traffic patterns of an attack, especially i",
    "pdf_url": "https://arxiv.org/pdf/2511.08345v1",
    "categories": [
      "cs.CR",
      "cs.LG",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "HybridGuard: Enhancing Minority-Class Intrusion Detection in Dew-Enabled Edge-of-Things Networks",
    "authors": [
      "Binayak Kara",
      "Ujjwal Sahua",
      "Ciza Thomas",
      "Jyoti Prakash Sahoo"
    ],
    "published": "2025-11-11 03:19:25+00:00",
    "arxiv_id": "2511.07793v1",
    "summary": "Securing Dew-Enabled Edge-of-Things (EoT) networks against sophisticated intrusions is a critical challenge. This paper presents HybridGuard, a framework that integrates machine learning and deep learning to improve intrusion detection. HybridGuard addresses data imbalance through mutual information",
    "pdf_url": "https://arxiv.org/pdf/2511.07793v1",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "RAG-targeted Adversarial Attack on LLM-based Threat Detection and Mitigation Framework",
    "authors": [
      "Seif Ikbarieh",
      "Kshitiz Aryal",
      "Maanak Gupta"
    ],
    "published": "2025-11-09 03:50:17+00:00",
    "arxiv_id": "2511.06212v1",
    "summary": "The rapid expansion of the Internet of Things (IoT) is reshaping communication and operational practices across industries, but it also broadens the attack surface and increases susceptibility to security breaches. Artificial Intelligence has become a valuable solution in securing IoT networks, with",
    "pdf_url": "https://arxiv.org/pdf/2511.06212v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "SmartSecChain-SDN: A Blockchain-Integrated Intelligent Framework for Secure and Efficient Software-Defined Networks",
    "authors": [
      "Azhar Hussain Mozumder",
      "M. John Basha",
      "Chayapathi A. R"
    ],
    "published": "2025-11-07 11:22:04+00:00",
    "arxiv_id": "2511.05156v1",
    "summary": "With more and more existing networks being transformed to Software-Defined Networking (SDN), they need to be more secure and demand smarter ways of traffic control. This work, SmartSecChain-SDN, is a platform that combines machine learning based intrusion detection, blockchain-based storage of logs,",
    "pdf_url": "https://arxiv.org/pdf/2511.05156v1",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Automated and Explainable Denial of Service Analysis for AI-Driven Intrusion Detection Systems",
    "authors": [
      "Paul Badu Yakubu",
      "Lesther Santana",
      "Mohamed Rahouti",
      "Yufeng Xin",
      "Abdellah Chehri",
      "Mohammed Aledhari"
    ],
    "published": "2025-11-06 07:01:38+00:00",
    "arxiv_id": "2511.04114v1",
    "summary": "With the increasing frequency and sophistication of Distributed Denial of Service (DDoS) attacks, it has become critical to develop more efficient and interpretable detection methods. Traditional detection systems often struggle with scalability and transparency, hindering real-time response and und",
    "pdf_url": "https://arxiv.org/pdf/2511.04114v1",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Temporal Analysis Framework for Intrusion Detection Systems: A Novel Taxonomy for Time-Aware Cybersecurity",
    "authors": [
      "Tatiana S. Parlanti",
      "Carlos A. Catania"
    ],
    "published": "2025-11-05 19:03:40+00:00",
    "arxiv_id": "2511.03799v1",
    "summary": "Most intrusion detection systems still identify attacks only after significant damage has occurred, detecting late-stage tactics rather than early indicators of compromise. This paper introduces a temporal analysis framework and taxonomy for time-aware network intrusion detection. Through a systemat",
    "pdf_url": "https://arxiv.org/pdf/2511.03799v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Integrity Under Siege: A Rogue gNodeB's Manipulation of 5G Network Slice Allocation",
    "authors": [
      "Jiali Xu",
      "Valeria Loscri",
      "Romain Rouvoy"
    ],
    "published": "2025-11-05 09:26:39+00:00",
    "arxiv_id": "2511.03312v1",
    "summary": "The advent of 5G networks, with network slicing as a cornerstone technology, promises customized, high-performance services, but also introduces novel attack surfaces beyond traditional threats. This article investigates a critical and underexplored integrity vulnerability: the manipulation of netwo",
    "pdf_url": "https://arxiv.org/pdf/2511.03312v1",
    "categories": [
      "cs.NI",
      "cs.SE"
    ],
    "primary_category": "cs.NI"
  },
  {
    "title": "Towards Ultra-Low Latency: Binarized Neural Network Architectures for In-Vehicle Network Intrusion Detection",
    "authors": [
      "Huiyao Dong",
      "Igor Kotenko"
    ],
    "published": "2025-11-02 06:47:56+00:00",
    "arxiv_id": "2511.00828v1",
    "summary": "The Control Area Network (CAN) protocol is essential for in-vehicle communication, facilitating high-speed data exchange among Electronic Control Units (ECUs). However, its inherent design lacks robust security features, rendering vehicles susceptible to cyberattacks. While recent research has inves",
    "pdf_url": "https://arxiv.org/pdf/2511.00828v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Proactive DDoS Detection and Mitigation in Decentralized Software-Defined Networking via Port-Level Monitoring and Zero-Training Large Language Models",
    "authors": [
      "Mohammed N. Swileh",
      "Shengli Zhang"
    ],
    "published": "2025-11-01 08:57:29+00:00",
    "arxiv_id": "2511.00460v1",
    "summary": "Centralized Software-Defined Networking (cSDN) offers flexible and programmable control of networks but suffers from scalability and reliability issues due to its reliance on centralized controllers. Decentralized SDN (dSDN) alleviates these concerns by distributing control across multiple local con",
    "pdf_url": "https://arxiv.org/pdf/2511.00460v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Mind the Gap: Missing Cyber Threat Coverage in NIDS Datasets for the Energy Sector",
    "authors": [
      "Adrita Rahman Tory",
      "Khondokar Fida Hasan",
      "Md Saifur Rahman",
      "Nickolaos Koroniotis",
      "Mohammad Ali Moni"
    ],
    "published": "2025-11-01 02:02:25+00:00",
    "arxiv_id": "2511.00360v1",
    "summary": "Network Intrusion Detection Systems (NIDS) developed using publicly available datasets predominantly focus on enterprise environments, raising concerns about their effectiveness for converged Information Technology (IT) and Operational Technology (OT) in energy infrastructures. This study evaluates ",
    "pdf_url": "https://arxiv.org/pdf/2511.00360v1",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Attention Augmented GNN RNN-Attention Models for Advanced Cybersecurity Intrusion Detection",
    "authors": [
      "Jayant Biradar",
      "Smit Shah",
      "Tanmay Naik"
    ],
    "published": "2025-10-29 03:47:02+00:00",
    "arxiv_id": "2510.25802v1",
    "summary": "In this paper, we propose a novel hybrid deep learning architecture that synergistically combines Graph Neural Networks (GNNs), Recurrent Neural Networks (RNNs), and multi-head attention mechanisms to significantly enhance cybersecurity intrusion detection capabilities. By leveraging the comprehensi",
    "pdf_url": "https://arxiv.org/pdf/2510.25802v1",
    "categories": [
      "cs.CR",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Network Intrusion Detection: Evolution from Conventional Approaches to LLM Collaboration and Emerging Risks",
    "authors": [
      "Yaokai Feng",
      "Kouichi Sakurai"
    ],
    "published": "2025-10-27 13:21:32+00:00",
    "arxiv_id": "2510.23313v2",
    "summary": "This survey systematizes the evolution of network intrusion detection systems (NIDS), from conventional methods such as signature-based and neural network (NN)-based approaches to recent integrations with large language models (LLMs). It clearly and concisely summarizes the current status, strengths",
    "pdf_url": "https://arxiv.org/pdf/2510.23313v2",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "AdaDoS: Adaptive DoS Attack via Deep Adversarial Reinforcement Learning in SDN",
    "authors": [
      "Wei Shao",
      "Yuhao Wang",
      "Rongguang He",
      "Muhammad Ejaz Ahmed",
      "Seyit Camtepe"
    ],
    "published": "2025-10-23 13:51:40+00:00",
    "arxiv_id": "2510.20566v1",
    "summary": "Existing defence mechanisms have demonstrated significant effectiveness in mitigating rule-based Denial-of-Service (DoS) attacks, leveraging predefined signatures and static heuristics to identify and block malicious traffic. However, the emergence of AI-driven techniques presents new challenges to ",
    "pdf_url": "https://arxiv.org/pdf/2510.20566v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Exploring the Effect of DNN Depth on Adversarial Attacks in Network Intrusion Detection Systems",
    "authors": [
      "Mohamed ElShehaby",
      "Ashraf Matrawy"
    ],
    "published": "2025-10-22 16:48:35+00:00",
    "arxiv_id": "2510.19761v1",
    "summary": "Adversarial attacks pose significant challenges to Machine Learning (ML) systems and especially Deep Neural Networks (DNNs) by subtly manipulating inputs to induce incorrect predictions. This paper investigates whether increasing the layer depth of deep neural networks affects their robustness again",
    "pdf_url": "https://arxiv.org/pdf/2510.19761v1",
    "categories": [
      "cs.CR",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "LAPRAD: LLM-Assisted PRotocol Attack Discovery",
    "authors": [
      "R. Can Aygun",
      "Yehuda Afek",
      "Anat Bremler-Barr",
      "Leonard Kleinrock"
    ],
    "published": "2025-10-22 05:47:41+00:00",
    "arxiv_id": "2510.19264v1",
    "summary": "With the goal of improving the security of Internet protocols, we seek faster, semi-automatic methods to discover new vulnerabilities in protocols such as DNS, BGP, and others. To this end, we introduce the LLM-Assisted Protocol Attack Discovery (LAPRAD) methodology, enabling security researchers wi",
    "pdf_url": "https://arxiv.org/pdf/2510.19264v1",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Securing IoT Communications via Anomaly Traffic Detection: Synergy of Genetic Algorithm and Ensemble Method",
    "authors": [
      "Behnam Seyedi",
      "Octavian Postolache"
    ],
    "published": "2025-10-21 22:42:05+00:00",
    "arxiv_id": "2510.19121v1",
    "summary": "The rapid growth of the Internet of Things (IoT) has transformed industries by enabling seamless data exchange among connected devices. However, IoT networks remain vulnerable to security threats such as denial of service (DoS) attacks, anomalous traffic, and data manipulation due to decentralized a",
    "pdf_url": "https://arxiv.org/pdf/2510.19121v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "From Flows to Words: Can Zero-/Few-Shot LLMs Detect Network Intrusions? A Grammar-Constrained, Calibrated Evaluation on UNSW-NB15",
    "authors": [
      "Mohammad Abdul Rehman",
      "Syed Imad Ali Shah",
      "Abbas Anwar",
      "Noor Islam"
    ],
    "published": "2025-10-18 02:11:50+00:00",
    "arxiv_id": "2510.17883v2",
    "summary": "Large Language Models (LLMs) can reason over natural-language inputs, but their role in intrusion detection without fine-tuning remains uncertain. This study evaluates a prompt-only approach on UNSW-NB15 by converting each network flow to a compact textual record and augmenting it with lightweight, ",
    "pdf_url": "https://arxiv.org/pdf/2510.17883v2",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "RHINO: Guided Reasoning for Mapping Network Logs to Adversarial Tactics and Techniques with Large Language Models",
    "authors": [
      "Fanchao Meng",
      "Jiaping Gui",
      "Yunbo Li",
      "Yue Wu"
    ],
    "published": "2025-10-16 02:25:46+00:00",
    "arxiv_id": "2510.14233v1",
    "summary": "Modern Network Intrusion Detection Systems generate vast volumes of low-level alerts, yet these outputs remain semantically fragmented, requiring labor-intensive manual correlation with high-level adversarial behaviors. Existing solutions for automating this mapping-rule-based systems and machine le",
    "pdf_url": "https://arxiv.org/pdf/2510.14233v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Anonymized Network Sensing using C++26 std::execution on GPUs",
    "authors": [
      "Michael Mandulak",
      "Sayan Ghosh",
      "S M Ferdous",
      "Mahantesh Halappanavar",
      "George Slota"
    ],
    "published": "2025-10-15 19:41:26+00:00",
    "arxiv_id": "2510.14050v1",
    "summary": "Large-scale network sensing plays a vital role in network traffic analysis and characterization. As network packet data grows increasingly large, parallel methods have become mainstream for network analytics. While effective, GPU-based implementations still face start-up challenges in host-device me",
    "pdf_url": "https://arxiv.org/pdf/2510.14050v1",
    "categories": [
      "cs.DC"
    ],
    "primary_category": "cs.DC"
  },
  {
    "title": "GRIDAI: Generating and Repairing Intrusion Detection Rules via Collaboration among Multiple LLM-based Agents",
    "authors": [
      "Jiarui Li",
      "Yuhan Chai",
      "Lei Du",
      "Chenyun Duan",
      "Hao Yan",
      "Zhaoquan Gu"
    ],
    "published": "2025-10-15 08:05:38+00:00",
    "arxiv_id": "2510.13257v1",
    "summary": "Rule-based network intrusion detection systems play a crucial role in the real-time detection of Web attacks. However, most existing works primarily focus on automatically generating detection rules for new attacks, often overlooking the relationships between new attacks and existing rules, which le",
    "pdf_url": "https://arxiv.org/pdf/2510.13257v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Privacy-Aware Framework of Robust Malware Detection in Indoor Robots: Hybrid Quantum Computing and Deep Neural Networks",
    "authors": [
      "Tan Le",
      "Van Le",
      "Sachin Shetty"
    ],
    "published": "2025-10-15 04:25:33+00:00",
    "arxiv_id": "2510.13136v1",
    "summary": "Indoor robotic systems within Cyber-Physical Systems (CPS) are increasingly exposed to Denial of Service (DoS) attacks that compromise localization, control and telemetry integrity. We propose a privacy-aware malware detection framework for indoor robotic systems, which leverages hybrid quantum comp",
    "pdf_url": "https://arxiv.org/pdf/2510.13136v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Over-Threshold Multiparty Private Set Intersection for Collaborative Network Intrusion Detection",
    "authors": [
      "Onur Eren Arpaci",
      "Raouf Boutaba",
      "Florian Kerschbaum"
    ],
    "published": "2025-10-14 00:58:58+00:00",
    "arxiv_id": "2510.12045v1",
    "summary": "An important function of collaborative network intrusion detection is to analyze the network logs of the collaborators for joint IP addresses. However, sharing IP addresses in plain is sensitive and may be even subject to privacy legislation as it is personally identifiable information. In this pape",
    "pdf_url": "https://arxiv.org/pdf/2510.12045v1",
    "categories": [
      "cs.CR",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Lightweight CNN-Based Wi-Fi Intrusion Detection Using 2D Traffic Representations",
    "authors": [
      "Rayed Suhail Ahmad",
      "Rehan Ahmad",
      "Quamar Niyaz"
    ],
    "published": "2025-10-13 19:59:24+00:00",
    "arxiv_id": "2510.11898v1",
    "summary": "Wi-Fi networks are ubiquitous in both home and enterprise environments, serving as a primary medium for Internet access and forming the backbone of modern IoT ecosystems. However, their inherent vulnerabilities, combined with widespread adoption, create opportunities for malicious actors to gain una",
    "pdf_url": "https://arxiv.org/pdf/2510.11898v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "A Comprehensive Survey of Website Fingerprinting Attacks and Defenses in Tor: Advances and Open Challenges",
    "authors": [
      "Yuwen Cui",
      "Guangjing Wang",
      "Khanh Vu",
      "Kai Wei",
      "Kehan Shen",
      "Zhengyuan Jiang",
      "Xiao Han",
      "Ning Wang",
      "Zhuo Lu",
      "Yao Liu"
    ],
    "published": "2025-10-13 18:03:05+00:00",
    "arxiv_id": "2510.11804v3",
    "summary": "The Tor network provides users with strong anonymity by routing their internet traffic through multiple relays. While Tor encrypts traffic and hides IP addresses, it remains vulnerable to traffic analysis attacks such as the website fingerprinting (WF) attack, achieving increasingly high fingerprint",
    "pdf_url": "https://arxiv.org/pdf/2510.11804v3",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "TAWRMAC: A Novel Dynamic Graph Representation Learning Method",
    "authors": [
      "Soheila Farokhi",
      "Xiaojun Qi",
      "Hamid Karimi"
    ],
    "published": "2025-10-10 21:38:07+00:00",
    "arxiv_id": "2510.09884v1",
    "summary": "Dynamic graph representation learning has become essential for analyzing evolving networks in domains such as social network analysis, recommendation systems, and traffic analysis. However, existing continuous-time methods face three key challenges: (1) some methods depend solely on node-specific me",
    "pdf_url": "https://arxiv.org/pdf/2510.09884v1",
    "categories": [
      "cs.LG"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "A Comprehensive Survey on Smart Home IoT Fingerprinting: From Detection to Prevention and Practical Deployment",
    "authors": [
      "Eduardo Baena",
      "Han Yang",
      "Dimitrios Koutsonikolas",
      "Israat Haque"
    ],
    "published": "2025-10-09 18:12:40+00:00",
    "arxiv_id": "2510.09700v1",
    "summary": "Smart homes are increasingly populated with heterogeneous Internet of Things (IoT) devices that interact continuously with users and the environment. This diversity introduces critical challenges in device identification, authentication, and security, where fingerprinting techniques have emerged as ",
    "pdf_url": "https://arxiv.org/pdf/2510.09700v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "A multi-layered embedded intrusion detection framework for programmable logic controllers",
    "authors": [
      "Rishabh Das. Aaron Werth",
      "Tommy Morris"
    ],
    "published": "2025-10-08 16:12:02+00:00",
    "arxiv_id": "2510.07171v1",
    "summary": "Industrial control system (ICS) operations use trusted endpoints like human machine interfaces (HMIs) and workstations to relay commands to programmable logic controllers (PLCs). Because most PLCs lack layered defenses, compromise of a trusted endpoint can drive unsafe actuator commands and risk saf",
    "pdf_url": "https://arxiv.org/pdf/2510.07171v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "GNN-enhanced Traffic Anomaly Detection for Next-Generation SDN-Enabled Consumer Electronics",
    "authors": [
      "Guan-Yan Yang",
      "Farn Wang",
      "Kuo-Hui Yeh"
    ],
    "published": "2025-10-08 15:01:40+00:00",
    "arxiv_id": "2510.07109v1",
    "summary": "Consumer electronics (CE) connected to the Internet of Things are susceptible to various attacks, including DDoS and web-based threats, which can compromise their functionality and facilitate remote hijacking. These vulnerabilities allow attackers to exploit CE for broader system attacks while enabl",
    "pdf_url": "https://arxiv.org/pdf/2510.07109v1",
    "categories": [
      "cs.CR",
      "cs.LG",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "From Description to Detection: LLM based Extendable O-RAN Compliant Blind DoS Detection in 5G and Beyond",
    "authors": [
      "Thusitha Dayaratne",
      "Ngoc Duy Pham",
      "Viet Vo",
      "Shangqi Lai",
      "Sharif Abuadbba",
      "Hajime Suzuki",
      "Xingliang Yuan",
      "Carsten Rudolph"
    ],
    "published": "2025-10-08 00:13:02+00:00",
    "arxiv_id": "2510.06530v1",
    "summary": "The quality and experience of mobile communication have significantly improved with the introduction of 5G, and these improvements are expected to continue beyond the 5G era. However, vulnerabilities in control-plane protocols, such as Radio Resource Control (RRC) and Non-Access Stratum (NAS), pose ",
    "pdf_url": "https://arxiv.org/pdf/2510.06530v1",
    "categories": [
      "cs.CR",
      "cs.ET",
      "cs.LG",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "DP-Adam-AC: Privacy-preserving Fine-Tuning of Localizable Language Models Using Adam Optimization with Adaptive Clipping",
    "authors": [
      "Ruoxing Yang"
    ],
    "published": "2025-10-06 18:56:15+00:00",
    "arxiv_id": "2510.05288v1",
    "summary": "Large language models (LLMs) such as ChatGPT have evolved into powerful and ubiquitous tools. Fine-tuning on small datasets allows LLMs to acquire specialized skills for specific tasks efficiently. Although LLMs provide great utility in both general and task-specific use cases, they are limited by t",
    "pdf_url": "https://arxiv.org/pdf/2510.05288v1",
    "categories": [
      "cs.LG",
      "cs.AI",
      "cs.CR"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "PoS-CoPOR: Proof-of-Stake Consensus Protocol with Native Onion Routing Providing Scalability and DoS-Resistance",
    "authors": [
      "Ivan Homoliak",
      "Martin Perešíni",
      "Marek Tamaškovič",
      "Timotej Ponek",
      "Lukáš Hellebrandt",
      "Kamil Malinka"
    ],
    "published": "2025-10-06 09:30:52+00:00",
    "arxiv_id": "2510.04619v1",
    "summary": "Proof-of-Stake (PoS) consensus protocols often face a trade-off between performance and security. Protocols that pre-elect leaders for subsequent rounds are vulnerable to Denial-of-Service (DoS) attacks, which can disrupt the network and compromise liveness. In this work, we present PoS-CoPOR, a sin",
    "pdf_url": "https://arxiv.org/pdf/2510.04619v1",
    "categories": [
      "cs.CR",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "PUL-Inter-slice Defender: An Anomaly Detection Solution for Distributed Slice Mobility Attacks",
    "authors": [
      "Ricardo Misael Ayala Molina",
      "Hyame Assem Alameddine",
      "Makan Pourzandi",
      "Chadi Assi"
    ],
    "published": "2025-10-02 17:24:17+00:00",
    "arxiv_id": "2510.02236v1",
    "summary": "Network Slices (NSs) are virtual networks operating over a shared physical infrastructure, each designed to meet specific application requirements while maintaining consistent Quality of Service (QoS). In Fifth Generation (5G) networks, User Equipment (UE) can connect to and seamlessly switch betwee",
    "pdf_url": "https://arxiv.org/pdf/2510.02236v1",
    "categories": [
      "cs.LG"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "Adaptive Deception Framework with Behavioral Analysis for Enhanced Cybersecurity Defense",
    "authors": [
      "Basil Abdullah AL-Zahrani"
    ],
    "published": "2025-10-02 16:52:05+00:00",
    "arxiv_id": "2510.02424v1",
    "summary": "This paper presents CADL (Cognitive-Adaptive Deception Layer), an adaptive deception framework achieving 99.88% detection rate with 0.13% false positive rate on the CICIDS2017 dataset. The framework employs ensemble machine learning (Random Forest, XGBoost, Neural Networks) combined with behavioral ",
    "pdf_url": "https://arxiv.org/pdf/2510.02424v1",
    "categories": [
      "cs.CR",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "IntrusionX: A Hybrid Convolutional-LSTM Deep Learning Framework with Squirrel Search Optimization for Network Intrusion Detection",
    "authors": [
      "Ahsan Farabi",
      "Muhaiminul Rashid Shad",
      "Israt Khandaker"
    ],
    "published": "2025-10-01 06:51:25+00:00",
    "arxiv_id": "2510.00572v2",
    "summary": "Intrusion Detection Systems (IDS) face persistent challenges due to evolving cyberattacks, high-dimensional traffic data, and severe class imbalance in benchmark datasets such as NSL-KDD. To address these issues, we propose IntrusionX, a hybrid deep learning framework that integrates Convolutional N",
    "pdf_url": "https://arxiv.org/pdf/2510.00572v2",
    "categories": [
      "cs.CR",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Multi-Layer Secret Sharing for Cross-Layer Attack Defense in 5G Networks: a COTS UE Demonstration",
    "authors": [
      "Wai Ming Chan",
      "Remi Chou",
      "Taejoon Kim"
    ],
    "published": "2025-09-29 17:21:30+00:00",
    "arxiv_id": "2510.13824v1",
    "summary": "This demo presents the first implementation of multi-layer secret sharing on commercial-off-the-shelf (COTS) 5G user equipment (UE), operating without infrastructure modifications or pre-shared keys. Our XOR-based approach distributes secret shares across network operators and distributed relays, en",
    "pdf_url": "https://arxiv.org/pdf/2510.13824v1",
    "categories": [
      "cs.CR",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Automated Vulnerability Validation and Verification: A Large Language Model Approach",
    "authors": [
      "Alireza Lotfi",
      "Charalampos Katsis",
      "Elisa Bertino"
    ],
    "published": "2025-09-28 19:16:12+00:00",
    "arxiv_id": "2509.24037v2",
    "summary": "Software vulnerabilities remain a critical security challenge, providing entry points for attackers into enterprise networks. Despite advances in security practices, the lack of high-quality datasets capturing diverse exploit behavior limits effective vulnerability assessment and mitigation. This pa",
    "pdf_url": "https://arxiv.org/pdf/2509.24037v2",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "An Investigation into the Performance of Non-Contrastive Self-Supervised Learning Methods for Network Intrusion Detection",
    "authors": [
      "Hamed Fard",
      "Tobias Schalau",
      "Gerhard Wunder"
    ],
    "published": "2025-09-27 12:36:17+00:00",
    "arxiv_id": "2510.02349v1",
    "summary": "Network intrusion detection, a well-explored cybersecurity field, has predominantly relied on supervised learning algorithms in the past two decades. However, their limitations in detecting only known anomalies prompt the exploration of alternative approaches. Motivated by the success of self-superv",
    "pdf_url": "https://arxiv.org/pdf/2510.02349v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "ExpIDS: A Drift-adaptable Network Intrusion Detection System With Improved Explainability",
    "authors": [
      "Ayush Kumar",
      "Kar Wai Fok",
      "Vrizlynn L. L. Thing"
    ],
    "published": "2025-09-25 05:47:42+00:00",
    "arxiv_id": "2509.20767v1",
    "summary": "Despite all the advantages associated with Network Intrusion Detection Systems (NIDSs) that utilize machine learning (ML) models, there is a significant reluctance among cyber security experts to implement these models in real-world production settings. This is primarily because of their opaque natu",
    "pdf_url": "https://arxiv.org/pdf/2509.20767v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Adversarial Defense in Cybersecurity: A Systematic Review of GANs for Threat Detection and Mitigation",
    "authors": [
      "Tharcisse Ndayipfukamiye",
      "Jianguo Ding",
      "Doreen Sebastian Sarwatt",
      "Adamu Gaston Philipo",
      "Huansheng Ning"
    ],
    "published": "2025-09-24 07:17:57+00:00",
    "arxiv_id": "2509.20411v2",
    "summary": "Machine learning-based cybersecurity systems are highly vulnerable to adversarial attacks, while Generative Adversarial Networks (GANs) act as both powerful attack enablers and promising defenses. This survey systematically reviews GAN-based adversarial defenses in cybersecurity (2021--August 31, 20",
    "pdf_url": "https://arxiv.org/pdf/2509.20411v2",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Towards Adapting Federated & Quantum Machine Learning for Network Intrusion Detection: A Survey",
    "authors": [
      "Devashish Chaudhary",
      "Sutharshan Rajasegarar",
      "Shiva Raj Pokhrel"
    ],
    "published": "2025-09-24 01:39:34+00:00",
    "arxiv_id": "2509.21389v2",
    "summary": "This survey explores the integration of Federated Learning (FL) with Network Intrusion Detection Systems (NIDS), with particular emphasis on deep learning and quantum machine learning approaches. FL enables collaborative model training across distributed devices while preserving data privacy-a criti",
    "pdf_url": "https://arxiv.org/pdf/2509.21389v2",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Federated Learning in the Wild: A Comparative Study for Cybersecurity under Non-IID and Unbalanced Settings",
    "authors": [
      "Roberto Doriguzzi-Corin",
      "Petr Sabel",
      "Silvio Cretti",
      "Silvio Ranise"
    ],
    "published": "2025-09-22 14:25:32+00:00",
    "arxiv_id": "2509.17836v1",
    "summary": "Machine Learning (ML) techniques have shown strong potential for network traffic analysis; however, their effectiveness depends on access to representative, up-to-date datasets, which is limited in cybersecurity due to privacy and data-sharing restrictions. To address this challenge, Federated Learn",
    "pdf_url": "https://arxiv.org/pdf/2509.17836v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "A Lightweight Approach for State Machine Replication",
    "authors": [
      "Christian Cachin",
      "Jinfeng Dou",
      "Christian Scheideler",
      "Philipp Schneider"
    ],
    "published": "2025-09-22 13:34:35+00:00",
    "arxiv_id": "2509.17771v2",
    "summary": "We present a lightweight solution for state machine replication with commitment certificates. Specifically, we adapt and analyze a median rule for the stabilizing consensus problem [Doerr11] to operate in a client-server setting where arbitrary servers may be blocked adaptively based on past system ",
    "pdf_url": "https://arxiv.org/pdf/2509.17771v2",
    "categories": [
      "cs.DC"
    ],
    "primary_category": "cs.DC"
  },
  {
    "title": "Self-Supervised Learning of Graph Representations for Network Intrusion Detection",
    "authors": [
      "Lorenzo Guerra",
      "Thomas Chapuis",
      "Guillaume Duc",
      "Pavlo Mozharovskyi",
      "Van-Tam Nguyen"
    ],
    "published": "2025-09-20 11:02:50+00:00",
    "arxiv_id": "2509.16625v4",
    "summary": "Detecting intrusions in network traffic is a challenging task, particularly under limited supervision and constantly evolving attack patterns. While recent works have leveraged graph neural networks for network intrusion detection, they often decouple representation learning from anomaly detection, ",
    "pdf_url": "https://arxiv.org/pdf/2509.16625v4",
    "categories": [
      "cs.LG",
      "cs.CR"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "ConCap: Practical Network Traffic Generation for Flow-based Intrusion Detection Systems",
    "authors": [
      "Miel Verkerken",
      "Laurens D'hooge",
      "Bruno Volckaert",
      "Filip De Turck",
      "Giovanni Apruzzese"
    ],
    "published": "2025-09-19 14:47:01+00:00",
    "arxiv_id": "2509.16038v1",
    "summary": "Network Intrusion Detection Systems (NIDS) have been studied in research for almost four decades. Yet, despite thousands of papers claiming scientific advances, a non-negligible number of recent works suggest that the findings of prior literature may be questionable. At the root of such a disagreeme",
    "pdf_url": "https://arxiv.org/pdf/2509.16038v1",
    "categories": [
      "cs.CR",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Inference Attacks on Encrypted Online Voting via Traffic Analysis",
    "authors": [
      "Anastasiia Belousova",
      "Francesco Marchiori",
      "Mauro Conti"
    ],
    "published": "2025-09-19 07:14:01+00:00",
    "arxiv_id": "2509.15694v1",
    "summary": "Online voting enables individuals to participate in elections remotely, offering greater efficiency and accessibility in both governmental and organizational settings. As this method gains popularity, ensuring the security of online voting systems becomes increasingly vital, as the systems supportin",
    "pdf_url": "https://arxiv.org/pdf/2509.15694v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Hybrid Deep Learning-Federated Learning Powered Intrusion Detection System for IoT/5G Advanced Edge Computing Network",
    "authors": [
      "Rasil Baidar",
      "Sasa Maric",
      "Robert Abbas"
    ],
    "published": "2025-09-19 03:23:51+00:00",
    "arxiv_id": "2509.15555v1",
    "summary": "The exponential expansion of IoT and 5G-Advanced applications has enlarged the attack surface for DDoS, malware, and zero-day intrusions. We propose an intrusion detection system that fuses a convolutional neural network (CNN), a bidirectional LSTM (BiLSTM), and an autoencoder (AE) bottleneck within",
    "pdf_url": "https://arxiv.org/pdf/2509.15555v1",
    "categories": [
      "cs.CR",
      "cs.LG",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Collaborative P4-SDN DDoS Detection and Mitigation with Early-Exit Neural Networks",
    "authors": [
      "Ouassim Karrakchou",
      "Alaa Zniber",
      "Anass Sebbar",
      "Mounir Ghogho"
    ],
    "published": "2025-09-15 10:43:29+00:00",
    "arxiv_id": "2509.12291v1",
    "summary": "Distributed Denial of Service (DDoS) attacks pose a persistent threat to network security, requiring timely and scalable mitigation strategies. In this paper, we propose a novel collaborative architecture that integrates a P4-programmable data plane with an SDN control plane to enable real-time DDoS",
    "pdf_url": "https://arxiv.org/pdf/2509.12291v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "On Spatial-Provenance Recovery in Wireless Networks with Relaxed-Privacy Constraints",
    "authors": [
      "Manish Bansal",
      "Pramsu Shrivastava",
      "J. Harshan"
    ],
    "published": "2025-09-15 10:28:52+00:00",
    "arxiv_id": "2509.11761v1",
    "summary": "In Vehicle-to-Everything (V2X) networks with multi-hop communication, Road Side Units (RSUs) intend to gather location data from the vehicles to offer various location-based services. Although vehicles use the Global Positioning System (GPS) for navigation, they may refrain from sharing their exact ",
    "pdf_url": "https://arxiv.org/pdf/2509.11761v1",
    "categories": [
      "cs.CR",
      "cs.IT"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Cyber Attack Mitigation Framework for Denial of Service (DoS) Attacks in Fog Computing",
    "authors": [
      "Fizza Khurshid",
      "Umara Noor",
      "Zahid Rashid"
    ],
    "published": "2025-09-15 08:09:23+00:00",
    "arxiv_id": "2509.11668v1",
    "summary": "Innovative solutions to cyber security issues are shaped by the ever-changing landscape of cyber threats. Automating the mitigation of these threats can be achieved through a new methodology that addresses the domain of mitigation automation, which is often overlooked. This literature overview empha",
    "pdf_url": "https://arxiv.org/pdf/2509.11668v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Dynamic Adaptive Parsing of Temporal and Cross-Variable Patterns for Network State Classification",
    "authors": [
      "Yuan Gao",
      "Xuelong Wang",
      "Zhenguo Dong",
      "Yong Zhang"
    ],
    "published": "2025-09-15 05:32:32+00:00",
    "arxiv_id": "2509.11601v1",
    "summary": "Effective network state classification is a primary task for ensuring network security and optimizing performance. Existing deep learning models have shown considerable progress in this area. Some methods excel at analyzing the complex temporal periodicities found in traffic data, while graph-based ",
    "pdf_url": "https://arxiv.org/pdf/2509.11601v1",
    "categories": [
      "cs.LG",
      "cs.AI"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "UDFS: Lightweight Representation-Driven Robust Network Traffic Classification",
    "authors": [
      "Youquan Xian",
      "Xueying Zeng",
      "Mei Huang",
      "Aoxiang Zhou",
      "Xiaoyu Cui",
      "Peng Liu",
      "Lei Cui"
    ],
    "published": "2025-09-14 08:27:20+00:00",
    "arxiv_id": "2509.11157v1",
    "summary": "In recent years, sequence features such as packet length have received considerable attention due to their central role in encrypted traffic analysis. Existing sequence modeling approaches can be broadly categorized into flow-level and trace-level methods: the former suffer from high feature redunda",
    "pdf_url": "https://arxiv.org/pdf/2509.11157v1",
    "categories": [
      "cs.NI",
      "cs.CR"
    ],
    "primary_category": "cs.NI"
  },
  {
    "title": "TPSQLi: Test Prioritization for SQL Injection Vulnerability Detection in Web Applications",
    "authors": [
      "Guan-Yan Yang",
      "Farn Wang",
      "You-Zong Gu",
      "Ya-Wen Teng",
      "Kuo-Hui Yeh",
      "Ping-Hsueh Ho",
      "Wei-Ling Wen"
    ],
    "published": "2025-09-13 17:39:31+00:00",
    "arxiv_id": "2509.10920v1",
    "summary": "The rapid proliferation of network applications has led to a significant increase in network attacks. According to the OWASP Top 10 Projects report released in 2021, injection attacks rank among the top three vulnerabilities in software projects. This growing threat landscape has increased the compl",
    "pdf_url": "https://arxiv.org/pdf/2509.10920v1",
    "categories": [
      "cs.SE",
      "cs.CR"
    ],
    "primary_category": "cs.SE"
  },
  {
    "title": "Deep Learning based Moving Target Defence for Federated Learning against Poisoning Attack in MEC Systems with a 6G Wireless Model",
    "authors": [
      "Somayeh Kianpisheh",
      "Tarik Taleb",
      "Jari Iinatti",
      "JaeSeung Song"
    ],
    "published": "2025-09-13 17:28:17+00:00",
    "arxiv_id": "2509.10914v1",
    "summary": "Collaboration opportunities for devices are facilitated with Federated Learning (FL). Edge computing facilitates aggregation at edge and reduces latency. To deal with model poisoning attacks, model-based outlier detection mechanisms may not operate efficiently with hetereogenous models or in recogni",
    "pdf_url": "https://arxiv.org/pdf/2509.10914v1",
    "categories": [
      "cs.NI"
    ],
    "primary_category": "cs.NI"
  },
  {
    "title": "Neurosymbolic AI Transfer Learning Improves Network Intrusion Detection",
    "authors": [
      "Huynh T. T. Tran",
      "Jacob Sander",
      "Achraf Cohen",
      "Brian Jalaian",
      "Nathaniel D. Bastian"
    ],
    "published": "2025-09-13 15:12:35+00:00",
    "arxiv_id": "2509.10850v1",
    "summary": "Transfer learning is commonly utilized in various fields such as computer vision, natural language processing, and medical imaging due to its impressive capability to address subtasks and work with different datasets. However, its application in cybersecurity has not been thoroughly explored. In thi",
    "pdf_url": "https://arxiv.org/pdf/2509.10850v1",
    "categories": [
      "cs.LG"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "Five Minutes of DDoS Brings down Tor: DDoS Attacks on the Tor Directory Protocol and Mitigations",
    "authors": [
      "Zhongtang Luo",
      "Jianting Zhang",
      "Akshat Neerati",
      "Aniket Kate"
    ],
    "published": "2025-09-12 23:50:43+00:00",
    "arxiv_id": "2509.10755v1",
    "summary": "The Tor network offers network anonymity to its users by routing their traffic through a sequence of relays. A group of nine directory authorities maintains information about all available relay nodes using a distributed directory protocol. We observe that the current protocol makes a steep synchron",
    "pdf_url": "https://arxiv.org/pdf/2509.10755v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Feature-Centric Approaches to Android Malware Analysis: A Survey",
    "authors": [
      "Shama Maganur",
      "Yili Jiang",
      "Jiaqi Huang",
      "Fangtian Zhong"
    ],
    "published": "2025-09-12 21:55:26+00:00",
    "arxiv_id": "2509.10709v1",
    "summary": "Sophisticated malware families exploit the openness of the Android platform to infiltrate IoT networks, enabling large-scale disruption, data exfiltration, and denial-of-service attacks. This systematic literature review (SLR) examines cutting-edge approaches to Android malware analysis with direct ",
    "pdf_url": "https://arxiv.org/pdf/2509.10709v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Investigating Feature Attribution for 5G Network Intrusion Detection",
    "authors": [
      "Federica Uccello",
      "Simin Nadjm-Tehrani"
    ],
    "published": "2025-09-12 12:55:48+00:00",
    "arxiv_id": "2509.10206v1",
    "summary": "With the rise of fifth-generation (5G) networks in critical applications, it is urgent to move from detection of malicious activity to systems capable of providing a reliable verdict suitable for mitigation. In this regard, understanding and interpreting machine learning (ML) models' security alerts",
    "pdf_url": "https://arxiv.org/pdf/2509.10206v1",
    "categories": [
      "cs.CR",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Taming Volatility: Stable and Private QUIC Classification with Federated Learning",
    "authors": [
      "Richard Jozsa",
      "Karel Hynek",
      "Adrian Pekar"
    ],
    "published": "2025-09-12 06:47:07+00:00",
    "arxiv_id": "2509.09997v1",
    "summary": "Federated Learning (FL) is a promising approach for privacy-preserving network traffic analysis, but its practical deployment is challenged by the non-IID nature of real-world data. While prior work has addressed statistical heterogeneity, the impact of temporal traffic volatility-the natural daily ",
    "pdf_url": "https://arxiv.org/pdf/2509.09997v1",
    "categories": [
      "cs.NI"
    ],
    "primary_category": "cs.NI"
  },
  {
    "title": "Securing LLM-Generated Embedded Firmware through AI Agent-Driven Validation and Patching",
    "authors": [
      "Seyed Moein Abtahi",
      "Akramul Azim"
    ],
    "published": "2025-09-12 05:15:35+00:00",
    "arxiv_id": "2509.09970v1",
    "summary": "Large Language Models (LLMs) show promise in generating firmware for embedded systems, but often introduce security flaws and fail to meet real-time performance constraints. This paper proposes a three-phase methodology that combines LLM-based firmware generation with automated security validation a",
    "pdf_url": "https://arxiv.org/pdf/2509.09970v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "What Does Normal Even Mean? Evaluating Benign Traffic in Intrusion Detection Datasets",
    "authors": [
      "Meghan Wilkinson",
      "Robert H Thomson"
    ],
    "published": "2025-09-11 15:55:21+00:00",
    "arxiv_id": "2509.09564v1",
    "summary": "Supervised machine learning techniques rely on labeled data to achieve high task performance, but this requires the labels to capture some meaningful differences in the underlying data structure. For training network intrusion detection algorithms, most datasets contain a series of attack classes an",
    "pdf_url": "https://arxiv.org/pdf/2509.09564v1",
    "categories": [
      "cs.CR",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "PARROT: Portable Android Reproducible traffic Observation Tool",
    "authors": [
      "Andrea Jimenez-Berenguel",
      "Celeste Campo",
      "Marta Moure-Garrido",
      "Carlos Garcia-Rubio",
      "Daniel Díaz-Sanchez",
      "Florina Almenares"
    ],
    "published": "2025-09-11 15:29:19+00:00",
    "arxiv_id": "2509.09537v1",
    "summary": "The rapid evolution of mobile security protocols and limited availability of current datasets constrains research in app traffic analysis. This paper presents PARROT, a reproducible and portable traffic capture system for systematic app traffic collection using Android Virtual Devices. The system pr",
    "pdf_url": "https://arxiv.org/pdf/2509.09537v1",
    "categories": [
      "cs.NI"
    ],
    "primary_category": "cs.NI"
  },
  {
    "title": "A Hybrid CNN-LSTM Deep Learning Model for Intrusion Detection in Smart Grid",
    "authors": [
      "Abdulhakim Alsaiari",
      "Mohammad Ilyas"
    ],
    "published": "2025-09-08 20:41:31+00:00",
    "arxiv_id": "2509.07208v1",
    "summary": "The evolution of the traditional power grid into the \"smart grid\" has resulted in a fundamental shift in energy management, which allows the integration of renewable energy sources with modern communication technology. However, this interconnection has increased smart grids' vulnerability to attacke",
    "pdf_url": "https://arxiv.org/pdf/2509.07208v1",
    "categories": [
      "cs.AI"
    ],
    "primary_category": "cs.AI"
  },
  {
    "title": "Contrastive Self-Supervised Network Intrusion Detection using Augmented Negative Pairs",
    "authors": [
      "Jack Wilkie",
      "Hanan Hindy",
      "Christos Tachtatzis",
      "Robert Atkinson"
    ],
    "published": "2025-09-08 11:04:10+00:00",
    "arxiv_id": "2509.06550v1",
    "summary": "Network intrusion detection remains a critical challenge in cybersecurity. While supervised machine learning models achieve state-of-the-art performance, their reliance on large labelled datasets makes them impractical for many real-world applications. Anomaly detection methods, which train exclusiv",
    "pdf_url": "https://arxiv.org/pdf/2509.06550v1",
    "categories": [
      "cs.LG",
      "cs.AI",
      "cs.CR",
      "cs.NI"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "Lightweight Intrusion Detection System Using a Hybrid CNN and ConvNeXt-Tiny Model for Internet of Things Networks",
    "authors": [
      "Fatemeh Roshanzadeh",
      "Hamid Barati",
      "Ali Barati"
    ],
    "published": "2025-09-07 20:32:38+00:00",
    "arxiv_id": "2509.06202v1",
    "summary": "The rapid expansion of Internet of Things (IoT) systems across various domains such as industry, smart cities, healthcare, manufacturing, and government services has led to a significant increase in security risks, threatening data integrity, confidentiality, and availability. Consequently, ensuring",
    "pdf_url": "https://arxiv.org/pdf/2509.06202v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Robust DDoS-Attack Classification with 3D CNNs Against Adversarial Methods",
    "authors": [
      "Landon Bragg",
      "Nathan Dorsey",
      "Josh Prior",
      "John Ajit",
      "Ben Kim",
      "Nate Willis",
      "Pablo Rivas"
    ],
    "published": "2025-09-07 00:20:32+00:00",
    "arxiv_id": "2509.10543v1",
    "summary": "Distributed Denial-of-Service (DDoS) attacks remain a serious threat to online infrastructure, often bypassing detection by altering traffic in subtle ways. We present a method using hive-plot sequences of network data and a 3D convolutional neural network (3D CNN) to classify DDoS traffic with high",
    "pdf_url": "https://arxiv.org/pdf/2509.10543v1",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "A transformer-BiGRU-based framework with data augmentation and confident learning for network intrusion detection",
    "authors": [
      "Jiale Zhang",
      "Pengfei He",
      "Fei Li",
      "Kewei Li",
      "Yan Wang",
      "Lan Huang",
      "Ruochi Zhang",
      "Fengfeng Zhou"
    ],
    "published": "2025-09-05 08:42:20+00:00",
    "arxiv_id": "2509.04925v1",
    "summary": "In today's fast-paced digital communication, the surge in network traffic data and frequency demands robust and precise network intrusion solutions. Conventional machine learning methods struggle to grapple with complex patterns within the vast network intrusion datasets, which suffer from data scar",
    "pdf_url": "https://arxiv.org/pdf/2509.04925v1",
    "categories": [
      "cs.LG",
      "cs.CR"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "Quantum AI Algorithm Development for Enhanced Cybersecurity: A Hybrid Approach to Malware Detection",
    "authors": [
      "Tanya Joshi",
      "Krishnendu Guha"
    ],
    "published": "2025-09-04 09:28:05+00:00",
    "arxiv_id": "2509.05370v1",
    "summary": "This study explores the application of quantum machine learning (QML) algorithms to enhance cybersecurity threat detection, particularly in the classification of malware and intrusion detection within high-dimensional datasets. Classical machine learning approaches encounter limitations when dealing",
    "pdf_url": "https://arxiv.org/pdf/2509.05370v1",
    "categories": [
      "cs.CR",
      "cs.ET"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "A Framework for Detection and Classification of Attacks on Surveillance Cameras under IoT Networks",
    "authors": [
      "Umair Amjid",
      "M. Umar Khan",
      "S. A. Manan Kirmani"
    ],
    "published": "2025-09-04 05:33:41+00:00",
    "arxiv_id": "2509.05366v1",
    "summary": "The increasing use of Internet of Things (IoT) devices has led to a rise in security related concerns regarding IoT Networks. The surveillance cameras in IoT networks are vulnerable to security threats such as brute force and zero-day attacks which can lead to unauthorized access by hackers and pote",
    "pdf_url": "https://arxiv.org/pdf/2509.05366v1",
    "categories": [
      "cs.CR",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Real-time ML-based Defense Against Malicious Payload in Reconfigurable Embedded Systems",
    "authors": [
      "Rye Stahle-Smith",
      "Rasha Karakchi"
    ],
    "published": "2025-09-02 14:52:43+00:00",
    "arxiv_id": "2509.02387v1",
    "summary": "The growing use of FPGAs in reconfigurable systems introducessecurity risks through malicious bitstreams that could cause denial-of-service (DoS), data leakage, or covert attacks. We investigated chip-level hardware malicious payload in embedded systems and proposed a supervised machine learning met",
    "pdf_url": "https://arxiv.org/pdf/2509.02387v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Forecasting Future DDoS Attacks Using Long Short Term Memory (LSTM) Model",
    "authors": [
      "Kong Mun Yeen",
      "Rafidah Md Noor",
      "Wahidah Md Shah",
      "Aslinda Hassan",
      "Muhammad Umair Munir"
    ],
    "published": "2025-09-02 08:26:51+00:00",
    "arxiv_id": "2509.02076v1",
    "summary": "This paper forecasts future Distributed Denial of Service (DDoS) attacks using deep learning models. Although several studies address forecasting DDoS attacks, they remain relatively limited compared to detection-focused research. By studying the current trends and forecasting based on newer and upd",
    "pdf_url": "https://arxiv.org/pdf/2509.02076v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Throttling Web Agents Using Reasoning Gates",
    "authors": [
      "Abhinav Kumar",
      "Jaechul Roh",
      "Ali Naseh",
      "Amir Houmansadr",
      "Eugene Bagdasarian"
    ],
    "published": "2025-09-01 16:56:16+00:00",
    "arxiv_id": "2509.01619v1",
    "summary": "AI web agents use Internet resources at far greater speed, scale, and complexity -- changing how users and services interact. Deployed maliciously or erroneously, these agents could overload content providers. At the same time, web agents can bypass CAPTCHAs and other defenses by mimicking user beha",
    "pdf_url": "https://arxiv.org/pdf/2509.01619v1",
    "categories": [
      "cs.AI",
      "cs.CR",
      "cs.LG"
    ],
    "primary_category": "cs.AI"
  },
  {
    "title": "An Efficient Intrusion Detection System for Safeguarding Radiation Detection Systems",
    "authors": [
      "Nathanael Coolidge",
      "Jaime González Sanz",
      "Li Yang",
      "Khalil El Khatib",
      "Glenn Harvel",
      "Nelson Agbemava",
      "I Putu Susila",
      "Mehmet Yavuz Yagci"
    ],
    "published": "2025-09-01 16:31:46+00:00",
    "arxiv_id": "2509.01599v1",
    "summary": "Radiation Detection Systems (RDSs) are used to measure and detect abnormal levels of radioactive material in the environment. These systems are used in many applications to mitigate threats posed by high levels of radioactive material. However, these systems lack protection against malicious externa",
    "pdf_url": "https://arxiv.org/pdf/2509.01599v1",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG",
      "eess.SY"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Securing Radiation Detection Systems with an Efficient TinyML-Based IDS for Edge Devices",
    "authors": [
      "Einstein Rivas Pizarro",
      "Wajiha Zaheer",
      "Li Yang",
      "Khalil El-Khatib",
      "Glenn Harvel"
    ],
    "published": "2025-09-01 16:26:37+00:00",
    "arxiv_id": "2509.01592v1",
    "summary": "Radiation Detection Systems (RDSs) play a vital role in ensuring public safety across various settings, from nuclear facilities to medical environments. However, these systems are increasingly vulnerable to cyber-attacks such as data injection, man-in-the-middle (MITM) attacks, ICMP floods, botnet a",
    "pdf_url": "https://arxiv.org/pdf/2509.01592v1",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG",
      "eess.SY"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "SpliDT: Partitioned Decision Trees for Scalable Stateful Inference at Line Rate",
    "authors": [
      "Murayyiam Parvez",
      "Annus Zulfiqar",
      "Roman Beltiukov",
      "Shir Landau Feibish",
      "Walter Willinger",
      "Arpit Gupta",
      "Muhammad Shahbaz"
    ],
    "published": "2025-08-30 07:30:12+00:00",
    "arxiv_id": "2509.00397v1",
    "summary": "Machine learning (ML) is increasingly being deployed in programmable data planes (switches and SmartNICs) to enable real-time traffic analysis, security monitoring, and in-network decision-making. Decision trees (DTs) are particularly well-suited for these tasks due to their interpretability and com",
    "pdf_url": "https://arxiv.org/pdf/2509.00397v1",
    "categories": [
      "cs.NI"
    ],
    "primary_category": "cs.NI"
  },
  {
    "title": "FlowletFormer: Network Behavioral Semantic Aware Pre-training Model for Traffic Classification",
    "authors": [
      "Liming Liu",
      "Ruoyu Li",
      "Qing Li",
      "Meijia Hou",
      "Yong Jiang",
      "Mingwei Xu"
    ],
    "published": "2025-08-27 14:32:15+00:00",
    "arxiv_id": "2508.19924v1",
    "summary": "Network traffic classification using pre-training models has shown promising results, but existing methods struggle to capture packet structural characteristics, flow-level behaviors, hierarchical protocol semantics, and inter-packet contextual relationships. To address these challenges, we propose ",
    "pdf_url": "https://arxiv.org/pdf/2508.19924v1",
    "categories": [
      "cs.LG"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "Experimental Assessment of a Multi-Class AI/ML Architecture for Real-Time Characterization of Cyber Events in a Live Research Reactor",
    "authors": [
      "Zachery Dahm",
      "Konstantinos Vasili",
      "Vasileios Theos",
      "Konstantinos Gkouliaras",
      "William Richards",
      "True Miller",
      "Brian Jowers",
      "Stylianos Chatzidakis"
    ],
    "published": "2025-08-26 18:24:13+00:00",
    "arxiv_id": "2509.00076v1",
    "summary": "There is increased interest in applying Artificial Intelligence and Machine Learning (AI/ML) within the nuclear industry and nuclear engineering community. Effective implementation of AI/ML could offer benefits to the nuclear domain, including enhanced identification of anomalies, anticipation of sy",
    "pdf_url": "https://arxiv.org/pdf/2509.00076v1",
    "categories": [
      "cs.LG"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "A Comprehensive Review of Denial of Wallet Attacks in Serverless Architectures",
    "authors": [
      "Mark Dorsett",
      "Scott Mann",
      "Jabed Chowdhury",
      "Abdun Mahmood"
    ],
    "published": "2025-08-24 13:29:21+00:00",
    "arxiv_id": "2508.19284v1",
    "summary": "The Denial of Wallet (DoW) attack poses a unique and growing threat to serverless architectures that rely on Function-as-a-Service (FaaS) models, exploiting the cost structure of pay-as-you-go billing to financially burden application owners. Unlike traditional Denial of Service (DoS) attacks, which",
    "pdf_url": "https://arxiv.org/pdf/2508.19284v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "MixGAN: A Hybrid Semi-Supervised and Generative Approach for DDoS Detection in Cloud-Integrated IoT Networks",
    "authors": [
      "Tongxi Wu",
      "Chenwei Xu",
      "Jin Yang"
    ],
    "published": "2025-08-22 20:13:29+00:00",
    "arxiv_id": "2508.19273v1",
    "summary": "The proliferation of cloud-integrated IoT systems has intensified exposure to Distributed Denial of Service (DDoS) attacks due to the expanded attack surface, heterogeneous device behaviors, and limited edge protection. However, DDoS detection in this context remains challenging because of complex t",
    "pdf_url": "https://arxiv.org/pdf/2508.19273v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Time Series Based Network Intrusion Detection using MTF-Aided Transformer",
    "authors": [
      "Poorvi Joshi",
      "Mohan Gurusamy"
    ],
    "published": "2025-08-22 01:54:35+00:00",
    "arxiv_id": "2508.16035v1",
    "summary": "This paper introduces a novel approach to time series classification using a Markov Transition Field (MTF)-aided Transformer model, specifically designed for Software-Defined Networks (SDNs). The proposed model integrates the temporal dependency modeling strengths of MTFs with the sophisticated patt",
    "pdf_url": "https://arxiv.org/pdf/2508.16035v1",
    "categories": [
      "cs.NI",
      "cs.AI"
    ],
    "primary_category": "cs.NI"
  },
  {
    "title": "Noise Robust One-Class Intrusion Detection on Dynamic Graphs",
    "authors": [
      "Aleksei Liuliakov",
      "Alexander Schulz",
      "Luca Hermes",
      "Barbara Hammer"
    ],
    "published": "2025-08-19 18:36:11+00:00",
    "arxiv_id": "2508.14192v1",
    "summary": "In the domain of network intrusion detection, robustness against contaminated and noisy data inputs remains a critical challenge. This study introduces a probabilistic version of the Temporal Graph Network Support Vector Data Description (TGN-SVDD) model, designed to enhance detection accuracy in th",
    "pdf_url": "https://arxiv.org/pdf/2508.14192v1",
    "categories": [
      "cs.LG",
      "stat.ML"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "Security-as-a-Function for IDS/IPS in Softwarized Network and Applications to 5G Network Systems",
    "authors": [
      "Shivank Malik",
      "Samaresh Bera"
    ],
    "published": "2025-08-19 07:30:49+00:00",
    "arxiv_id": "2508.13581v1",
    "summary": "The service-based architecture of 5G network allows network operators to place virtualized network functions on commodity hardware, unlike the traditional vendor-specific hardware-based functionalities. However, it expands the security vulnerabilities and threats to the 5G network. While there exist",
    "pdf_url": "https://arxiv.org/pdf/2508.13581v1",
    "categories": [
      "cs.NI",
      "cs.ET"
    ],
    "primary_category": "cs.NI"
  },
  {
    "title": "DDoS Attacks in Cloud Computing: Detection and Prevention",
    "authors": [
      "Zain Ahmad",
      "Musab Ahmad",
      "Bilal Ahmad"
    ],
    "published": "2025-08-19 05:27:37+00:00",
    "arxiv_id": "2508.13522v1",
    "summary": "DDoS attacks are one of the most prevalent and harmful cybersecurity threats faced by organizations and individuals today. In recent years, the complexity and frequency of DDoS attacks have increased significantly, making it challenging to detect and mitigate them effectively. The study analyzes var",
    "pdf_url": "https://arxiv.org/pdf/2508.13522v1",
    "categories": [
      "cs.DC",
      "cs.AI",
      "cs.CR"
    ],
    "primary_category": "cs.DC"
  },
  {
    "title": "A Transformer-Based Approach for DDoS Attack Detection in IoT Networks",
    "authors": [
      "Sandipan Dey",
      "Payal Santosh Kate",
      "Vatsala Upadhyay",
      "Abhishek Vaish"
    ],
    "published": "2025-08-14 13:33:49+00:00",
    "arxiv_id": "2508.10636v1",
    "summary": "DDoS attacks have become a major threat to the security of IoT devices and can cause severe damage to the network infrastructure. IoT devices suffer from the inherent problem of resource constraints and are therefore susceptible to such resource-exhausting attacks. Traditional methods for detecting ",
    "pdf_url": "https://arxiv.org/pdf/2508.10636v1",
    "categories": [
      "cs.CR",
      "cs.IT"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Enhancing GraphQL Security by Detecting Malicious Queries Using Large Language Models, Sentence Transformers, and Convolutional Neural Networks",
    "authors": [
      "Irash Perera",
      "Hiranya Abeyrathne",
      "Sanjeewa Malalgoda",
      "Arshardh Ifthikar"
    ],
    "published": "2025-08-14 07:35:11+00:00",
    "arxiv_id": "2508.11711v2",
    "summary": "GraphQL's flexibility, while beneficial for efficient data fetching, introduces unique security vulnerabilities that traditional API security mechanisms often fail to address. Malicious GraphQL queries can exploit the language's dynamic nature, leading to denial-of-service attacks, data exfiltration",
    "pdf_url": "https://arxiv.org/pdf/2508.11711v2",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "A Hierarchical IDS for Zero-Day Attack Detection in Internet of Medical Things Networks",
    "authors": [
      "Md Ashraf Uddin",
      "Nam H. Chu",
      "Reza Rafeh"
    ],
    "published": "2025-08-14 05:08:37+00:00",
    "arxiv_id": "2508.10346v1",
    "summary": "The Internet of Medical Things (IoMT) is driving a healthcare revolution but remains vulnerable to cyberattacks such as denial of service, ransomware, data hijacking, and spoofing. These networks comprise resource constrained, heterogeneous devices (e.g., wearable sensors, smart pills, implantables)",
    "pdf_url": "https://arxiv.org/pdf/2508.10346v1",
    "categories": [
      "cs.LG",
      "cs.NI"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "Security Analysis of ChatGPT: Threats and Privacy Risks",
    "authors": [
      "Yushan Xiang",
      "Zhongwen Li",
      "Xiaoqi Li"
    ],
    "published": "2025-08-13 02:03:18+00:00",
    "arxiv_id": "2508.09426v1",
    "summary": "As artificial intelligence technology continues to advance, chatbots are becoming increasingly powerful. Among them, ChatGPT, launched by OpenAI, has garnered widespread attention globally due to its powerful natural language processing capabilities based on the GPT model, which enables it to engage",
    "pdf_url": "https://arxiv.org/pdf/2508.09426v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Developing a Transferable Federated Network Intrusion Detection System",
    "authors": [
      "Abu Shafin Mohammad Mahdee Jameel",
      "Shreya Ghosh",
      "Aly El Gamal"
    ],
    "published": "2025-08-12 16:22:29+00:00",
    "arxiv_id": "2508.09060v1",
    "summary": "Intrusion Detection Systems (IDS) are a vital part of a network-connected device. In this paper, we develop a deep learning based intrusion detection system that is deployed in a distributed setup across devices connected to a network. Our aim is to better equip deep learning models against unknown ",
    "pdf_url": "https://arxiv.org/pdf/2508.09060v1",
    "categories": [
      "cs.CR",
      "cs.LG",
      "cs.NI",
      "eess.SP"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "FetFIDS: A Feature Embedding Attention based Federated Network Intrusion Detection Algorithm",
    "authors": [
      "Shreya Ghosh",
      "Abu Shafin Mohammad Mahdee Jameel",
      "Aly El Gamal"
    ],
    "published": "2025-08-12 16:16:29+00:00",
    "arxiv_id": "2508.09056v1",
    "summary": "Intrusion Detection Systems (IDS) have an increasingly important role in preventing exploitation of network vulnerabilities by malicious actors. Recent deep learning based developments have resulted in significant improvements in the performance of IDS systems. In this paper, we present FetFIDS, whe",
    "pdf_url": "https://arxiv.org/pdf/2508.09056v1",
    "categories": [
      "cs.LG",
      "cs.CR",
      "cs.NI",
      "eess.SP"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "NetMoniAI: An Agentic AI Framework for Network Security & Monitoring",
    "authors": [
      "Pallavi Zambare",
      "Venkata Nikhil Thanikella",
      "Nikhil Padmanabh Kottur",
      "Sree Akhil Akula",
      "Ying Liu"
    ],
    "published": "2025-08-12 15:48:53+00:00",
    "arxiv_id": "2508.10052v1",
    "summary": "In this paper, we present NetMoniAI, an agentic AI framework for automatic network monitoring and security that integrates decentralized analysis with lightweight centralized coordination. The framework consists of two layers: autonomous micro-agents at each node perform local traffic analysis and a",
    "pdf_url": "https://arxiv.org/pdf/2508.10052v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Hypervisor-based Double Extortion Ransomware Detection Method Using Kitsune Network Features",
    "authors": [
      "Manabu Hirano",
      "Ryotaro Kobayashi"
    ],
    "published": "2025-08-12 05:45:05+00:00",
    "arxiv_id": "2508.08655v1",
    "summary": "Double extortion ransomware attacks have become mainstream since many organizations adopt more robust and resilient data backup strategies against conventional crypto-ransomware. This paper presents detailed attack stages, tactics, procedures, and tools used in the double extortion ransomware attack",
    "pdf_url": "https://arxiv.org/pdf/2508.08655v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Securing Agentic AI: Threat Modeling and Risk Analysis for Network Monitoring Agentic AI System",
    "authors": [
      "Pallavi Zambare",
      "Venkata Nikhil Thanikella",
      "Ying Liu"
    ],
    "published": "2025-08-12 00:14:12+00:00",
    "arxiv_id": "2508.10043v1",
    "summary": "When combining Large Language Models (LLMs) with autonomous agents, used in network monitoring and decision-making systems, this will create serious security issues. In this research, the MAESTRO framework consisting of the seven layers threat modeling architecture in the system was used to expose, ",
    "pdf_url": "https://arxiv.org/pdf/2508.10043v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "AIS-LLM: A Unified Framework for Maritime Trajectory Prediction, Anomaly Detection, and Collision Risk Assessment with Explainable Forecasting",
    "authors": [
      "Hyobin Park",
      "Jinwook Jung",
      "Minseok Seo",
      "Hyunsoo Choi",
      "Deukjae Cho",
      "Sekil Park",
      "Dong-Geol Choi"
    ],
    "published": "2025-08-11 06:39:45+00:00",
    "arxiv_id": "2508.07668v1",
    "summary": "With the increase in maritime traffic and the mandatory implementation of the Automatic Identification System (AIS), the importance and diversity of maritime traffic analysis tasks based on AIS data, such as vessel trajectory prediction, anomaly detection, and collision risk assessment, is rapidly g",
    "pdf_url": "https://arxiv.org/pdf/2508.07668v1",
    "categories": [
      "cs.LG",
      "cs.AI"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "Multi-Stage Knowledge-Distilled VGAE and GAT for Robust Controller-Area-Network Intrusion Detection",
    "authors": [
      "Robert Frenken",
      "Sidra Ghayour Bhatti",
      "Hanqin Zhang",
      "Qadeer Ahmed"
    ],
    "published": "2025-08-06 19:50:26+00:00",
    "arxiv_id": "2508.04845v1",
    "summary": "The Controller Area Network (CAN) protocol is a standard for in-vehicle communication but remains susceptible to cyber-attacks due to its lack of built-in security. This paper presents a multi-stage intrusion detection framework leveraging unsupervised anomaly detection and supervised graph learning",
    "pdf_url": "https://arxiv.org/pdf/2508.04845v1",
    "categories": [
      "cs.LG",
      "cs.AI"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "Neuromorphic Cybersecurity with Semi-supervised Lifelong Learning",
    "authors": [
      "Md Zesun Ahmed Mia",
      "Malyaban Bal",
      "Sen Lu",
      "George M. Nishibuchi",
      "Suhas Chelian",
      "Srini Vasan",
      "Abhronil Sengupta"
    ],
    "published": "2025-08-06 16:29:59+00:00",
    "arxiv_id": "2508.04610v2",
    "summary": "Inspired by the brain's hierarchical processing and energy efficiency, this paper presents a Spiking Neural Network (SNN) architecture for lifelong Network Intrusion Detection System (NIDS). The proposed system first employs an efficient static SNN to identify potential intrusions, which then activa",
    "pdf_url": "https://arxiv.org/pdf/2508.04610v2",
    "categories": [
      "cs.LG",
      "cs.AI",
      "cs.ET",
      "cs.NE"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "Intrusion Detection in Heterogeneous Networks with Domain-Adaptive Multi-Modal Learning",
    "authors": [
      "Mabin Umman Varghese",
      "Zahra Taghiyarrenani"
    ],
    "published": "2025-08-05 14:46:03+00:00",
    "arxiv_id": "2508.03517v1",
    "summary": "Network Intrusion Detection Systems (NIDS) play a crucial role in safeguarding network infrastructure against cyberattacks. As the prevalence and sophistication of these attacks increase, machine learning and deep neural network approaches have emerged as effective tools for enhancing NIDS capabilit",
    "pdf_url": "https://arxiv.org/pdf/2508.03517v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "A Provably Secure Network Protocol for Private Communication with Analysis and Tracing Resistance",
    "authors": [
      "Chao Ge",
      "Wei Yuan",
      "Ge Chen",
      "Yanbin Pan",
      "Yuan Shen"
    ],
    "published": "2025-08-03 10:50:04+00:00",
    "arxiv_id": "2508.01714v1",
    "summary": "Anonymous communication networks have emerged as crucial tools for obfuscating communication pathways and concealing user identities. However, their practical deployments face significant challenges, including susceptibility to artificial intelligence (AI)-powered metadata analysis, difficulties in ",
    "pdf_url": "https://arxiv.org/pdf/2508.01714v1",
    "categories": [
      "cs.CR",
      "eess.SY"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Innovative tokenisation of structured data for LLM training",
    "authors": [
      "Kayvan Karim",
      "Hani Ragab Hassen. Hadj Batatia"
    ],
    "published": "2025-08-03 09:29:50+00:00",
    "arxiv_id": "2508.01685v1",
    "summary": "Data representation remains a fundamental challenge in machine learning, particularly when adapting sequence-based architectures like Transformers and Large Language Models (LLMs) for structured tabular data. Existing methods often fail to cohesively encode the mix of numerical and categorical featu",
    "pdf_url": "https://arxiv.org/pdf/2508.01685v1",
    "categories": [
      "cs.LG",
      "cs.CR"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "Overlapping IPv4, IPv6, and TCP data: exploring errors, test case context and multiple overlaps inside network stacks and NIDSes with PYROLYSE",
    "authors": [
      "Lucas Aubard",
      "Johan Mazel",
      "Gilles Guette",
      "Pierre Chifflier"
    ],
    "published": "2025-08-01 16:05:48+00:00",
    "arxiv_id": "2508.00735v2",
    "summary": "IP fragmentation and TCP segmentation allow for splitting large data packets into smaller ones, e.g., for transmission across network links of limited capacity. These mechanisms permit complete or partial overlaps with different data on the overlapping portions. IPv4, IPv6, and TCP reassembly polici",
    "pdf_url": "https://arxiv.org/pdf/2508.00735v2",
    "categories": [
      "cs.NI"
    ],
    "primary_category": "cs.NI"
  },
  {
    "title": "DoS Attacks and Defense Technologies in Blockchain Systems: A Hierarchical Analysis",
    "authors": [
      "Chunyi Zhang",
      "Fengjiao Dou",
      "Xiaoqi Li"
    ],
    "published": "2025-07-30 12:29:34+00:00",
    "arxiv_id": "2507.22611v1",
    "summary": "Blockchain technology is widely used in various fields due to its ability to provide decentralization and trustless security. This is a fundamental understanding held by many advocates, but it is misunderstood, leading participants to fail to recognize the limitations of the security that blockchain",
    "pdf_url": "https://arxiv.org/pdf/2507.22611v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Programmable Data Planes for Network Security",
    "authors": [
      "Gursimran Singh",
      "H. B. Acharya",
      "Minseok Kwon"
    ],
    "published": "2025-07-29 18:55:58+00:00",
    "arxiv_id": "2507.22165v1",
    "summary": "The emergence of programmable data planes, and particularly switches supporting the P4 language, has transformed network security by enabling customized, line-rate packet processing. These switches, originally intended for flexible forwarding, now play a broader role: detecting and mitigating attack",
    "pdf_url": "https://arxiv.org/pdf/2507.22165v1",
    "categories": [
      "cs.CR",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Interpretable Anomaly-Based DDoS Detection in AI-RAN with XAI and LLMs",
    "authors": [
      "Sotiris Chatzimiltis",
      "Mohammad Shojafar",
      "Mahdi Boloursaz Mashhadi",
      "Rahim Tafazolli"
    ],
    "published": "2025-07-27 22:16:09+00:00",
    "arxiv_id": "2507.21193v1",
    "summary": "Next generation Radio Access Networks (RANs) introduce programmability, intelligence, and near real-time control through intelligent controllers, enabling enhanced security within the RAN and across broader 5G/6G infrastructures. This paper presents a comprehensive survey highlighting opportunities,",
    "pdf_url": "https://arxiv.org/pdf/2507.21193v1",
    "categories": [
      "cs.CR",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Packet-Level DDoS Data Augmentation Using Dual-Stream Temporal-Field Diffusion",
    "authors": [
      "Gongli Xi",
      "Ye Tian",
      "Yannan Hu",
      "Yuchao Zhang",
      "Yapeng Niu",
      "Xiangyang Gong"
    ],
    "published": "2025-07-27 03:40:56+00:00",
    "arxiv_id": "2507.20115v1",
    "summary": "In response to Distributed Denial of Service (DDoS) attacks, recent research efforts increasingly rely on Machine Learning (ML)-based solutions, whose effectiveness largely depends on the quality of labeled training datasets. To address the scarcity of such datasets, data augmentation with synthetic",
    "pdf_url": "https://arxiv.org/pdf/2507.20115v1",
    "categories": [
      "cs.NI",
      "cs.AI"
    ],
    "primary_category": "cs.NI"
  },
  {
    "title": "KD-GAT: Combining Knowledge Distillation and Graph Attention Transformer for a Controller Area Network Intrusion Detection System",
    "authors": [
      "Robert Frenken",
      "Sidra Ghayour Bhatti",
      "Hanqin Zhang",
      "Qadeer Ahmed"
    ],
    "published": "2025-07-25 21:45:58+00:00",
    "arxiv_id": "2507.19686v1",
    "summary": "The Controller Area Network (CAN) protocol is widely adopted for in-vehicle communication but lacks inherent security mechanisms, making it vulnerable to cyberattacks. This paper introduces KD-GAT, an intrusion detection framework that combines Graph Attention Networks (GATs) with knowledge distilla",
    "pdf_url": "https://arxiv.org/pdf/2507.19686v1",
    "categories": [
      "cs.LG",
      "cs.AI"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "Performance Evaluation and Threat Mitigation in Large-scale 5G Core Deployment",
    "authors": [
      "Rodrigo Moreira",
      "Larissa F. Rodrigues Moreira",
      "Flávio de Oliveira Silva"
    ],
    "published": "2025-07-23 18:17:26+00:00",
    "arxiv_id": "2507.17850v1",
    "summary": "The deployment of large-scale software-based 5G core functions presents significant challenges due to their reliance on optimized and intelligent resource provisioning for their services. Many studies have focused on analyzing the impact of resource allocation for complex deployments using mathemati",
    "pdf_url": "https://arxiv.org/pdf/2507.17850v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Tabular Diffusion based Actionable Counterfactual Explanations for Network Intrusion Detection",
    "authors": [
      "Vinura Galwaduge",
      "Jagath Samarabandu"
    ],
    "published": "2025-07-23 02:53:58+00:00",
    "arxiv_id": "2507.17161v1",
    "summary": "Modern network intrusion detection systems (NIDS) frequently utilize the predictive power of complex deep learning models. However, the \"black-box\" nature of such deep learning methods adds a layer of opaqueness that hinders the proper understanding of detection decisions, trust in the decisions and",
    "pdf_url": "https://arxiv.org/pdf/2507.17161v1",
    "categories": [
      "cs.LG",
      "cs.AI"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "eX-NIDS: A Framework for Explainable Network Intrusion Detection Leveraging Large Language Models",
    "authors": [
      "Paul R. B. Houssel",
      "Siamak Layeghy",
      "Priyanka Singh",
      "Marius Portmann"
    ],
    "published": "2025-07-22 05:26:21+00:00",
    "arxiv_id": "2507.16241v1",
    "summary": "This paper introduces eX-NIDS, a framework designed to enhance interpretability in flow-based Network Intrusion Detection Systems (NIDS) by leveraging Large Language Models (LLMs). In our proposed framework, flows labelled as malicious by NIDS are initially processed through a module called the Prom",
    "pdf_url": "https://arxiv.org/pdf/2507.16241v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "FENIX: Enabling In-Network DNN Inference with FPGA-Enhanced Programmable Switches",
    "authors": [
      "Xiangyu Gao",
      "Tong Li",
      "Yinchao Zhang",
      "Ziqiang Wang",
      "Xiangsheng Zeng",
      "Su Yao",
      "Ke Xu"
    ],
    "published": "2025-07-20 10:13:13+00:00",
    "arxiv_id": "2507.14891v3",
    "summary": "Machine learning (ML) is increasingly used in network data planes for advanced traffic analysis, but existing solutions (such as FlowLens, N3IC, BoS) still struggle to simultaneously achieve low latency, high throughput, and high accuracy. To address these challenges, we present FENIX, a hybrid in-n",
    "pdf_url": "https://arxiv.org/pdf/2507.14891v3",
    "categories": [
      "cs.NI"
    ],
    "primary_category": "cs.NI"
  },
  {
    "title": "How To Mitigate And Defend Against DDoS Attacks In IoT Devices",
    "authors": [
      "Ifiyemi Leigha",
      "Basak Comlekcioglu",
      "Maria Pilar Bezanilla"
    ],
    "published": "2025-07-15 22:21:19+00:00",
    "arxiv_id": "2507.11772v1",
    "summary": "Distributed Denial of Service (DDoS) attacks have become increasingly prevalent and dangerous in the context of Internet of Things (IoT) networks, primarily due to the low-security configurations of many connected devices. This paper analyzes the nature and impact of DDoS attacks such as those launc",
    "pdf_url": "https://arxiv.org/pdf/2507.11772v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Class-Proportional Coreset Selection for Difficulty-Separable Data",
    "authors": [
      "Elisa Tsai",
      "Haizhong Zheng",
      "Atul Prakash"
    ],
    "published": "2025-07-15 01:43:32+00:00",
    "arxiv_id": "2507.10904v2",
    "summary": "High-quality training data is essential for building reliable and efficient machine learning systems. One-shot coreset selection addresses this by pruning the dataset while maintaining or even improving model performance, often relying on training-dynamics-based data difficulty scores. However, most",
    "pdf_url": "https://arxiv.org/pdf/2507.10904v2",
    "categories": [
      "cs.LG",
      "cs.AI"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "REAL-IoT: Characterizing GNN Intrusion Detection Robustness under Practical Adversarial Attack",
    "authors": [
      "Zhonghao Zhan",
      "Huichi Zhou",
      "Hamed Haddadi"
    ],
    "published": "2025-07-14 22:10:08+00:00",
    "arxiv_id": "2507.10836v1",
    "summary": "Graph Neural Network (GNN)-based network intrusion detection systems (NIDS) are often evaluated on single datasets, limiting their ability to generalize under distribution drift. Furthermore, their adversarial robustness is typically assessed using synthetic perturbations that lack realism. This mea",
    "pdf_url": "https://arxiv.org/pdf/2507.10836v1",
    "categories": [
      "cs.CR"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Leveraging RAG-LLMs for Urban Mobility Simulation and Analysis",
    "authors": [
      "Yue Ding",
      "Conor McCarthy",
      "Kevin O'Shea",
      "Mingming Liu"
    ],
    "published": "2025-07-14 15:23:11+00:00",
    "arxiv_id": "2507.10382v2",
    "summary": "With the rise of smart mobility and shared e-mobility services, numerous advanced technologies have been applied to this field. Cloud-based traffic simulation solutions have flourished, offering increasingly realistic representations of the evolving mobility landscape. LLMs have emerged as pioneerin",
    "pdf_url": "https://arxiv.org/pdf/2507.10382v2",
    "categories": [
      "cs.LG"
    ],
    "primary_category": "cs.LG"
  },
  {
    "title": "Spectral Feature Extraction for Robust Network Intrusion Detection Using MFCCs",
    "authors": [
      "HyeYoung Lee",
      "Muhammad Nadeem",
      "Pavel Tsoi"
    ],
    "published": "2025-07-14 01:25:26+00:00",
    "arxiv_id": "2507.10622v1",
    "summary": "The rapid expansion of Internet of Things (IoT) networks has led to a surge in security vulnerabilities, emphasizing the critical need for robust anomaly detection and classification techniques. In this work, we propose a novel approach for identifying anomalies in IoT network traffic by leveraging ",
    "pdf_url": "https://arxiv.org/pdf/2507.10622v1",
    "categories": [
      "cs.CR",
      "cond-mat.dis-nn",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Demo: Secure Edge Server for Network Slicing and Resource Allocation in Open RAN",
    "authors": [
      "Adhwaa Alchaab",
      "Ayman Younis",
      "Dario Pompili"
    ],
    "published": "2025-07-13 03:55:04+00:00",
    "arxiv_id": "2507.11499v1",
    "summary": "Next-Generation Radio Access Networks (NGRAN) aim to support diverse vertical applications with strict security, latency, and Service-Level Agreement (SLA) requirements. These demands introduce challenges in securing the infrastructure, allocating resources dynamically, and enabling real-time reconf",
    "pdf_url": "https://arxiv.org/pdf/2507.11499v1",
    "categories": [
      "cs.CR",
      "eess.SY"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "eBPF-Based Real-Time DDoS Mitigation for IoT Edge Devices",
    "authors": [
      "Abdurrahman Tolay"
    ],
    "published": "2025-07-13 03:35:58+00:00",
    "arxiv_id": "2508.00851v1",
    "summary": "The rapid expansion of the Internet of Things (IoT) has intensified security challenges, notably from Distributed Denial of Service (DDoS) attacks launched by compromised, resource-constrained devices. Traditional defenses are often ill-suited for the IoT paradigm, creating a need for lightweight, h",
    "pdf_url": "https://arxiv.org/pdf/2508.00851v1",
    "categories": [
      "cs.CR",
      "cs.NI"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "Autonomous AI-based Cybersecurity Framework for Critical Infrastructure: Real-Time Threat Mitigation",
    "authors": [
      "Jenifer Paulraj",
      "Brindha Raghuraman",
      "Nagarani Gopalakrishnan",
      "Yazan Otoum"
    ],
    "published": "2025-07-10 04:17:29+00:00",
    "arxiv_id": "2507.07416v1",
    "summary": "Critical infrastructure systems, including energy grids, healthcare facilities, transportation networks, and water distribution systems, are pivotal to societal stability and economic resilience. However, the increasing interconnectivity of these systems exposes them to various cyber threats, includ",
    "pdf_url": "https://arxiv.org/pdf/2507.07416v1",
    "categories": [
      "cs.CR",
      "cs.AI",
      "cs.ET",
      "cs.LG"
    ],
    "primary_category": "cs.CR"
  },
  {
    "title": "When Context Is Not Enough: Modeling Unexplained Variability in Car-Following Behavior",
    "authors": [
      "Chengyuan Zhang",
      "Zhengbing He",
      "Cathy Wu",
      "Lijun Sun"
    ],
    "published": "2025-07-09 16:42:41+00:00",
    "arxiv_id": "2507.07012v1",
    "summary": "Modeling car-following behavior is fundamental to microscopic traffic simulation, yet traditional deterministic models often fail to capture the full extent of variability and unpredictability in human driving. While many modern approaches incorporate context-aware inputs (e.g., spacing, speed, rela",
    "pdf_url": "https://arxiv.org/pdf/2507.07012v1",
    "categories": [
      "stat.AP",
      "cs.LG",
      "cs.RO"
    ],
    "primary_category": "stat.AP"
  },
  {
    "title": "Bridging AI and Software Security: A Comparative Vulnerability Assessment of LLM Agent Deployment Paradigms",
    "authors": [
      "Tarek Gasmi",
      "Ramzi Guesmi",
      "Ines Belhadj",
      "Jihene Bennaceur"
    ],
    "published": "2025-07-08 18:24:28+00:00",
    "arxiv_id": "2507.06323v1",
    "summary": "Large Language Model (LLM) agents face security vulnerabilities spanning AI-specific and traditional software domains, yet current research addresses these separately. This study bridges this gap through comparative evaluation of Function Calling architecture and Model Context Protocol (MCP) deploym",
    "pdf_url": "https://arxiv.org/pdf/2507.06323v1",
    "categories": [
      "cs.CR",
      "cs.AI"
    ],
    "primary_category": "cs.CR"
  }
]