[
  {
    "id": "http://arxiv.org/abs/2512.20317v1",
    "arxiv_id": "2512.20317v1",
    "title": "Towards Energy Independence: Critical Minerals in the Indian Context",
    "summary": "The global impetus for extracting rare earth elements (REEs) is shaping the future of green technologies. From high-efficiency magnets in wind turbines to advanced batteries and solar photovoltaics, REEs are indispensable for a greener world through the energy transition. However, supply chains remain a barrier for the majority of the global population. India is mainly dependent on imports for most REEs. Innovation and recycling efforts in most REEs are still in their early stages. For India, aspiring to Viksit Bharat by 2047, securing sustainable REE access is critical to national energy security and technological independence. This paper explores India's opportunities and challenges in the REE domain, high-lighting underutilized resources such as copper tailings, fly ash, and e-waste. We argue for circular economy pathways that can reduce environmental impacts and strengthen domestic supply. Hindustan Copper Limited (HCL), as India's sole vertically integrated copper producer, is uniquely positioned to pioneer co-recovery of REEs, advance research and development partnerships, and build a comprehensive supply chain. By embedding sustainability, ESG principles, and community trust in its strategy, HCL can evolve into a national champion in this domain.",
    "published": "2025-12-23T12:34:36Z",
    "updated": "2025-12-23T12:34:36Z",
    "authors": [
      "Ashish Ranjan Kumar",
      "Sekhar Bhattacharyya"
    ],
    "affiliations": [],
    "first_author": "Ashish Ranjan Kumar",
    "pdf_url": "https://arxiv.org/pdf/2512.20317v1",
    "primary_category": "stat.AP",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20614v1",
    "arxiv_id": "2512.20614v1",
    "title": "Tunably realizing flat-bands and exceptional points in kinetically frustrated systems: An example on the non-Hermitian Creutz ladder",
    "summary": "We study a non-Hermitian extension of the Creutz ladder with generic non-reciprocal hopping. By mapping the ladder onto two decoupled non-Hermitian Su--Schrieffer--Heeger (SSH) chains, we uncover a rich structure in parameter space under different boundary conditions. Under periodic boundary conditions, the spectrum admits a fine-tuned line in parameter space with entirely real eigenvalues, while deviations from this line induce a real--complex spectral transition without crossing exceptional points. In contrast, an exact analytical diagonalization under open boundary conditions reveals extended regions in parameter space with purely real or purely imaginary spectra, separated from complex spectral domains by exceptional lines. The intersections of these exceptional lines define triple-junction points where distinct spectral regimes meet, giving rise to a structured phase diagram that is absent under periodic boundary conditions. We further show that flat bands in this system can occur both as Hermitian diabolical points and as non-Hermitian exceptional points, known as exceptional flat bands, where the dynamics is more stringent than in the Hermitian case, leading to distinct spectral and dynamical signatures.",
    "published": "2025-12-23T18:58:36Z",
    "updated": "2025-12-23T18:58:36Z",
    "authors": [
      "Debashish Dutta",
      "Sayan Choudhury"
    ],
    "affiliations": [],
    "first_author": "Debashish Dutta",
    "pdf_url": "https://arxiv.org/pdf/2512.20614v1",
    "primary_category": "quant-ph",
    "relevance_score": 10.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20586v1",
    "arxiv_id": "2512.20586v1",
    "title": "Automated stereotactic radiosurgery planning using a human-in-the-loop reasoning large language model agent",
    "summary": "Stereotactic radiosurgery (SRS) demands precise dose shaping around critical structures, yet black-box AI systems have limited clinical adoption due to opacity concerns. We tested whether chain-of-thought reasoning improves agentic planning in a retrospective cohort of 41 patients with brain metastases treated with 18 Gy single-fraction SRS. We developed SAGE (Secure Agent for Generative Dose Expertise), an LLM-based planning agent for automated SRS treatment planning. Two variants generated plans for each case: one using a non-reasoning model, one using a reasoning model. The reasoning variant showed comparable plan dosimetry relative to human planners on primary endpoints (PTV coverage, maximum dose, conformity index, gradient index; all p > 0.21) while reducing cochlear dose below human baselines (p = 0.022). When prompted to improve conformity, the reasoning model demonstrated systematic planning behaviors including prospective constraint verification (457 instances) and trade-off deliberation (609 instances), while the standard model exhibited none of these deliberative processes (0 and 7 instances, respectively). Content analysis revealed that constraint verification and causal explanation concentrated in the reasoning agent. The optimization traces serve as auditable logs, offering a path toward transparent automated planning.",
    "published": "2025-12-23T18:32:17Z",
    "updated": "2025-12-23T18:32:17Z",
    "authors": [
      "Humza Nusrat",
      "Luke Francisco",
      "Bing Luo",
      "Hassan Bagher-Ebadian",
      "Joshua Kim",
      "Karen Chin-Snyder",
      "Salim Siddiqui",
      "Mira Shah",
      "Eric Mellon",
      "Mohammad Ghassemi",
      "Anthony Doemer",
      "Benjamin Movsas",
      "Kundan Thind"
    ],
    "affiliations": [],
    "first_author": "Humza Nusrat",
    "pdf_url": "https://arxiv.org/pdf/2512.20586v1",
    "primary_category": "cs.AI",
    "relevance_score": 10.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20480v1",
    "arxiv_id": "2512.20480v1",
    "title": "Optoelectronically Directed Self-Assembly of Active and Passive Particles into Programmable and Reconfigurable Colloidal Structures",
    "summary": "Controlled assembly of active-passive colloidal mixtures offers a route to reconfigurable microscale machines, but their self-assembly pathways remain poorly understood. We study the directed assembly of metallo-dielectric Janus particles (JPs) and passive polystyrene (PS) beads using optoelectrically reconfigurable AC-field patterning, which allows precise control over particle composition and binding sequence. Through experiments, analytical modeling, and simulations, we show that dipolar interactions drive robust JP-JP and JP-PS dimer formation with frequency-dependent stability. At intermediate and high frequencies, JP-PS binding is strongly attractive, whereas at low frequencies it becomes effectively repulsive due to electrical double-layer screening and electrohydrodynamic flows at the metallic hemisphere. In multi-particle systems, PS beads act as cooperative hubs that hierarchically recruit JPs, yielding higher-order hybrid structures. We identify structural isomers - for example, 3JP + 1PS clusters can form chain-like or triangular configurations depending on assembly sequence. Simulations confirm both as equilibrium states, with the triangular isomer slightly more stable. Similar polymorphism appears in larger clusters (4JPs). Overall, we establish a framework for controlled active-passive colloidal assembly, showing how frequency-tunable interactions and structural polymorphism enable the design of reconfigurable colloidal machines for applications in microrobotics, targeted delivery, and adaptive materials.",
    "published": "2025-12-23T16:15:26Z",
    "updated": "2025-12-23T16:15:26Z",
    "authors": [
      "Donggang Cao",
      "Sankha Shuvra Das",
      "Gilad Yossifon"
    ],
    "affiliations": [],
    "first_author": "Donggang Cao",
    "pdf_url": "https://arxiv.org/pdf/2512.20480v1",
    "primary_category": "cond-mat.soft",
    "relevance_score": 10.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20444v1",
    "arxiv_id": "2512.20444v1",
    "title": "Geometry and Arithmetic of Special Loci in the Moduli Spaces of Type II String Theory",
    "summary": "We use Dwork's deformation method to calculate the Hasse-Weil Zeta function of multi-parameter families of Calabi-Yau three and fourfolds. This information is used to identify subslices of codimension one in the complex-structure moduli space, where the Hodge structure splits in particular ways and different type IIB flux vacua emerge. We calculate the corresponding background fluxes and their potential that drives the IIB string compactification to these subslices and analyse the properties of the corresponding physical vacua. We address the question whether the subslices correspond to fixed loci of symmetries acting on the original family and whether they can be identified with consistent complex-structure moduli spaces of Picard-Fuchs systems with standard integral monodromy bases for fewer complex deformation parameters. We distinguish between supersymmetric vacua and singular subslices. In the latter case a standard geometrical basis can be expected if a physical transition leads to a smooth type II vacuum. In many cases the differential equations on the subslice are fulfilled by the restricted periods after adding an inhomogeneous term. This suggests that the resolution of the singularity provides three-chains and we indeed find that the corresponding integrals allow an integral expansion compatible with their interpretation as generating functions of disk instantons.",
    "published": "2025-12-23T15:35:02Z",
    "updated": "2025-12-23T15:35:02Z",
    "authors": [
      "Paul Blesse",
      "Janis Dücker",
      "Albrecht Klemm",
      "Julian F. Piribauer"
    ],
    "affiliations": [],
    "first_author": "Paul Blesse",
    "pdf_url": "https://arxiv.org/pdf/2512.20444v1",
    "primary_category": "hep-th",
    "relevance_score": 10.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20423v1",
    "arxiv_id": "2512.20423v1",
    "title": "Evasion-Resilient Detection of DNS-over-HTTPS Data Exfiltration: A Practical Evaluation and Toolkit",
    "summary": "The purpose of this project is to assess how well defenders can detect DNS-over-HTTPS (DoH) file exfiltration, and which evasion strategies can be used by attackers. While providing a reproducible toolkit to generate, intercept and analyze DoH exfiltration, and comparing Machine Learning vs threshold-based detection under adversarial scenarios. The originality of this project is the introduction of an end-to-end, containerized pipeline that generates configurable file exfiltration over DoH using several parameters (e.g., chunking, encoding, padding, resolver rotation). It allows for file reconstruction at the resolver side, while extracting flow-level features using a fork of DoHLyzer. The pipeline contains a prediction side, which allows the training of machine learning models based on public labelled datasets and then evaluates them side-by-side with threshold-based detection methods against malicious and evasive DNS-Over-HTTPS traffic. We train Random Forest, Gradient Boosting and Logistic Regression classifiers on a public DoH dataset and benchmark them against evasive DoH exfiltration scenarios. The toolkit orchestrates traffic generation, file capture, feature extraction, model training and analysis. The toolkit is then encapsulated into several Docker containers for easy setup and full reproducibility regardless of the platform it is run on. Future research regarding this project is directed at validating the results on mixed enterprise traffic, extending the protocol coverage to HTTP/3/QUIC request, adding a benign traffic generation, and working on real-time traffic evaluation. A key objective is to quantify when stealth constraints make DoH exfiltration uneconomical and unworthy for the attacker.",
    "published": "2025-12-23T15:07:17Z",
    "updated": "2025-12-23T15:07:17Z",
    "authors": [
      "Adam Elaoumari"
    ],
    "affiliations": [],
    "first_author": "Adam Elaoumari",
    "pdf_url": "https://arxiv.org/pdf/2512.20423v1",
    "primary_category": "cs.CR",
    "relevance_score": 10.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20417v1",
    "arxiv_id": "2512.20417v1",
    "title": "Chain-of-Anomaly Thoughts with Large Vision-Language Models",
    "summary": "Automated video surveillance with Large Vision-Language Models is limited by their inherent bias towards normality, often failing to detect crimes. While Chain-of-Thought reasoning strategies show significant potential for improving performance in language tasks, the lack of inductive anomaly biases in their reasoning further steers the models towards normal interpretations. To address this, we propose Chain-of-Anomaly-Thoughts (CoAT), a multi-agent reasoning framework that introduces inductive criminal bias in the reasoning process through a final, anomaly-focused classification layer. Our method significantly improves Anomaly Detection, boosting F1-score by 11.8 p.p. on challenging low-resolution footage and Anomaly Classification by 3.78 p.p. in high-resolution videos.",
    "published": "2025-12-23T15:01:05Z",
    "updated": "2025-12-23T15:01:05Z",
    "authors": [
      "Pedro Domingos",
      "João Pereira",
      "Vasco Lopes",
      "João Neves",
      "David Semedo"
    ],
    "affiliations": [],
    "first_author": "Pedro Domingos",
    "pdf_url": "https://arxiv.org/pdf/2512.20417v1",
    "primary_category": "cs.CV",
    "relevance_score": 10.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20405v1",
    "arxiv_id": "2512.20405v1",
    "title": "ChatGPT: Excellent Paper! Accept It. Editor: Imposter Found! Review Rejected",
    "summary": "Large Language Models (LLMs) like ChatGPT are now widely used in writing and reviewing scientific papers. While this trend accelerates publication growth and reduces human workload, it also introduces serious risks. Papers written or reviewed by LLMs may lack real novelty, contain fabricated or biased results, or mislead downstream research that others depend on. Such issues can damage reputations, waste resources, and even endanger lives when flawed studies influence medical or safety-critical systems. This research explores both the offensive and defensive sides of this growing threat. On the attack side, we demonstrate how an author can inject hidden prompts inside a PDF that secretly guide or \"jailbreak\" LLM reviewers into giving overly positive feedback and biased acceptance. On the defense side, we propose an \"inject-and-detect\" strategy for editors, where invisible trigger prompts are embedded into papers; if a review repeats or reacts to these triggers, it reveals that the review was generated by an LLM, not a human. This method turns prompt injections from vulnerability into a verification tool. We outline our design, expected model behaviors, and ethical safeguards for deployment. The goal is to expose how fragile today's peer-review process becomes under LLM influence and how editorial awareness can help restore trust in scientific evaluation.",
    "published": "2025-12-23T14:54:45Z",
    "updated": "2025-12-23T14:54:45Z",
    "authors": [
      "Kanchon Gharami",
      "Sanjiv Kumar Sarkar",
      "Yongxin Liu",
      "Shafika Showkat Moni"
    ],
    "affiliations": [],
    "first_author": "Kanchon Gharami",
    "pdf_url": "https://arxiv.org/pdf/2512.20405v1",
    "primary_category": "cs.CR",
    "relevance_score": 10.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20402v1",
    "arxiv_id": "2512.20402v1",
    "title": "iblock: Accurate and Scalable Bitcoin Simulations with OMNeT++",
    "summary": "This paper proposes iblock, a comprehensive C++ library for Bitcoin simulation, designed for OMNeT++. iblock offers superior efficiency and scalability with respect to state-of-the-art simulators, which are typically written in high-level languages. Moreover, the possible integration with other OMNeT++ libraries allows highly detailed simulations. We measure iblock's performance against a state-of-the-art blockchain simulator, proving that it is more efficient at the same level of simulation detail. We also validate iblock by using it to simulate different scenarios such as the normal Bitcoin operation and the selfish mine attack, showing that simulation results are coherent with theoretical expectations.",
    "published": "2025-12-23T14:43:03Z",
    "updated": "2025-12-23T14:43:03Z",
    "authors": [
      "Niccolò Scatena",
      "Pericle Perazzo",
      "Giovanni Nardini"
    ],
    "affiliations": [],
    "first_author": "Niccolò Scatena",
    "pdf_url": "https://arxiv.org/pdf/2512.20402v1",
    "primary_category": "cs.CR",
    "relevance_score": 10.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20391v1",
    "arxiv_id": "2512.20391v1",
    "title": "Contingency Model-based Control (CMC) for Communicationless Cooperative Collision Avoidance in Robot Swarms",
    "summary": "Cooperative collision avoidance between robots in swarm operations remains an open challenge. Assuming a decentralized architecture, each robot is responsible for making its own control decisions, including motion planning. To this end, most existing approaches mostly rely some form of (wireless) communication between the agents of the swarm. In reality, however, communication is brittle. It may be affected by latency, further delays and packet losses, transmission faults, and is subject to adversarial attacks, such as jamming or spoofing. This paper proposes Contingency Model-based Control (CMC) as a communicationless alternative. It follows the implicit cooperation paradigm, under which the design of the robots is based on consensual (offline) rules, similar to traffic rules. They include the definition of a contingency trajectory for each robot, and a method for construction of mutual collision avoidance constraints. The setup is shown to guarantee the recursive feasibility and collision avoidance between all swarm members in closed-loop operation. Moreover, CMC naturally satisfies the Plug \\& Play paradigm, i.e., for new robots entering the swarm. Two numerical examples demonstrate that the collision avoidance guarantee is intact and that the robot swarm operates smoothly under the CMC regime.",
    "published": "2025-12-23T14:28:42Z",
    "updated": "2025-12-23T14:28:42Z",
    "authors": [
      "Georg Schildbach"
    ],
    "affiliations": [],
    "first_author": "Georg Schildbach",
    "pdf_url": "https://arxiv.org/pdf/2512.20391v1",
    "primary_category": "math.OC",
    "relevance_score": 10.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20360v1",
    "arxiv_id": "2512.20360v1",
    "title": "Hyperbolicity and fundamental groups of complex quasi-projective varieties (III): applications",
    "summary": "This paper is Part III of a series of three. We begin by introducing the notion of $h$-special varieties, which can be seen as varieties \"chain-connected by the Zariski closures of entire curves.\" We prove that if $X$ is either a special complex quasi-projective variety in the sense of Campana or an $h$-special variety, then for any linear representation $\\varrho:π_1(X)\\to \\mathrm{GL}_N(\\mathbb{C})$, the image $\\varrho(π_1(X))$ is virtually nilpotent. We also provide examples showing that this result is sharp, leading to a revised form of Campana's abelianity conjecture for smooth quasi-projective varieties. In addition, we prove a structure theorem for quasi-projective varieties with big and semisimple representations of the fundamental groups, thereby addressing a conjecture by Kollár in 1995. We also construct several examples of quasi-projective varieties that are special and $h$-special, highlighting certain atypical properties of the non-compact case in contrast with the projective setting.",
    "published": "2025-12-23T13:41:17Z",
    "updated": "2025-12-23T13:41:17Z",
    "authors": [
      "Benoit Cadorel",
      "Ya Deng",
      "Katsutoshi Yamanoi"
    ],
    "affiliations": [],
    "first_author": "Benoit Cadorel",
    "pdf_url": "https://arxiv.org/pdf/2512.20360v1",
    "primary_category": "math.AG",
    "relevance_score": 10.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20338v1",
    "arxiv_id": "2512.20338v1",
    "title": "Up-down chains and scaling limits: application to permuton- and graphon-valued diffusions",
    "summary": "An up-down chain is a Markov chain in which each transition is a two-step process that moves up to a larger object and then back down to an object of the original size. The first goal of this paper is to present a general framework for analyzing these chains and computing their scaling limits. This approach unifies much of the existing literature while extending it in several directions. These include explicit conditions for constructing integrable up-down chains and convergence results for families of intertwined processes. The latter contribute to the method of intertwiners of Borodin and Olshanski.   The second goal is to highlight a notable application of this framework to the settings of permutations and graphs. Here, we identify some integrable up-down chains and construct their scaling limits, a family of permuton- and graphon-valued Feller diffusions. Both the up-down chains and the limiting diffusions exhibit ergodicity, diagonalizable semigroups, and explicit expressions for the maximal separation distance to stationarity. For the diffusions, the stationary measures are the recursive separable permutons and recursive cographons recently introduced by the authors, and the separation distances turn out to be related to the Dedekind eta function.",
    "published": "2025-12-23T13:10:33Z",
    "updated": "2025-12-23T13:10:33Z",
    "authors": [
      "Valentin Féray",
      "Kelvin Rivera-Lopez"
    ],
    "affiliations": [],
    "first_author": "Valentin Féray",
    "pdf_url": "https://arxiv.org/pdf/2512.20338v1",
    "primary_category": "math.PR",
    "relevance_score": 10.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20324v1",
    "arxiv_id": "2512.20324v1",
    "title": "Can LLMs Solve My Grandma's Riddle? Evaluating Multilingual Large Language Models on Reasoning Traditional Bangla Tricky Riddles",
    "summary": "Large Language Models (LLMs) show impressive performance on many NLP benchmarks, yet their ability to reason in figurative, culturally grounded, and low-resource settings remains underexplored. We address this gap for Bangla by introducing BanglaRiddleEval, a benchmark of 1,244 traditional Bangla riddles instantiated across four tasks (4,976 riddle-task artifacts in total). Using an LLM-based pipeline, we generate Chain-of-Thought explanations, semantically coherent distractors, and fine-grained ambiguity annotations, and evaluate a diverse suite of open-source and closed-source models under different prompting strategies. Models achieve moderate semantic overlap on generative QA but low correctness, MCQ accuracy peaks at only about 56% versus an 83% human baseline, and ambiguity resolution ranges from roughly 26% to 68%, with high-quality explanations confined to the strongest models. These results show that current LLMs capture some cues needed for Bangla riddle reasoning but remain far from human-level performance, establishing BanglaRiddleEval as a challenging new benchmark for low-resource figurative reasoning. All data, code, and evaluation scripts are available on GitHub: https://github.com/Labib1610/BanglaRiddleEval.",
    "published": "2025-12-23T12:48:05Z",
    "updated": "2025-12-23T12:48:05Z",
    "authors": [
      "Nurul Labib Sayeedi",
      "Md. Faiyaz Abdullah Sayeedi",
      "Khushnur Binte Jahangir",
      "Swakkhar Shatabda",
      "Sarah Masud Preum"
    ],
    "affiliations": [],
    "first_author": "Nurul Labib Sayeedi",
    "pdf_url": "https://arxiv.org/pdf/2512.20324v1",
    "primary_category": "cs.CL",
    "relevance_score": 10.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20323v1",
    "arxiv_id": "2512.20323v1",
    "title": "Differentially Private Feature Release for Wireless Sensing: Adaptive Privacy Budget Allocation on CSI Spectrograms",
    "summary": "Wi-Fi/RF-based human sensing has achieved remarkable progress with deep learning, yet practical deployments increasingly require feature sharing for cloud analytics, collaborative training, or benchmark evaluation. Releasing intermediate representations such as CSI spectrograms can inadvertently expose sensitive information, including user identity, location, and membership, motivating formal privacy guarantees. In this paper, we study differentially private (DP) feature release for wireless sensing and propose an adaptive privacy budget allocation mechanism tailored to the highly non-uniform structure of CSI time-frequency representations. Our pipeline converts CSI to bounded spectrogram features, applies sensitivity control via clipping, estimates task-relevant importance over the time-frequency plane, and allocates a global privacy budget across spectrogram blocks before injecting calibrated Gaussian noise. Experiments on multi-user activity sensing (WiMANS), multi-person 3D pose estimation (Person-in-WiFi 3D), and respiration monitoring (Resp-CSI) show that adaptive allocation consistently improves the privacy-utility frontier over uniform perturbation under the same privacy budget. Our method yields higher accuracy and lower error while substantially reducing empirical leakage in identity and membership inference attacks.",
    "published": "2025-12-23T12:45:49Z",
    "updated": "2025-12-23T12:45:49Z",
    "authors": [
      "Ipek Sena Yilmaz",
      "Onur G. Tuncer",
      "Zeynep E. Aksoy",
      "Zeynep Yağmur Baydemir"
    ],
    "affiliations": [],
    "first_author": "Ipek Sena Yilmaz",
    "pdf_url": "https://arxiv.org/pdf/2512.20323v1",
    "primary_category": "cs.CR",
    "relevance_score": 10.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20303v1",
    "arxiv_id": "2512.20303v1",
    "title": "From the Two-Capacitor Paradox to Electromagnetic Side-Channel Mitigation in Digital Circuits",
    "summary": "The classical two-capacitor paradox of the lost energy is revisited from an electronic circuit security stand-point. The paradox has been solved previously by various researchers, and the energy lost during the charging of capacitors has been primarily attributed to the heat and radiation. We analytically prove this for various standard resistor-capacitor (RC) and resistor-inductor-capacitor (RLC) circuit models. From the perspective of electronic system security, electromagnetic (EM) side-channel analysis (SCA) has recently gained significant prominence with the growth of resource-constrained, internet connected devices. This article connects the energy lost due to capacitor charging to the EM SCA leakage in electronic devices, leading to the recovery of the secret encryption key embedded within the device. Finally, with an understanding of how lost energy relates to EM radiation, we propose adiabatic charging as a solution to minimize EM leakage, thereby paving the way towards low-overhead EM SCA resilience.",
    "published": "2025-12-23T12:11:37Z",
    "updated": "2025-12-23T12:11:37Z",
    "authors": [
      "Raghvendra Pratap Singh",
      "Baibhab Chatterjee",
      "Shreyas Sen",
      "Debayan Das"
    ],
    "affiliations": [],
    "first_author": "Raghvendra Pratap Singh",
    "pdf_url": "https://arxiv.org/pdf/2512.20303v1",
    "primary_category": "cs.CR",
    "relevance_score": 10.0
  }
]