{
  "title": "Modern DDoS Threats and Countermeasures: Insights into Emerging Attacks and Detection Strategies",
  "authors": [
    "Jincheng Wang",
    "Le Yu",
    "John C. S. Lui",
    "Xiapu Luo"
  ],
  "published": "2025-02-27T11:22:25+00:00",
  "arxiv_id": "2502.19996v1",
  "abstract": "Distributed Denial of Service (DDoS) attacks persist as significant threats to online services and infrastructure, evolving rapidly in sophistication and eluding traditional detection mechanisms. This evolution demands a comprehensive examination of current trends in DDoS attacks and the efficacy of modern detection strategies. This paper offers an comprehensive survey of emerging DDoS attacks and detection strategies over the past decade. We delve into the diversification of attack targets, extending beyond conventional web services to include newer network protocols and systems, and the adoption of advanced adversarial tactics. Additionally, we review current detection techniques, highlighting essential features that modern systems must integrate to effectively neutralize these evolving threats. Given the technological demands of contemporary network systems, such as high-volume and in-line packet processing capabilities, we also explore how innovative hardware technologies like programmable switches can significantly enhance the development and deployment of robust DDoS detection systems. We conclude by identifying open problems and proposing future directions for DDoS research. In particular, our survey sheds light on the investigation of DDoS attack surfaces for emerging systems, protocols, and adversarial strategies. Moreover, we outlines critical open questions in the development of effective detection systems, e.g., the creation of defense mechanisms independent of control planes.",
  "categories": [
    "cs.CR"
  ],
  "relevance_score": 18.5,
  "query_category": "ddos_mitigation",
  "us_affiliation": false,
  "pdf_url": "https://arxiv.org/pdf/2502.19996v1",
  "downloaded": "2025-12-11T08:24:00.824878"
}