{
  "arxiv_id": "2510.26004v1",
  "title": "DARTS: A Drone-Based AI-Powered Real-Time Traffic Incident Detection System",
  "authors": [
    "Bai Li",
    "Achilleas Kourtellis",
    "Rong Cao",
    "Joseph Post",
    "Brian Porter",
    "Yu Zhang"
  ],
  "published": "2025-10-29T22:32:16Z",
  "url": "http://arxiv.org/abs/2510.26004v1",
  "pdf_url": "http://arxiv.org/pdf/2510.26004v1.pdf",
  "relevance_score": 100,
  "summary": "Rapid and reliable incident detection is critical for reducing crash-related fatalities, injuries, and congestion. However, conventional methods, such as closed-circuit television, dashcam footage, and sensor-based detection, separate detection from verification, suffer from limited flexibility, and require dense infrastructure or high penetration rates, restricting adaptability and scalability to shifting incident hotspots. To overcome these challenges, we developed DARTS, a drone-based, AI-powered real-time traffic incident detection system. DARTS integrates drones' high mobility and aerial perspective for adaptive surveillance, thermal imaging for better low-visibility performance and privacy protection, and a lightweight deep learning framework for real-time vehicle trajectory extraction and incident detection. The system achieved 99% detection accuracy on a self-collected dataset and supports simultaneous online visual verification, severity assessment, and incident-induced congestion propagation monitoring via a web-based interface. In a field test on Interstate 75 in Florida, DARTS detected and verified a rear-end collision 12 minutes earlier than the local transportation management center and monitored incident-induced congestion propagation, suggesting potential to support faster emergency response and enable proactive traffic control to reduce congestion and secondary crash risk. Crucially, DARTS's flexible deployment architecture reduces dependence on frequent physical patrols, indicating potential scalability and cost-effectiveness for use in remote areas and resource-constrained settings. This study presents a promising step toward a more flexible and integrated real-time traffic incident detection system, with significant implications for the operational efficiency and responsiveness of modern transportation management."
}