[
  {
    "id": "http://arxiv.org/abs/2503.04174v2",
    "arxiv_id": "2503.04174v2",
    "title": "UniNet: A Unified Multi-granular Traffic Modeling Framework for Network Security",
    "summary": "As modern networks grow increasingly complex--driven by diverse devices, encrypted protocols, and evolving threats--network traffic analysis has become critically important. Existing machine learning models often rely only on a single representation of packets or flows, limiting their ability to capture the contextual relationships essential for robust analysis. Furthermore, task-specific architectures for supervised, semi-supervised, and unsupervised learning lead to inefficiencies in adapting to varying data formats and security tasks. To address these gaps, we propose UniNet, a unified framework that introduces a novel multi-granular traffic representation (T-Matrix), integrating session, flow, and packet-level features to provide comprehensive contextual information. Combined with T-Attent, a lightweight attention-based model, UniNet efficiently learns latent embeddings for diverse security tasks. Extensive evaluations across four key network security and privacy problems--anomaly detection, attack classification, IoT device identification, and encrypted website fingerprinting--demonstrate UniNet's significant performance gain over state-of-the-art methods, achieving higher accuracy, lower false positive rates, and improved scalability. By addressing the limitations of single-level models and unifying traffic analysis paradigms, UniNet sets a new benchmark for modern network security.",
    "published": "2025-03-06T07:39:37Z",
    "updated": "2025-07-03T06:09:01Z",
    "authors": [
      "Binghui Wu",
      "Dinil Mon Divakaran",
      "Mohan Gurusamy"
    ],
    "affiliations": [],
    "first_author": "Binghui Wu",
    "pdf_url": "https://arxiv.org/pdf/2503.04174v2",
    "primary_category": "cs.CR",
    "relevance_score": 18.0
  },
  {
    "id": "http://arxiv.org/abs/2509.15694v1",
    "arxiv_id": "2509.15694v1",
    "title": "Inference Attacks on Encrypted Online Voting via Traffic Analysis",
    "summary": "Online voting enables individuals to participate in elections remotely, offering greater efficiency and accessibility in both governmental and organizational settings. As this method gains popularity, ensuring the security of online voting systems becomes increasingly vital, as the systems supporting it must satisfy a demanding set of security requirements. Most research in this area emphasizes the design and verification of cryptographic protocols to protect voter integrity and system confidentiality. However, other vectors, such as network traffic analysis, remain relatively understudied, even though they may pose significant threats to voter privacy and the overall trustworthiness of the system.   In this paper, we examine how adversaries can exploit metadata from encrypted network traffic to uncover sensitive information during online voting. Our analysis reveals that, even without accessing the encrypted content, it is possible to infer critical voter actions, such as whether a person votes, the exact moment a ballot is submitted, and whether the ballot is valid or spoiled. We test these attacks with both rule-based techniques and machine learning methods. We evaluate our attacks on two widely used online voting platforms, one proprietary and one partially open source, achieving classification accuracy as high as 99.5%. These results expose a significant privacy vulnerability that threatens key properties of secure elections, including voter secrecy and protection against coercion or vote-buying. We explore mitigations to our attacks, demonstrating that countermeasures such as payload padding and timestamp equalization can substantially limit their effectiveness.",
    "published": "2025-09-19T07:14:01Z",
    "updated": "2025-09-19T07:14:01Z",
    "authors": [
      "Anastasiia Belousova",
      "Francesco Marchiori",
      "Mauro Conti"
    ],
    "affiliations": [],
    "first_author": "Anastasiia Belousova",
    "pdf_url": "https://arxiv.org/pdf/2509.15694v1",
    "primary_category": "cs.CR",
    "relevance_score": 16.0
  },
  {
    "id": "http://arxiv.org/abs/2503.22161v4",
    "arxiv_id": "2503.22161v4",
    "title": "AI-based Traffic Modeling for Network Security and Privacy: Challenges Ahead",
    "summary": "Network traffic analysis using AI (machine learning and deep learning) models made significant progress over the past decades. Traffic analysis addresses various challenging problems in network security, ranging from detection of anomalies and attacks to countering of Internet censorship. AI models are also developed to expose user privacy risks as demonstrated by the research works on fingerprinting of user-visiting websites, IoT devices, and different applications, even when payloads are encrypted.   Despite these advancements, significant challenges remain in the domain of network traffic analysis to effectively secure our networks from evolving threats and attacks. After briefly reviewing the relevant tasks and recent AI models for traffic analysis, we discuss the challenges that lie ahead.",
    "published": "2025-03-28T05:54:17Z",
    "updated": "2025-12-23T05:40:28Z",
    "authors": [
      "Dinil Mon Divakaran"
    ],
    "affiliations": [],
    "first_author": "Dinil Mon Divakaran",
    "pdf_url": "https://arxiv.org/pdf/2503.22161v4",
    "primary_category": "cs.CR",
    "relevance_score": 16.0
  },
  {
    "id": "http://arxiv.org/abs/2502.20589v1",
    "arxiv_id": "2502.20589v1",
    "title": "LLMs Have Rhythm: Fingerprinting Large Language Models Using Inter-Token Times and Network Traffic Analysis",
    "summary": "As Large Language Models (LLMs) become increasingly integrated into many technological ecosystems across various domains and industries, identifying which model is deployed or being interacted with is critical for the security and trustworthiness of the systems. Current verification methods typically rely on analyzing the generated output to determine the source model. However, these techniques are susceptible to adversarial attacks, operate in a post-hoc manner, and may require access to the model weights to inject a verifiable fingerprint. In this paper, we propose a novel passive and non-invasive fingerprinting technique that operates in real-time and remains effective even under encrypted network traffic conditions. Our method leverages the intrinsic autoregressive generation nature of language models, which generate text one token at a time based on all previously generated tokens, creating a unique temporal pattern like a rhythm or heartbeat that persists even when the output is streamed over a network. We find that measuring the Inter-Token Times (ITTs)-time intervals between consecutive tokens-can identify different language models with high accuracy. We develop a Deep Learning (DL) pipeline to capture these timing patterns using network traffic analysis and evaluate it on 16 Small Language Models (SLMs) and 10 proprietary LLMs across different deployment scenarios, including local host machine (GPU/CPU), Local Area Network (LAN), Remote Network, and Virtual Private Network (VPN). The experimental results confirm that our proposed technique is effective and maintains high accuracy even when tested in different network conditions. This work opens a new avenue for model identification in real-world scenarios and contributes to more secure and trustworthy language model deployment.",
    "published": "2025-02-27T23:22:01Z",
    "updated": "2025-02-27T23:22:01Z",
    "authors": [
      "Saeif Alhazbi",
      "Ahmed Mohamed Hussain",
      "Gabriele Oligeri",
      "Panos Papadimitratos"
    ],
    "affiliations": [],
    "first_author": "Saeif Alhazbi",
    "pdf_url": "https://arxiv.org/pdf/2502.20589v1",
    "primary_category": "cs.CR",
    "relevance_score": 14.0
  },
  {
    "id": "http://arxiv.org/abs/2501.15395v1",
    "arxiv_id": "2501.15395v1",
    "title": "Hiding in Plain Sight: An IoT Traffic Camouflage Framework for Enhanced Privacy",
    "summary": "The rapid growth of Internet of Things (IoT) devices has introduced significant challenges to privacy, particularly as network traffic analysis techniques evolve. While encryption protects data content, traffic attributes such as packet size and timing can reveal sensitive information about users and devices. Existing single-technique obfuscation methods, such as packet padding, often fall short in dynamic environments like smart homes due to their predictability, making them vulnerable to machine learning-based attacks. This paper introduces a multi-technique obfuscation framework designed to enhance privacy by disrupting traffic analysis. The framework leverages six techniques-Padding, Padding with XORing, Padding with Shifting, Constant Size Padding, Fragmentation, and Delay Randomization-to obscure traffic patterns effectively. Evaluations on three public datasets demonstrate significant reductions in classifier performance metrics, including accuracy, precision, recall, and F1 score. We assess the framework's robustness against adversarial tactics by retraining and fine-tuning neural network classifiers on obfuscated traffic. The results reveal a notable degradation in classifier performance, underscoring the framework's resilience against adaptive attacks. Furthermore, we evaluate communication and system performance, showing that higher obfuscation levels enhance privacy but may increase latency and communication overhead.",
    "published": "2025-01-26T04:33:44Z",
    "updated": "2025-01-26T04:33:44Z",
    "authors": [
      "Daniel Adu Worae",
      "Spyridon Mastorakis"
    ],
    "affiliations": [],
    "first_author": "Daniel Adu Worae",
    "pdf_url": "https://arxiv.org/pdf/2501.15395v1",
    "primary_category": "cs.CR",
    "relevance_score": 14.0
  },
  {
    "id": "http://arxiv.org/abs/2402.03694v2",
    "arxiv_id": "2402.03694v2",
    "title": "ServeFlow: A Fast-Slow Model Architecture for Network Traffic Analysis",
    "summary": "Network traffic analysis increasingly uses complex machine learning models as the internet consolidates and traffic gets more encrypted. However, over high-bandwidth networks, flows can easily arrive faster than model inference rates. The temporal nature of network flows limits simple scale-out approaches leveraged in other high-traffic machine learning applications. Accordingly, this paper presents ServeFlow, a solution for machine-learning model serving aimed at network traffic analysis tasks, which carefully selects the number of packets to collect and the models to apply for individual flows to achieve a balance between minimal latency, high service rate, and high accuracy. We identify that on the same task, inference time across models can differ by 1.8x - 141.3x, while the inter-packet waiting time is up to 6-8 orders of magnitude higher than the inference time! Based on these insights, we tailor a novel fast-slow model architecture for networking ML pipelines. Flows are assigned to a slower model only when the inferences from the fast model are deemed high uncertainty. ServeFlow is able to make inferences on 76.3% of flows in under 16ms, which is a speed-up of 40.5x on the median end-to-end serving latency while increasing the service rate and maintaining similar accuracy. Even with thousands of features per flow, it achieves a service rate of over 48.5k new flows per second on a 16-core CPU commodity server, which matches the order of magnitude of flow rates observed on city-level network backbones.",
    "published": "2024-02-06T04:28:33Z",
    "updated": "2024-10-24T14:15:42Z",
    "authors": [
      "Shinan Liu",
      "Ted Shaowang",
      "Gerry Wan",
      "Jeewon Chae",
      "Jonatas Marques",
      "Sanjay Krishnan",
      "Nick Feamster"
    ],
    "affiliations": [],
    "first_author": "Shinan Liu",
    "pdf_url": "https://arxiv.org/pdf/2402.03694v2",
    "primary_category": "cs.NI",
    "relevance_score": 11.0
  }
]