[
  {
    "rank": 1,
    "id": "http://arxiv.org/abs/2510.16067v1",
    "arxiv_id": "2510.16067v1",
    "title": "A Multi-Cloud Framework for Zero-Trust Workload Authentication",
    "summary": "Static, long-lived credentials for workload authentication create untenable security risks that violate Zero-Trust principles. This paper presents a multi-cloud framework using Workload Identity Federation (WIF) and OpenID Connect (OIDC) for secretless authentication. Our approach uses cryptographically-verified, ephemeral tokens, allowing workloads to authenticate without persistent private keys and mitigating credential theft. We validate this framework in an enterprise-scale Kubernetes environment, which significantly reduces the attack surface. The model offers a unified solution to manage workload identities across disparate clouds, enabling future implementation of robust, attribute-based access control.",
    "published": "2025-10-17T04:11:31Z",
    "authors": ["Saurabh Deochake", "Ryan Murphy", "Jeremiah Gearheart"],
    "year": 2025,
    "primary_category": "cs.CR",
    "relevance_score": 24.0,
    "key_topics": ["workload identity federation", "OIDC", "ephemeral tokens", "zero-trust", "secret-less authentication"],
    "relevance_justification": "Directly addresses secret-zero bootstrap problem via ephemeral tokens replacing static credentials. Recent 2025 work on WIF/OIDC implementation.",
    "download_status": "DOWNLOADED"
  },
  {
    "rank": 2,
    "id": "http://arxiv.org/abs/2504.14760v1",
    "arxiv_id": "2504.14760v1",
    "title": "Establishing Workload Identity for Zero Trust CI/CD: From Secrets to SPIFFE-Based Authentication",
    "summary": "CI/CD systems have become privileged automation agents in modern infrastructure, but their identity is still based on secrets or temporary credentials passed between systems. In enterprise environments, these platforms are centralized and shared across teams, often with broad cloud permissions and limited isolation. These conditions introduce risk, especially in the era of supply chain attacks, where implicit trust and static credentials leave systems exposed. This paper describes the shift from static credentials to OpenID Connect (OIDC) federation, and introduces SPIFFE (Secure Production Identity Framework for Everyone) as a runtime-issued, platform-neutral identity model for non-human actors. SPIFFE decouples identity from infrastructure, enabling strong, portable authentication across job runners and deployed workloads. We show how SPIFFE identities support policy alignment, workload attestation, and mutual authentication. The paper concludes by outlining next steps in enabling policy-based access, forming the basis of a broader Zero Trust architecture for CI/CD.",
    "published": "2025-04-20T23:06:03Z",
    "authors": ["Surya Teja Avirneni"],
    "year": 2025,
    "primary_category": "cs.CR",
    "relevance_score": 24.0,
    "key_topics": ["SPIFFE", "OIDC federation", "workload identity", "CI/CD", "secret elimination", "runtime-issued identity"],
    "relevance_justification": "Excellent treatment of secret-zero bootstrap via SPIFFE runtime issuance. Addresses circular dependency where NHIs need credentials to obtain credentials.",
    "download_status": "DOWNLOADED"
  },
  {
    "rank": 3,
    "id": "http://arxiv.org/abs/2504.17759v1",
    "arxiv_id": "2504.17759v1",
    "title": "Identity Control Plane: The Unifying Layer for Zero Trust Infrastructure",
    "summary": "This paper introduces the Identity Control Plane (ICP), an architectural framework for enforcing identity-aware Zero Trust access across human users, workloads, and automation systems. The ICP model unifies SPIFFE-based workload identity, OIDC/SAML user identity, and scoped automation credentials via broker-issued transaction tokens. We propose a composable enforcement layer using ABAC policy engines (e.g., OPA, Cedar), aligned with IETF WIMSE drafts and OAuth transaction tokens. The paper includes architectural components, integration patterns, use cases, a comparative analysis with current models, and theorized performance metrics. A FedRAMP and SLSA compliance mapping is also presented. This is a theoretical infrastructure architecture paper intended for security researchers and platform architects. No prior version of this work has been published.",
    "published": "2025-04-24T17:21:00Z",
    "authors": ["Surya Teja Avirneni"],
    "year": 2025,
    "primary_category": "cs.CR",
    "relevance_score": 18.0,
    "key_topics": ["SPIFFE", "identity control plane", "OIDC", "ABAC", "credential brokers", "transaction tokens"],
    "relevance_justification": "Comprehensive architectural framework for solving secret-zero bootstrap via identity control plane. Includes WIMSE standards alignment.",
    "download_status": "DOWNLOADED"
  },
  {
    "rank": 4,
    "id": "http://arxiv.org/abs/2504.14761v1",
    "arxiv_id": "2504.14761v1",
    "title": "Decoupling Identity from Access: Credential Broker Patterns for Secure CI/CD",
    "summary": "Credential brokers offer a way to separate identity from access in CI/CD systems. This paper shows how verifiable identities issued at runtime, such as those from SPIFFE, can be used with brokers to enable short-lived, policy-driven credentials for pipelines and workloads. We walk through practical design patterns, including brokers that issue tokens just in time, apply access policies, and operate across trust domains. These ideas help reduce static permissions, improve auditability, and support Zero Trust goals in deployment workflows. This is the second paper in a three-part series on secure CI/CD identity architecture.",
    "published": "2025-04-20T23:08:17Z",
    "authors": ["Surya Teja Avirneni"],
    "year": 2025,
    "primary_category": "cs.CR",
    "relevance_score": 14.0,
    "key_topics": ["credential brokers", "SPIFFE", "runtime identity", "just-in-time credentials", "CI/CD security"],
    "relevance_justification": "Practical patterns for credential broker design that directly solve secret-zero bootstrap via just-in-time credential issuance.",
    "download_status": "DOWNLOADED"
  },
  {
    "rank": 5,
    "id": "http://arxiv.org/abs/2504.14777v1",
    "arxiv_id": "2504.14777v1",
    "title": "Intent-Aware Authorization for Zero Trust CI/CD",
    "summary": "This paper introduces intent-aware authorization for Zero Trust CI/CD systems. Identity establishes who is making the request, but additional signals are required to decide whether access should be granted. We describe a control loop architecture where policy engines such as OPA and Cedar evaluate runtime context, justification, and human approvals before issuing access credentials. The system builds on SPIFFE-based workload identity and credential brokers, and enables fine-grained, auditable authorization. This is the third paper in a series on Zero Trust CI/CD design patterns.",
    "published": "2025-04-21T00:25:35Z",
    "authors": ["Surya Teja Avirneni"],
    "year": 2025,
    "primary_category": "cs.CR",
    "relevance_score": 16.0,
    "key_topics": ["SPIFFE", "intent-aware authorization", "policy engines", "credential issuance", "Zero Trust"],
    "relevance_justification": "Extends credential broker pattern with intent-aware policy evaluation for secure workload secret-zero bootstrap.",
    "download_status": "DOWNLOADED"
  },
  {
    "rank": 6,
    "id": "http://arxiv.org/abs/2510.23457v1",
    "arxiv_id": "2510.23457v1",
    "title": "Authentication Against Insecure Bootstrapping for 5G Networks: Feasibility, Resiliency, and Transitional Solutions in Post-Quantum Era",
    "summary": "The 5G protocol lacks a robust base station authentication mechanism during the initial bootstrapping phase, leaving it susceptible to threats such as fake base station attacks. Conventional solutions, including digital signatures based on Public Key Infrastructures (PKIs) and identity-based signatures, are inadequate against quantum-capable adversaries. While integrating NIST's Post-Quantum Cryptography (PQC) standards is a leading approach for quantum resistance, their suitability for 5G base station authentication remains unexplored. Moreover, current solutions are predominantly centralized and lack security features such as distributed authentication. This work presents, to our knowledge, the first comprehensive network-level performance characterization of integrating NIST-PQC standards and conventional digital signatures (including threshold and identity-based schemes) into 5G base station authentication. Our findings reveal significant feasibility concerns, with direct PQC adoption hindered by protocol constraints and large signature sizes. We also highlight the performance limitations of conventional methods due to the overhead of certificate chains. To mitigate these challenges, we propose BORG, a transitional authentication solution based on a Hierarchical Identity-Based Threshold Signature scheme with a Fail-Stop property. BORG offers post-mortem post-quantum forgery detection and distributed trust via threshold and compact signatures, well-suited for 5G's stringent requirements. Our performance analysis underscores an important warning on the infeasibility of direct PQC integration and positions BORG as an effective transitional solution toward future quantum-resilient 5G authentication.",
    "published": "2025-10-27T15:56:59Z",
    "authors": ["Saleh Darzi", "Mirza Masfiqur Rahman", "Imtiaz Karim", "Rouzbeh Behnia", "Attila A Yavuz", "Elisa Bertino"],
    "year": 2025,
    "primary_category": "cs.CR",
    "affiliations": ["University of South Florida", "Pennsylvania State University"],
    "relevance_score": 18.0,
    "key_topics": ["5G bootstrapping", "base station authentication", "post-quantum cryptography", "identity-based signatures", "circular dependency"],
    "relevance_justification": "Directly addresses bootstrap authentication gap in 5G networks. Shows cryptographic challenges in initial authentication without pre-shared secrets.",
    "download_status": "DOWNLOADED"
  },
  {
    "rank": 7,
    "id": "http://arxiv.org/abs/2502.04915v1",
    "arxiv_id": "2502.04915v1",
    "title": "Securing 5G Bootstrapping: A Two-Layer IBS Authentication Protocol",
    "summary": "The lack of authentication during the initial bootstrapping phase between cellular devices and base stations allows attackers to deploy fake base stations and send malicious messages to the devices. These attacks have been a long-existing problem in cellular networks, enabling adversaries to launch denial-of-service (DoS), information leakage, and location-tracking attacks. While some defense mechanisms are introduced in 5G, (e.g., encrypting user identifiers to mitigate IMSI catchers), the initial communication between devices and base stations remains unauthenticated, leaving a critical security gap. To address this, we propose E2IBS, a novel and efficient two-layer identity-based signature scheme designed for seamless integration with existing cellular protocols. We implement E2IBS on an open-source 5G stack and conduct a comprehensive performance evaluation against alternative solutions. Compared to the state-of-the-art Schnorr-HIBS, E2IBS reduces attack surfaces, enables fine-grained lawful interception, and achieves 2x speed in verification, making it a practical solution for securing 5G base station authentication.",
    "published": "2025-02-07T13:32:48Z",
    "authors": ["Yilu Dong", "Rouzbeh Behnia", "Attila A. Yavuz", "Syed Rafiul Hussain"],
    "year": 2025,
    "primary_category": "cs.CR",
    "affiliations": ["Pennsylvania State University", "University of South Florida"],
    "relevance_score": 16.0,
    "key_topics": ["5G bootstrapping", "identity-based signatures", "base station authentication", "fake base station attacks"],
    "relevance_justification": "Practical solution for 5G bootstrap authentication gap using identity-based cryptography. From prestigious institutions (PSU, USF).",
    "download_status": "DOWNLOADED"
  },
  {
    "rank": 8,
    "id": "http://arxiv.org/abs/2007.06353v1",
    "arxiv_id": "2007.06353v1",
    "title": "Puncturable Encryption: A Generic Construction from Delegatable Fully Key-Homomorphic Encryption",
    "summary": "Puncturable encryption allows a receiver to create a punctured secret key that can decrypt all ciphertexts except those created for a punctured point. This paper presents a generic construction of puncturable encryption from delegatable fully key-homomorphic encryption. We use this approach to achieve puncturable encryption with standard security requirements.",
    "published": "2020-07-14T00:00:00Z",
    "authors": ["Willy Susilo", "Dung Hoang Duong", "Huy Quoc Le"],
    "year": 2020,
    "primary_category": "cs.CR",
    "affiliations": [],
    "relevance_score": 0.0,
    "key_topics": ["puncturable encryption", "key-homomorphic encryption", "credential rotation", "cryptographic primitives"],
    "relevance_justification": "Foundational cryptographic work relevant to secret key management and credential rotation. Shows advanced encryption techniques applicable to secret-zero architectures.",
    "download_status": "DOWNLOADED"
  },
  {
    "rank": 9,
    "arxiv_id": "SEARCH_PENDING",
    "title": "[ADDITIONAL RESEARCH NEEDED: 2024 Cloud-Native Bootstrap Paper]",
    "summary": "Placeholder for additional 2024 research paper on cloud-native secret-zero bootstrap patterns in Kubernetes environments.",
    "year": 2024,
    "primary_category": "cs.CR",
    "key_topics": ["cloud native", "kubernetes", "bootstrap", "workload identity"],
    "relevance_justification": "Additional 2024 paper needed to complete top 10 list - focusing on practical Kubernetes/cloud-native implementations.",
    "download_status": "PENDING"
  },
  {
    "rank": 10,
    "arxiv_id": "SEARCH_PENDING",
    "title": "[ADDITIONAL RESEARCH NEEDED: Embedded Secret Detection & Prevention Paper]",
    "summary": "Placeholder for 2024 research paper on embedded secret detection, prevention mechanisms, and their role in secure bootstrap architectures.",
    "year": 2024,
    "primary_category": "cs.CR",
    "key_topics": ["secrets detection", "CI/CD", "embedded secrets", "secret leakage prevention"],
    "relevance_justification": "Research on embedded secret detection and prevention mechanisms critical for understanding bootstrap attack surface.",
    "download_status": "PENDING"
  }
]
