[
  {
    "id": "http://arxiv.org/abs/2510.16067v1",
    "arxiv_id": "2510.16067v1",
    "title": "A Multi-Cloud Framework for Zero-Trust Workload Authentication",
    "summary": "Static, long-lived credentials for workload authentication create untenable security risks that violate Zero-Trust principles. This paper presents a multi-cloud framework using Workload Identity Federation (WIF) and OpenID Connect (OIDC) for secretless authentication. Our approach uses cryptographically-verified, ephemeral tokens, allowing workloads to authenticate without persistent private keys and mitigating credential theft. We validate this framework in an enterprise-scale Kubernetes environment, which significantly reduces the attack surface. The model offers a unified solution to manage workload identities across disparate clouds, enabling future implementation of robust, attribute-based access control.",
    "published": "2025-10-17T04:11:31Z",
    "updated": "2025-10-17T04:11:31Z",
    "authors": [
      "Saurabh Deochake",
      "Ryan Murphy",
      "Jeremiah Gearheart"
    ],
    "affiliations": [],
    "first_author": "Saurabh Deochake",
    "pdf_url": "https://arxiv.org/pdf/2510.16067v1",
    "primary_category": "cs.CR",
    "relevance_score": 24.0
  },
  {
    "id": "http://arxiv.org/abs/2504.14760v1",
    "arxiv_id": "2504.14760v1",
    "title": "Establishing Workload Identity for Zero Trust CI/CD: From Secrets to SPIFFE-Based Authentication",
    "summary": "CI/CD systems have become privileged automation agents in modern infrastructure, but their identity is still based on secrets or temporary credentials passed between systems. In enterprise environments, these platforms are centralized and shared across teams, often with broad cloud permissions and limited isolation. These conditions introduce risk, especially in the era of supply chain attacks, where implicit trust and static credentials leave systems exposed. This paper describes the shift from static credentials to OpenID Connect (OIDC) federation, and introduces SPIFFE (Secure Production Identity Framework for Everyone) as a runtime-issued, platform-neutral identity model for non-human actors. SPIFFE decouples identity from infrastructure, enabling strong, portable authentication across job runners and deployed workloads. We show how SPIFFE identities support policy alignment, workload attestation, and mutual authentication. The paper concludes by outlining next steps in enabling policy-based access, forming the basis of a broader Zero Trust architecture for CI/CD.",
    "published": "2025-04-20T23:06:03Z",
    "updated": "2025-04-20T23:06:03Z",
    "authors": [
      "Surya Teja Avirneni"
    ],
    "affiliations": [],
    "first_author": "Surya Teja Avirneni",
    "pdf_url": "https://arxiv.org/pdf/2504.14760v1",
    "primary_category": "cs.CR",
    "relevance_score": 24.0
  },
  {
    "id": "http://arxiv.org/abs/2504.17759v1",
    "arxiv_id": "2504.17759v1",
    "title": "Identity Control Plane: The Unifying Layer for Zero Trust Infrastructure",
    "summary": "This paper introduces the Identity Control Plane (ICP), an architectural framework for enforcing identity-aware Zero Trust access across human users, workloads, and automation systems. The ICP model unifies SPIFFE-based workload identity, OIDC/SAML user identity, and scoped automation credentials via broker-issued transaction tokens. We propose a composable enforcement layer using ABAC policy engines (e.g., OPA, Cedar), aligned with IETF WIMSE drafts and OAuth transaction tokens. The paper includes architectural components, integration patterns, use cases, a comparative analysis with current models, and theorized performance metrics. A FedRAMP and SLSA compliance mapping is also presented. This is a theoretical infrastructure architecture paper intended for security researchers and platform architects. No prior version of this work has been published.",
    "published": "2025-04-24T17:21:00Z",
    "updated": "2025-04-24T17:21:00Z",
    "authors": [
      "Surya Teja Avirneni"
    ],
    "affiliations": [],
    "first_author": "Surya Teja Avirneni",
    "pdf_url": "https://arxiv.org/pdf/2504.17759v1",
    "primary_category": "cs.CR",
    "relevance_score": 18.0
  },
  {
    "id": "http://arxiv.org/abs/2504.14777v1",
    "arxiv_id": "2504.14777v1",
    "title": "Intent-Aware Authorization for Zero Trust CI/CD",
    "summary": "This paper introduces intent-aware authorization for Zero Trust CI/CD systems. Identity establishes who is making the request, but additional signals are required to decide whether access should be granted. We describe a control loop architecture where policy engines such as OPA and Cedar evaluate runtime context, justification, and human approvals before issuing access credentials. The system builds on SPIFFE-based workload identity and credential brokers, and enables fine-grained, auditable authorization. This is the third paper in a series on Zero Trust CI/CD design patterns.",
    "published": "2025-04-21T00:25:35Z",
    "updated": "2025-04-21T00:25:35Z",
    "authors": [
      "Surya Teja Avirneni"
    ],
    "affiliations": [],
    "first_author": "Surya Teja Avirneni",
    "pdf_url": "https://arxiv.org/pdf/2504.14777v1",
    "primary_category": "cs.CR",
    "relevance_score": 16.0
  },
  {
    "id": "http://arxiv.org/abs/2504.14761v1",
    "arxiv_id": "2504.14761v1",
    "title": "Decoupling Identity from Access: Credential Broker Patterns for Secure CI/CD",
    "summary": "Credential brokers offer a way to separate identity from access in CI/CD systems. This paper shows how verifiable identities issued at runtime, such as those from SPIFFE, can be used with brokers to enable short-lived, policy-driven credentials for pipelines and workloads. We walk through practical design patterns, including brokers that issue tokens just in time, apply access policies, and operate across trust domains. These ideas help reduce static permissions, improve auditability, and support Zero Trust goals in deployment workflows. This is the second paper in a three-part series on secure CI/CD identity architecture.",
    "published": "2025-04-20T23:08:17Z",
    "updated": "2025-04-20T23:08:17Z",
    "authors": [
      "Surya Teja Avirneni"
    ],
    "affiliations": [],
    "first_author": "Surya Teja Avirneni",
    "pdf_url": "https://arxiv.org/pdf/2504.14761v1",
    "primary_category": "cs.CR",
    "relevance_score": 14.0
  }
]