[
  {
    "id": "http://arxiv.org/abs/2510.23457v1",
    "arxiv_id": "2510.23457v1",
    "title": "Authentication Against Insecure Bootstrapping for 5G Networks: Feasibility, Resiliency, and Transitional Solutions in Post-Quantum Era",
    "summary": "The 5G protocol lacks a robust base station authentication mechanism during the initial bootstrapping phase, leaving it susceptible to threats such as fake base station attacks. Conventional solutions, including digital signatures based on Public Key Infrastructures (PKIs) and identity-based signatures, are inadequate against quantum-capable adversaries. While integrating NIST's Post-Quantum Cryptography (PQC) standards is a leading approach for quantum resistance, their suitability for 5G base station authentication remains unexplored. Moreover, current solutions are predominantly centralized and lack security features such as distributed authentication. This work presents, to our knowledge, the first comprehensive network-level performance characterization of integrating NIST-PQC standards and conventional digital signatures (including threshold and identity-based schemes) into 5G base station authentication. Our findings reveal significant feasibility concerns, with direct PQC adoption hindered by protocol constraints and large signature sizes. We also highlight the performance limitations of conventional methods due to the overhead of certificate chains. To mitigate these challenges, we propose BORG, a transitional authentication solution based on a Hierarchical Identity-Based Threshold Signature scheme with a Fail-Stop property. BORG offers post-mortem post-quantum forgery detection and distributed trust via threshold and compact signatures, well-suited for 5G's stringent requirements. Our performance analysis underscores an important warning on the infeasibility of direct PQC integration and positions BORG as an effective transitional solution toward future quantum-resilient 5G authentication.",
    "published": "2025-10-27T15:56:59Z",
    "updated": "2025-10-27T15:56:59Z",
    "authors": [
      "Saleh Darzi",
      "Mirza Masfiqur Rahman",
      "Imtiaz Karim",
      "Rouzbeh Behnia",
      "Attila A Yavuz",
      "Elisa Bertino"
    ],
    "affiliations": [],
    "first_author": "Saleh Darzi",
    "pdf_url": "https://arxiv.org/pdf/2510.23457v1",
    "primary_category": "cs.CR",
    "relevance_score": 18.0
  },
  {
    "id": "http://arxiv.org/abs/2502.04915v1",
    "arxiv_id": "2502.04915v1",
    "title": "Securing 5G Bootstrapping: A Two-Layer IBS Authentication Protocol",
    "summary": "The lack of authentication during the initial bootstrapping phase between cellular devices and base stations allows attackers to deploy fake base stations and send malicious messages to the devices. These attacks have been a long-existing problem in cellular networks, enabling adversaries to launch denial-of-service (DoS), information leakage, and location-tracking attacks. While some defense mechanisms are introduced in 5G, (e.g., encrypting user identifiers to mitigate IMSI catchers), the initial communication between devices and base stations remains unauthenticated, leaving a critical security gap. To address this, we propose E2IBS, a novel and efficient two-layer identity-based signature scheme designed for seamless integration with existing cellular protocols. We implement E2IBS on an open-source 5G stack and conduct a comprehensive performance evaluation against alternative solutions. Compared to the state-of-the-art Schnorr-HIBS, E2IBS reduces attack surfaces, enables fine-grained lawful interception, and achieves 2x speed in verification, making it a practical solution for securing 5G base station authentication.",
    "published": "2025-02-07T13:32:48Z",
    "updated": "2025-02-07T13:32:48Z",
    "authors": [
      "Yilu Dong",
      "Rouzbeh Behnia",
      "Attila A. Yavuz",
      "Syed Rafiul Hussain"
    ],
    "affiliations": [
      "the pennsylvania state university",
      "university of south florida",
      "university of south florida",
      "the pennsylvania state university"
    ],
    "first_author": "Yilu Dong",
    "pdf_url": "https://arxiv.org/pdf/2502.04915v1",
    "primary_category": "cs.CR",
    "relevance_score": 16.0
  },
  {
    "id": "http://arxiv.org/abs/2512.20007v1",
    "arxiv_id": "2512.20007v1",
    "title": "Semiparametric KSD test: unifying score and distance-based approaches for goodness-of-fit testing",
    "summary": "Goodness-of-fit (GoF) tests are fundamental for assessing model adequacy. Score-based tests are appealing because they require fitting the model only once under the null. However, extending them to powerful nonparametric alternatives is difficult due to the lack of suitable score functions. Through a class of exponentially tilted models, we show that the resulting score-based GoF tests are equivalent to the tests based on integral probability metrics (IPMs) indexed by a function class. When the class is rich, the test is universally consistent. This simple yet insightful perspective enables reinterpretation of classical distance-based testing procedures-including those based on Kolmogorov-Smirnov distance, Wasserstein-1 distance, and maximum mean discrepancy-as arising from score-based constructions. Building on this insight, we propose a new nonparametric score-based GoF test through a special class of IPM induced by kernelized Stein's function class, called semiparametric kernelized Stein discrepancy (SKSD) test. Compared with other nonparametric score-based tests, the SKSD test is computationally efficient and accommodates general nuisance-parameter estimators, supported by a generic parametric bootstrap procedure. The SKSD test is universally consistent and attains Pitman efficiency. Moreover, SKSD test provides simple GoF tests for models with intractable likelihoods but tractable scores with the help of Stein's identity and we use two popular models, kernel exponential family and conditional Gaussian models, to illustrate the power of our method. Our method achieves power comparable to task-specific normality tests such as Anderson-Darling and Lilliefors, despite being designed for general nonparametric alternatives.",
    "published": "2025-12-23T03:05:26Z",
    "updated": "2025-12-23T03:05:26Z",
    "authors": [
      "Zhihan Huang",
      "Ziang Niu"
    ],
    "affiliations": [],
    "first_author": "Zhihan Huang",
    "pdf_url": "https://arxiv.org/pdf/2512.20007v1",
    "primary_category": "stat.ML",
    "relevance_score": 14.0
  },
  {
    "id": "http://arxiv.org/abs/2512.17527v1",
    "arxiv_id": "2512.17527v1",
    "title": "SafeBench-Seq: A Homology-Clustered, CPU-Only Baseline for Protein Hazard Screening with Physicochemical/Composition Features and Cluster-Aware Confidence Intervals",
    "summary": "Foundation models for protein design raise concrete biosecurity risks, yet the community lacks a simple, reproducible baseline for sequence-level hazard screening that is explicitly evaluated under homology control and runs on commodity CPUs. We introduce SafeBench-Seq, a metadata-only, reproducible benchmark and baseline classifier built entirely from public data (SafeProtein hazards and UniProt benigns) and interpretable features (global physicochemical descriptors and amino-acid composition). To approximate \"never-before-seen\" threats, we homology-cluster the combined dataset at <=40% identity and perform cluster-level holdouts (no cluster overlap between train/test). We report discrimination (AUROC/AUPRC) and screening-operating points (TPR@1% FPR; FPR@95% TPR) with 95% bootstrap confidence intervals (n=200), and we provide calibrated probabilities via CalibratedClassifierCV (isotonic for Logistic Regression / Random Forest; Platt sigmoid for Linear SVM). We quantify probability quality using Brier score, Expected Calibration Error (ECE; 15 bins), and reliability diagrams. Shortcut susceptibility is probed via composition-preserving residue shuffles and length-/composition-only ablations. Empirically, random splits substantially overestimate robustness relative to homology-clustered evaluation; calibrated linear models exhibit comparatively good calibration, while tree ensembles retain slightly higher Brier/ECE. SafeBench-Seq is CPU-only, reproducible, and releases metadata only (accessions, cluster IDs, split labels), enabling rigorous evaluation without distributing hazardous sequences.",
    "published": "2025-12-19T12:51:31Z",
    "updated": "2025-12-19T12:51:31Z",
    "authors": [
      "Muhammad Haris Khan"
    ],
    "affiliations": [],
    "first_author": "Muhammad Haris Khan",
    "pdf_url": "https://arxiv.org/pdf/2512.17527v1",
    "primary_category": "cs.LG",
    "relevance_score": 14.0
  },
  {
    "id": "http://arxiv.org/abs/2512.05197v1",
    "arxiv_id": "2512.05197v1",
    "title": "Coarse-graining in time, emergent temperature in 2d CFT at large central charge",
    "summary": "Using the monodromy method, a compact expression is obtained for the identity block contribution to the expectation value of two low-energy probe operators on a broad class of time-dependent heavy pure states in large-$c$ 2d CFTs. It will be shown that the size of the compact spatial dimension sets a coarse-graining time-scale above which the thermal two-point function naturally emerges. A phenomena will be highlighted where the information of the pure state appears to get projected down to a single conformal representation. We will see that this projection is corroborated by known conformal bootstrap results.",
    "published": "2025-12-04T19:04:17Z",
    "updated": "2025-12-04T19:04:17Z",
    "authors": [
      "Gideon Vos"
    ],
    "affiliations": [],
    "first_author": "Gideon Vos",
    "pdf_url": "https://arxiv.org/pdf/2512.05197v1",
    "primary_category": "hep-th",
    "relevance_score": 14.0
  },
  {
    "id": "http://arxiv.org/abs/2510.21778v1",
    "arxiv_id": "2510.21778v1",
    "title": "Ageing Drift in Binary Face Templates: A Bits-per-Decade Analysis",
    "summary": "We study the longitudinal stability of compact binary face templates and quantify ageing drift directly in bits per decade. Float embeddings from a modern face CNN are compressed with PCA-ITQ into 64- and 128-bit codes. For each identity in AgeDB with at least three distinct ages, we form all genuine pairs and fit a per-identity linear model of Hamming distance versus absolute age gap. Across 566 identities, the median slope is 1.357 bits per decade for 64-bit templates and 2.571 bits per decade for 128-bit templates, with tight non-parametric 95 percent bootstrap confidence intervals. The distributions are predominantly positive, indicating a small but systematic increase in intra-class distance over time. Because drift scales with code length, shorter codes are inherently more age-stable at a fixed decision threshold. We connect these slopes to operating characteristics by reporting EER and TPR at FAR = 1 percent in three age bins. We discuss implications for smart-card and match-on-card deployments, including simple mitigations such as periodic re-enrolment and targeted parity on empirically unstable bit positions. Code and CSV artifacts are provided to support reproducibility.",
    "published": "2025-10-17T17:56:49Z",
    "updated": "2025-10-17T17:56:49Z",
    "authors": [
      "Abdelilah Ganmati",
      "Karim Afdel",
      "Lahcen Koutti"
    ],
    "affiliations": [],
    "first_author": "Abdelilah Ganmati",
    "pdf_url": "https://arxiv.org/pdf/2510.21778v1",
    "primary_category": "cs.CV",
    "relevance_score": 14.0
  },
  {
    "id": "http://arxiv.org/abs/2507.13356v1",
    "arxiv_id": "2507.13356v1",
    "title": "Unified Frequency-Domain Reconstruction and Boundary Adaptation for Incompressible Navier-Stokes Equations",
    "summary": "Global regularity for the three-dimensional incompressible Navier-Stokes equations remains unresolved partly because weak, mild, and strong formulations employ incompatible functional settings. The present study introduces a frequency-domain framework that reconciles these formulations within a single constructive scheme. Starting from Leray-Hopf data, a scale-dependent regularization operator combining mollification, Sobolev extension, and the Leray projector produces smooth, divergence-free approximations. Two bounded Fourier multipliers are then defined: an interpolation operator that blends low-frequency weak and high-frequency strong components, and a smoothing operator that yields uniform parabolic gain. Littlewood-Paley analysis, refined Calderon-Zygmund and Schauder estimates, and an explicit Galerkin scheme provide quantitative Hs a priori bounds and a lifespan controlled by the first Stokes eigenvalue. Compactness via the Aubin-Lions lemma and dominated convergence demonstrates that, as the regularization parameter vanishes, the approximations converge to a single velocity field satisfying simultaneously the weak energy identity, the Fujita-Kato mild formulation, and the strong formulation in Hs with s > 3/2. The construction furnishes a unified local solution and supplies operator bounds required for subsequent energy-vorticity bootstraps and global continuation arguments, clarifying the interplay between frequency localization and nonlinear estimates in fluid dynamics.",
    "published": "2025-06-16T18:57:18Z",
    "updated": "2025-06-16T18:57:18Z",
    "authors": [
      "Daria Nikitaeva"
    ],
    "affiliations": [],
    "first_author": "Daria Nikitaeva",
    "pdf_url": "https://arxiv.org/pdf/2507.13356v1",
    "primary_category": "math.GM",
    "relevance_score": 14.0
  },
  {
    "id": "http://arxiv.org/abs/2506.01619v3",
    "arxiv_id": "2506.01619v3",
    "title": "A projector--rank partition theorem for exact degrees of freedom in experimental design",
    "summary": "In many experimental designs\\textemdash split-plots, blocked or nested layouts, fractional factorials, and studies with missing or unequal replication\\textemdash standard ANOVA procedures no longer tell us exactly how many independent pieces of information each effect truly carries. We provide a general degrees of freedom $(\\mathrm{df})$ partition theorem that resolves this ambiguity. For $N$ observations, we show that the total information in the data ({\\ie}, $N-1$ $\\mathrm{df}$) can be split exactly across experimental effects and randomization strata by projecting the data onto each stratum and counting the $\\mathrm{df}$ each effect contributes there. This yields integer $\\mathrm{df}$\\textemdash not approximations\\textemdash for any mix of fixed and random effects, blocking structures, fractionation, or imbalance. This result yields closed-form $\\mathrm{df}$ tables for unbalanced split-plot, row-column, lattice, and crossed-nested designs. We introduce practical diagnostics\\textemdash the $\\mathrm{df}$-retention ratio $ρ$, df deficiency $δ$, and variance-inflation index $α$\\textemdash that measure exactly how many $\\mathrm{df}$ an effect retains under blocking or fractionation and the resulting loss of precision, thereby extending Box--Hunter's resolution idea to multi-stratum and incomplete designs. Classical results emerge as corollaries: Cochran's one-stratum identity; Yates's split-plot $\\mathrm{df}$; resolution-$R$ identified when an effect retains no $\\mathrm{df}$. Empirical studies on split-plot and nested designs, a blocked fractional-factorial design-selection experiment, and timing benchmarks show that our approach delivers calibrated error rates, recovers information to raise power by up to 60\\% without additional runs, and is orders of magnitude faster than bootstrap-based $\\mathrm{df}$ approximations.",
    "published": "2025-06-02T12:58:25Z",
    "updated": "2025-08-27T14:07:24Z",
    "authors": [
      "Nagananda K G"
    ],
    "affiliations": [],
    "first_author": "Nagananda K G",
    "pdf_url": "https://arxiv.org/pdf/2506.01619v3",
    "primary_category": "math.ST",
    "relevance_score": 14.0
  },
  {
    "id": "http://arxiv.org/abs/2502.08871v2",
    "arxiv_id": "2502.08871v2",
    "title": "Notes on conformal integrals: Coulomb branch amplitudes, magic identities and bootstrap",
    "summary": "We study multi-loop conformal integrals for four-point correlators of planar ${\\cal N}=4$ super-Yang-Mills theory, and in particular those contributing to Coulomb branch amplitudes in the ten-dimensional lightlike limit, where linear combinations of such integrals are determined by the large R-charge octagons exactly known from integrability. Exploiting known results for integrands, we review those combinations of dual conformal invariant (DCI) integrals that must evaluate to determinants of ladders, generalizing the simplest cases of Basso-Dixon fishnet integrals; in this way, we summarize all-loop predictions for the integrands (which are extracted from $f$-graphs) contributing to components of Coulomb branch amplitudes, such as next-to-fishnet integrals. Moreover, this exercise produces new ``magic identities\", {\\it i.e.} certain combinations of DCI integrals equal zero, and we enumerate and simplify such identities up to six loops explicitly.   On the other hand, most of these individual integrals have not been computed beyond three loops, and as a first step we consider a bootstrap program for DCI integrals based on their leading singularities and the space of pure functions. We bootstrap the $3$ non-trivial DCI integrals for four-loop Coulomb branch amplitudes (providing an independent verification of the four-loop magic identity), which all take remarkably simple form as weight-$8$ single-valued harmonic polylogarithms. We also compute all leading singularities and a large portion of the pure functions for the $34$ DCI integrals contributing to five-loop amplitudes, where not only some integrals evaluate to functions beyond harmonic polylogarithms but they also contain lower-weight pieces individually.",
    "published": "2025-02-13T00:52:38Z",
    "updated": "2025-10-15T05:53:00Z",
    "authors": [
      "Song He",
      "Xuhang Jiang",
      "Jiahao Liu",
      "Yao-Qi Zhang"
    ],
    "affiliations": [],
    "first_author": "Song He",
    "pdf_url": "https://arxiv.org/pdf/2502.08871v2",
    "primary_category": "hep-th",
    "relevance_score": 14.0
  },
  {
    "id": "http://arxiv.org/abs/2501.17772v4",
    "arxiv_id": "2501.17772v4",
    "title": "Self-Supervised Frameworks for Speaker Verification via Bootstrapped Positive Sampling",
    "summary": "Recent developments in Self-Supervised Learning (SSL) have demonstrated significant potential for Speaker Verification (SV), but closing the performance gap with supervised systems remains an ongoing challenge. SSL frameworks rely on anchor-positive pairs, constructed from segments of the same audio utterance. Hence, positives have channel characteristics similar to those of their corresponding anchors, even with extensive data-augmentation. Therefore, this positive sampling strategy is a fundamental limitation as it encodes too much information regarding the recording source in the learned representations. This article introduces Self-Supervised Positive Sampling (SSPS), a bootstrapped technique for sampling appropriate and diverse positives in SSL frameworks for SV. SSPS samples positives close to their anchor in the representation space, assuming that these pseudo-positives belong to the same speaker identity but correspond to different recording conditions. This method consistently demonstrates improvements in SV performance on VoxCeleb benchmarks when applied to major SSL frameworks, including SimCLR, SwAV, VICReg, and DINO. Using SSPS, SimCLR and DINO achieve 2.57% and 2.53% EER on VoxCeleb1-O, respectively. SimCLR yields a 58% relative reduction in EER, getting comparable performance to DINO with a simpler training framework. Furthermore, SSPS lowers intra-class variance and reduces channel information in speaker representations while exhibiting greater robustness without data-augmentation.",
    "published": "2025-01-29T17:08:01Z",
    "updated": "2025-07-24T21:10:40Z",
    "authors": [
      "Theo Lepage",
      "Reda Dehak"
    ],
    "affiliations": [],
    "first_author": "Theo Lepage",
    "pdf_url": "https://arxiv.org/pdf/2501.17772v4",
    "primary_category": "eess.AS",
    "relevance_score": 14.0
  },
  {
    "id": "http://arxiv.org/abs/2512.19392v1",
    "arxiv_id": "2512.19392v1",
    "title": "Holographic correlators from multi-mode AdS$_5$ bubbling geometries",
    "summary": "Supergravity calculations of holographic four-point correlation functions are a powerful tool for deriving dynamical information about the dual field theory at strong coupling. Recently, a number of such computations have been performed by studying light probes of smooth horizonless supergravity solutions, including certain asymptotically $AdS_5\\times S^5$ solutions of Lin-Lunin-Maldacena (LLM) type. We construct a new closed-form perturbative LLM solution involving a pair of linearized supergravitons with different mode numbers and their quadratic backreaction. Using this solution, we compute two infinite sequences of four-point correlators. Depending on the scaling of certain parameters, the background supergravity solutions are dual to states of 4D $\\mathcal{N}=4$ super Yang-Mills theory that are either heavy or light, whereupon the correlators in the dual field theory are either (perturbatively) heavy-heavy-light-light or all-light. In the all-light regime, the correlators we compute are related by superconformal Ward identities to correlators of four single-particle chiral primary operators (CPOs). We confirm a set of expressions in the literature for such correlators of CPOs, that were obtained via Mellin space bootstrap and/or Witten diagram methods. We also obtain a novel compact expression for one of the two infinite sequences of correlators of chiral primaries.",
    "published": "2025-12-22T13:40:16Z",
    "updated": "2025-12-22T13:40:16Z",
    "authors": [
      "David Turton",
      "Alexander Tyukov"
    ],
    "affiliations": [],
    "first_author": "David Turton",
    "pdf_url": "https://arxiv.org/pdf/2512.19392v1",
    "primary_category": "hep-th",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2512.05189v1",
    "arxiv_id": "2512.05189v1",
    "title": "Integral constraints for $\\mathcal{N}=4$ super-Yang-Mills from a squashed sphere",
    "summary": "Supersymmetric localization and Ward identities have been used in the past several years to derive two integral constraints on the four-point function of the stress-tensor multiplet in $\\mathcal{N} = 4$ super-Yang-Mills theory. These constraints are powerful tools for studying the theory, especially when used in tandem with analytic and/or numerical bootstrap techniques. In this paper, we consider three additional integral constraints that can be derived starting from the $\\mathcal{N} = 4$ super-Yang-Mills theory placed on a squashed four-sphere. These constraints are technically much more challenging to derive than the ones in the literature, and much of the paper is devoted to developing techniques to make this computation tractable. Our end result is that these three constraints are implied by the two constraints already appearing in the literature.",
    "published": "2025-12-04T19:00:03Z",
    "updated": "2025-12-04T19:00:03Z",
    "authors": [
      "Shai M. Chester",
      "Ross Dempsey",
      "Debaditya Pramanik",
      "Silviu S. Pufu"
    ],
    "affiliations": [],
    "first_author": "Shai M. Chester",
    "pdf_url": "https://arxiv.org/pdf/2512.05189v1",
    "primary_category": "hep-th",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2511.10613v2",
    "arxiv_id": "2511.10613v2",
    "title": "The Unitary Architecture of Renormalization",
    "summary": "We set up a bootstrap problem for renormalization. Working in the massless four-dimensional O$(N)$ model and the $λφ^4$ theory, we prove that unitarity leads to all-loop recursion relations between coefficients of scattering amplitudes with different multiplicities. These turn out to be equivalent to the identities imposed by renormalization of the coupling and the wavefunction through subleading logarithmic order, except with different initial conditions. Matching the initial conditions thus fixes the beta function and wavefunction anomalous dimension to these orders. We explain how to connect this new on-shell renormalization picture with the standard renormalized perturbation theory, highlighting a rich interplay between finiteness, dimensional regularization, and unitarity cuts.",
    "published": "2025-11-13T18:44:45Z",
    "updated": "2025-12-22T18:32:26Z",
    "authors": [
      "Ameya Chavda",
      "Daniel McLoughlin",
      "Sebastian Mizera",
      "John Staunton"
    ],
    "affiliations": [],
    "first_author": "Ameya Chavda",
    "pdf_url": "https://arxiv.org/pdf/2511.10613v2",
    "primary_category": "hep-th",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2511.07434v1",
    "arxiv_id": "2511.07434v1",
    "title": "RL-Exec: Impact-Aware Reinforcement Learning for Opportunistic Optimal Liquidation, Outperforms TWAP and a Book-Liquidity VWAP on BTC-USD Replays",
    "summary": "We study opportunistic optimal liquidation over fixed deadlines on BTC-USD limit-order books (LOB). We present RL-Exec, a PPO agent trained on historical replays augmented with endogenous transient impact (resilience), partial fills, maker/taker fees, and latency. The policy observes depth-20 LOB features plus microstructure indicators and acts under a sell-only inventory constraint to reach a residual target. Evaluation follows a strict time split (train: Jan-2020; test: Feb-2020) and a per-day protocol: for each test day we run ten independent start times and aggregate to a single daily score, avoiding pseudo-replication. We compare the agent to (i) TWAP and (ii) a VWAP-like baseline allocating using opposite-side order-book liquidity (top-20 levels), both executed on identical timestamps and costs. Statistical inference uses one-sided Wilcoxon signed-rank tests on daily RL-baseline differences with Benjamini-Hochberg FDR correction and bootstrap confidence intervals. On the Feb-2020 test set, RL-Exec significantly outperforms both baselines and the gap increases with the execution horizon (+2-3 bps at 30 min, +7-8 bps at 60 min, +23 bps at 120 min).   Code: github.com/Giafferri/RL-Exec",
    "published": "2025-10-30T20:25:49Z",
    "updated": "2025-10-30T20:25:49Z",
    "authors": [
      "Enzo Duflot",
      "Stanislas Robineau"
    ],
    "affiliations": [],
    "first_author": "Enzo Duflot",
    "pdf_url": "https://arxiv.org/pdf/2511.07434v1",
    "primary_category": "q-fin.ST",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2510.25933v1",
    "arxiv_id": "2510.25933v1",
    "title": "Humains-Junior: A 3.8B Language Model Achieving GPT-4o-Level Factual Accuracy by Directed Exoskeleton Reasoning",
    "summary": "We introduce Humans-Junior, a 3.8B model that matches GPT-4o on the FACTS Grounding public subset within a $\\pm 5$ pp equivalence margin.   Results. On Q1--Q500 under identical judges, GPT-4o scores 73.5% (95% CI 69.5--77.2) and Humans-Junior 72.7% (95% CI 68.7--76.5); the paired difference is 0.8 pp (bootstrap 95% CI $-3.1$ to $+4.7$; permutation $p = 0.72$; Cohen's $d = 0.023$). TOST establishes equivalence at $\\pm 5$ pp (not at $\\pm 3$ pp). When purchased as managed APIs, Humans-Junior's base model (Phi-3.5-mini-instruct) is $\\approx 19\\times$ less expensive than GPT-4o on Microsoft AI Foundry pricing; self-hosted or edge deployments can drive incremental inference cost toward zero. Measured vs estimated pricing sources are tabulated in Appendix E.   Method. Our approach combines minimal directed \"Exoskeleton Reasoning\" scaffolds with behavioral fine-tuning that teaches protocol compliance (epistemic discipline) rather than domain answers. Fine-tuning alone adds little; combined, they synergize (+17.7 pp, $p < 0.001$) and reduce variance ($\\approx 25\\%$). In prompt-only settings on frontier models (Q1--Q100; non-comparable), directed reasoning improved GPT-4o by +11.8 pp to 85.3% and Gemini-2.5-Pro by +5.0 pp to 93.3% (baseline 88.3%, $n = 100$); see Section~5.   TL;DR. A 3.8B model achieves GPT-4o-level FACTS accuracy (equivalent within $\\pm 5$ pp on Q1--Q500). Cloud pricing shows $\\approx 19\\times$ lower cost versus GPT-4o, and self-hosted/edge deployments can approach zero marginal cost. Pricing sources are listed in Appendix E. Frontier prompt-only gains (Q1--Q100; non-comparable) and optimized-prompt exploratory results under earlier judges are summarized in Appendix F.   Keywords: Small Language Models, Factual Grounding, Directed Reasoning, Fine-Tuning, Model Alignment, Cost-Efficient AI",
    "published": "2025-10-29T20:12:36Z",
    "updated": "2025-10-29T20:12:36Z",
    "authors": [
      "Nissan Yaron",
      "Dan Bystritsky",
      "Ben-Etzion Yaron"
    ],
    "affiliations": [],
    "first_author": "Nissan Yaron",
    "pdf_url": "https://arxiv.org/pdf/2510.25933v1",
    "primary_category": "cs.AI",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2510.20894v2",
    "arxiv_id": "2510.20894v2",
    "title": "Analytic thermal bootstrap meets holography",
    "summary": "We compute thermal holographic correlators by combining their analytic structure with the Kubo-Martin-Schwinger (KMS) condition and multi-stress tensor OPE coefficients determined from the dual AdS description. We focus on two-point functions of identical scalar operators with integer conformal dimensions at zero spatial separation. In the black brane background, we show explicitly that holographic two-point functions split into three contributions: a principal one, computed exactly, plus regularized and arcs contributions, both approximated through the use of OPE coefficients asymptotics. For $Δ_φ=3$, we show that the principal contribution agree with good approximation with the numerical solution of the bulk wave equation. Moreover, we demonstrate that the expansion in generalized free field correlators proposed in [Barrat,6/2025] admits a natural interpretation in terms of Witten diagrams. Finally, we initiate the study of thermal correlators in the spherically symmetric black hole background, computing their principal contributions.",
    "published": "2025-10-23T18:00:00Z",
    "updated": "2025-11-13T15:30:04Z",
    "authors": [
      "Julien Barrat",
      "Deniz N. Bozkurt",
      "Enrico Marchetto",
      "Alessio Miscioscia",
      "Elli Pomoni"
    ],
    "affiliations": [],
    "first_author": "Julien Barrat",
    "pdf_url": "https://arxiv.org/pdf/2510.20894v2",
    "primary_category": "hep-th",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2510.20156v1",
    "arxiv_id": "2510.20156v1",
    "title": "Two-loop QCD Amplitudes from the Chiral Algebra Bootstrap",
    "summary": "We show that the chiral algebra bootstrap, which computes form factors of twistorial theories, can help determine two-loop amplitudes in massless QCD. We give an $n$-gluon result for a previously unknown partial amplitude of the two-loop all-plus-helicity QCD amplitude by utilizing supersymmetry Ward identities and known chiral algebra bootstrap results. We then show that the full-color two-loop $n$-gluon amplitude of QCD with $n_f$ quark flavors can be obtained from certain two-loop form factors of twistorial theories and one-loop and tree-level amplitudes. Chiral algebra bootstrap results exist for these form factors when all gluons have positive helicities. Hence, the bootstrap simplifies the computation of these two-loop amplitudes by one loop level.",
    "published": "2025-10-23T03:06:17Z",
    "updated": "2025-10-23T03:06:17Z",
    "authors": [
      "Anthony Morales"
    ],
    "affiliations": [],
    "first_author": "Anthony Morales",
    "pdf_url": "https://arxiv.org/pdf/2510.20156v1",
    "primary_category": "hep-th",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2510.18945v1",
    "arxiv_id": "2510.18945v1",
    "title": "de Sitter no-go's for Riemann-flat manifolds and a link to semidefinite optimisation",
    "summary": "We establish a no-go theorem in the context of string and M-theory flux compactifications on Riemann-Flat manifolds with Casimir energy. Specifically, we show that no dS minimum exists in this setup in dimension $d>3$. The case of dS$_3$ minima is not excluded, but their actual fate can only be ascertained via an explicit construction. We also point out that the problem of finding dS minima on RFM's and more general flux compactifications is mathematically equivalent to a semidefinite programming problem, identical to those studied in CFT bootstrap, and hence the search for dS can benefit from the existing vast literature and numerical tools. We illustrate this in a toy model.",
    "published": "2025-10-21T18:00:00Z",
    "updated": "2025-10-21T18:00:00Z",
    "authors": [
      "Bruno Valeixo Bento",
      "Miguel Montero"
    ],
    "affiliations": [],
    "first_author": "Bruno Valeixo Bento",
    "pdf_url": "https://arxiv.org/pdf/2510.18945v1",
    "primary_category": "hep-th",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2508.15019v1",
    "arxiv_id": "2508.15019v1",
    "title": "Twin-Boot: Uncertainty-Aware Optimization via Online Two-Sample Bootstrapping",
    "summary": "Standard gradient descent methods yield point estimates with no measure of confidence. This limitation is acute in overparameterized and low-data regimes, where models have many parameters relative to available data and can easily overfit. Bootstrapping is a classical statistical framework for uncertainty estimation based on resampling, but naively applying it to deep learning is impractical: it requires training many replicas, produces post-hoc estimates that cannot guide learning, and implicitly assumes comparable optima across runs - an assumption that fails in non-convex landscapes. We introduce Twin-Bootstrap Gradient Descent (Twin-Boot), a resampling-based training procedure that integrates uncertainty estimation into optimization. Two identical models are trained in parallel on independent bootstrap samples, and a periodic mean-reset keeps both trajectories in the same basin so that their divergence reflects local (within-basin) uncertainty. During training, we use this estimate to sample weights in an adaptive, data-driven way, providing regularization that favors flatter solutions. In deep neural networks and complex high-dimensional inverse problems, the approach improves calibration and generalization and yields interpretable uncertainty maps.",
    "published": "2025-08-20T19:20:38Z",
    "updated": "2025-08-20T19:20:38Z",
    "authors": [
      "Carlos Stein Brito"
    ],
    "affiliations": [],
    "first_author": "Carlos Stein Brito",
    "pdf_url": "https://arxiv.org/pdf/2508.15019v1",
    "primary_category": "cs.LG",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2508.05001v1",
    "arxiv_id": "2508.05001v1",
    "title": "CRAM: Large-scale Video Continual Learning with Bootstrapped Compression",
    "summary": "Continual learning (CL) promises to allow neural networks to learn from continuous streams of inputs, instead of IID (independent and identically distributed) sampling, which requires random access to a full dataset. This would allow for much smaller storage requirements and self-sufficiency of deployed systems that cope with natural distribution shifts, similarly to biological learning. We focus on video CL employing a rehearsal-based approach, which reinforces past samples from a memory buffer. We posit that part of the reason why practical video CL is challenging is the high memory requirements of video, further exacerbated by long-videos and continual streams, which are at odds with the common rehearsal-buffer size constraints. To address this, we propose to use compressed vision, i.e. store video codes (embeddings) instead of raw inputs, and train a video classifier by IID sampling from this rolling buffer. Training a video compressor online (so not depending on any pre-trained networks) means that it is also subject to catastrophic forgetting. We propose a scheme to deal with this forgetting by refreshing video codes, which requires careful decompression with a previous version of the network and recompression with a new one. We name our method Continually Refreshed Amodal Memory (CRAM). We expand current video CL benchmarks to large-scale settings, namely EpicKitchens-100 and Kinetics-700, storing thousands of relatively long videos in under 2 GB, and demonstrate empirically that our video CL method outperforms prior art with a significantly reduced memory footprint.",
    "published": "2025-08-07T03:32:20Z",
    "updated": "2025-08-07T03:32:20Z",
    "authors": [
      "Shivani Mall",
      "Joao F. Henriques"
    ],
    "affiliations": [],
    "first_author": "Shivani Mall",
    "pdf_url": "https://arxiv.org/pdf/2508.05001v1",
    "primary_category": "cs.CV",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2508.03813v1",
    "arxiv_id": "2508.03813v1",
    "title": "A Hidden Permutation Symmetry of Squared Amplitudes in ABJM Theory",
    "summary": "We define the square amplitudes in planar Aharony-Bergman-Jafferis-Maldacena theory (ABJM), analogous to that in $\\mathcal{N}{=}4$ super-Yang-Mills theory (SYM). Surprisingly, the $n$-point $L$-loop integrands with fixed $N{:=}n{+}L$ are unified in a single generating function. Similar to the SYM four-point half-BPS correlator integrand, the generating function enjoys a hidden $S_N$ permutation symmetry in the dual space, allowing us to write it as a linear combination of weight-3 planar $f$-graphs. Remarkably, through Gram identities it can also be represented as a linear combination of bipartite $f$-graphs which manifest the important property that no odd-multiplicity amplitude exists in the theory. The generating function and these properties are explicitly checked against squared amplitudes for all $n$ with $N{=}4,6,8$. By drawing analogies with SYM, we conjecture some graphical rules the generating function satisfy, and exploit them to bootstrap a unique $N{=}10$ result, which provides new results for $n{=}10$ squared tree amplitudes, as well as integrands for $(n,L){=}(4,6),(6,4)$. Our results strongly suggest the existence of a \"bipartite correlator\" in ABJM theory that unifies all squared amplitudes and satisfies physical constraints underlying these graphical rules.",
    "published": "2025-08-05T18:01:33Z",
    "updated": "2025-08-05T18:01:33Z",
    "authors": [
      "Song He",
      "Canxin Shi",
      "Yichao Tang",
      "Yao-Qi Zhang"
    ],
    "affiliations": [],
    "first_author": "Song He",
    "pdf_url": "https://arxiv.org/pdf/2508.03813v1",
    "primary_category": "hep-th",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2507.21874v2",
    "arxiv_id": "2507.21874v2",
    "title": "Bayesian Predictive Inference Beyond Martingales",
    "summary": "There is a growing interest in the so-called Bayesian Predictive Inference approach, which allows to perform Bayesian inference without specifying the likelihood and prior of the model, or the need of any MCMC. Instead, only a sequence of predictive distributions for the observations is required, and inference on the unknown estimand can be performed, cheaply in parallel, using bootstrap-type schemes. Understanding which classes of predictive distributions can be used within this framework, is still a key open question. We relax commonly used probabilistic assumptions on the observations, namely exchangeability and conditional identical distribution, and on their predictive distributions, being measure-valued martingales, by introducing the new class of Almost Conditional Identically Distributed (a.c.i.d.) random variables. This class assumes that the predictive distributions are measure-valued almost supermartingales, and is parametrized by a sequence of parameters $(ξ_n)_{n>0}$, which regulate the decay of conditional dependence among future observations. Under mild summability assumptions on $(ξ_n)_{n>0}$, the resulting sequence of observations is shown to be asymptotically exchangeable, hence amenable to Bayesian Predictive Inference techniques. A.c.i.d. random variables arise naturally in recursive algorithms, and include classic approaches in Statistics and Learning Theory, such as kernel estimators, and more novel ones, such as the parametric Bayesian bootstraps.",
    "published": "2025-07-29T14:43:46Z",
    "updated": "2025-09-29T17:02:48Z",
    "authors": [
      "Marco Battiston",
      "Lorenzo Cappello"
    ],
    "affiliations": [],
    "first_author": "Marco Battiston",
    "pdf_url": "https://arxiv.org/pdf/2507.21874v2",
    "primary_category": "math.ST",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2506.22361v1",
    "arxiv_id": "2506.22361v1",
    "title": "A General Test for Independent and Identically Distributed Hypothesis",
    "summary": "We propose a simple and intuitive test for arguably the most prevailing hypothesis in statistics that data are independent and identically distributed (IID), based on a newly introduced off-diagonal sequential U-process. This IID test is fully nonparametric and applicable to random objects in general spaces, while requiring no specific alternatives such as structural breaks or serial dependence, which allows for detecting general types of violations of the IID assumption. An easy-to-implement jackknife multiplier bootstrap is tailored to produce critical values of the test. Under mild conditions, we establish Gaussian approximation for the proposed U-processes, and derive non-asymptotic coupling and Kolmogorov distance bounds for its maximum and the bootstrapped version, providing rigorous theoretical guarantees. Simulations and real data applications are conducted to demonstrate the usefulness and versatility compared with existing methods.",
    "published": "2025-06-27T16:21:35Z",
    "updated": "2025-06-27T16:21:35Z",
    "authors": [
      "Tongyu Li",
      "Jonas Mueller",
      "Fang Yao"
    ],
    "affiliations": [],
    "first_author": "Tongyu Li",
    "pdf_url": "https://arxiv.org/pdf/2506.22361v1",
    "primary_category": "stat.ME",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2506.17382v1",
    "arxiv_id": "2506.17382v1",
    "title": "The Bootstrap of Points and Lines",
    "summary": "We study two-dimensional conformal field theories (CFTs) with boundaries via the conformal bootstrap. We derive a positive semi-definite program from crossing symmetry of three observables: the annulus partition function, the two-point function of identical operators in the presence of a boundary, and the four-point function of the same operators on the infinite plane. The mixed-correlator system allows the numerical bootstrap to access new data, like the bulk-to-boundary Operator Product Expansion coefficients, and to strengthen the bounds on observables already contained in the partition function on the annulus, such as the boundary entropy. We test the method on the free boson CFT; then, as a first application, we produce new non-perturbative bounds on the entropy and the gaps in boundary CFTs with central charge $c=3/2,$ with special emphasis on the $\\mathfrak{su}(2)_2$ WZW model.",
    "published": "2025-06-20T18:00:00Z",
    "updated": "2025-06-20T18:00:00Z",
    "authors": [
      "Marco Meineri",
      "Bharathkumar Radhakrishnan"
    ],
    "affiliations": [],
    "first_author": "Marco Meineri",
    "pdf_url": "https://arxiv.org/pdf/2506.17382v1",
    "primary_category": "hep-th",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2506.08723v1",
    "arxiv_id": "2506.08723v1",
    "title": "Wasserstein and Convex Gaussian Approximations for Non-stationary Time Series of Diverging Dimensionality",
    "summary": "In high-dimensional time series analysis, Gaussian approximation (GA) schemes under various distance measures or on various collections of subsets of the Euclidean space play a fundamental role in a wide range of statistical inference problems. To date, most GA results for high-dimensional time series are established on hyper-rectangles and their equivalence. In this paper, by considering the 2-Wasserstein distance and the collection of all convex sets, we establish a general GA theory for a broad class of high-dimensional non-stationary (HDNS) time series, extending the scope of problems that can be addressed in HDNS time series analysis. For HDNS time series of sufficiently weak dependence and light tail, the GA rates established in this paper are either nearly optimal with respect to the dimensionality and time series length, or they are nearly identical to the corresponding best-known GA rates established for independent data. A multiplier bootstrap procedure is utilized and theoretically justified to implement our GA theory. We demonstrate by two previously undiscussed time series applications the use of the GA theory and the bootstrap procedure as unified tools for a wide range of statistical inference problems in HDNS time series analysis.",
    "published": "2025-06-10T12:16:20Z",
    "updated": "2025-06-10T12:16:20Z",
    "authors": [
      "Miaoshiqi Liu",
      "Jun Yang",
      "Zhou Zhou"
    ],
    "affiliations": [],
    "first_author": "Miaoshiqi Liu",
    "pdf_url": "https://arxiv.org/pdf/2506.08723v1",
    "primary_category": "math.ST",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2504.12278v3",
    "arxiv_id": "2504.12278v3",
    "title": "Wormholes with Ends of the World",
    "summary": "We study classical wormhole solutions in 3D gravity with end-of-the-world (EOW) branes, conical defects, kinks, and punctures. These solutions compute statistical averages of an ensemble of boundary conformal field theories (BCFTs) related to universal asymptotics of OPE data extracted from the 2D conformal bootstrap. Conical defects connect BCFT bulk operators; branes join BCFT boundary intervals with identical boundary conditions; kinks (1D defects along branes) link BCFT boundary operators; and punctures (0D defects) are endpoints where conical defects terminate on branes. We provide evidence for a correspondence between the gravity theory and the ensemble. In particular, the agreement of the $g$-function dependence results from an underlying topological aspect of the on-shell EOW brane action, from which a BCFT analogue of the Schlenker-Witten theorem also follows.",
    "published": "2025-04-16T17:38:27Z",
    "updated": "2025-08-27T19:35:01Z",
    "authors": [
      "Diandian Wang",
      "Zhencheng Wang",
      "Zixia Wei"
    ],
    "affiliations": [],
    "first_author": "Diandian Wang",
    "pdf_url": "https://arxiv.org/pdf/2504.12278v3",
    "primary_category": "hep-th",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2503.07710v2",
    "arxiv_id": "2503.07710v2",
    "title": "Fine Spectrum from Crude Analytic Bootstrap",
    "summary": "The magnetic line defect in the $O(N)$ model gives rise to a non-trivial one-dimensional defect conformal field theory of theoretical and experimental value. This model is considered here in $d=4-\\varepsilon$ and the full spectrum of defect operators with dimensions close to one, two and three at order $\\varepsilon$ is presented. The spectrum of several classes of operators of dimension close to four and operators of large charge are also discussed. Analytic bootstrap techniques are used extensively, and efficient tools to deal with the unmixing of nearly degenerate operators are developed. Integral identities are also incorporated, and it is shown that they lead to constraints on some three-point function coefficients and anomalous dimensions to order $\\varepsilon^2$.",
    "published": "2025-03-10T18:00:00Z",
    "updated": "2025-08-23T16:12:56Z",
    "authors": [
      "Jake Belton",
      "Nadav Drukker",
      "Ziwen Kong",
      "Andreas Stergiou"
    ],
    "affiliations": [],
    "first_author": "Jake Belton",
    "pdf_url": "https://arxiv.org/pdf/2503.07710v2",
    "primary_category": "hep-th",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2502.16364v1",
    "arxiv_id": "2502.16364v1",
    "title": "Risk Measures for DC Pension Plan Decumulation",
    "summary": "As the developed world replaces Defined Benefit (DB) pension plans with Defined Contribution (DC) plans, there is a need to develop decumulation strategies for DC plan holders. Optimal decumulation can be viewed as a problem in optimal stochastic control. Formulation as a control problem requires specification of an objective function, which in turn requires a definition of reward and risk. An intuitive specification of reward is the total withdrawals over the retirement period. Most retirees view risk as the possibility of running out of savings. This paper investigates several possible left tail risk measures, in conjunction with DC plan decumulation. The risk measures studied include (i) expected shortfall (ii) linear shortfall and (iii) probability of shortfall. We establish that, under certain assumptions, the set of optimal controls associated with all expected reward and expected shortfall Pareto efficient frontier curves is identical to the set of optimal controls for all expected reward and linear shortfall Pareto efficient frontier curves. Optimal efficient frontiers are determined computationally for each risk measure, based on a parametric market model. Robustness of these strategies is determined by testing the strategies out-of-sample using block bootstrapping of historical data.",
    "published": "2025-02-22T21:40:20Z",
    "updated": "2025-02-22T21:40:20Z",
    "authors": [
      "Peter A. Forsyth",
      "Yuying Li"
    ],
    "affiliations": [],
    "first_author": "Peter A. Forsyth",
    "pdf_url": "https://arxiv.org/pdf/2502.16364v1",
    "primary_category": "math.OC",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2501.12422v2",
    "arxiv_id": "2501.12422v2",
    "title": "CroMe: Multimodal Fake News Detection using Cross-Modal Tri-Transformer and Metric Learning",
    "summary": "Multimodal Fake News Detection has received increasing attention recently. Existing methods rely on independently encoded unimodal data and overlook the advantages of capturing intra-modality relationships and integrating inter-modal similarities using advanced techniques. To address these issues, Cross-Modal Tri-Transformer and Metric Learning for Multimodal Fake News Detection (CroMe) is proposed. CroMe utilizes Bootstrapping Language-Image Pre-training with Frozen Image Encoders and Large Language Models (BLIP2) as encoders to capture detailed text, image and combined image-text representations. The metric learning module employs a proxy anchor method to capture intra-modality relationships while the feature fusion module uses a Cross-Modal and Tri-Transformer for effective integration. The final fake news detector processes the fused features through a classifier to predict the authenticity of the content. Experiments on datasets show that CroMe excels in multimodal fake news detection.",
    "published": "2025-01-21T09:36:27Z",
    "updated": "2025-11-26T04:54:36Z",
    "authors": [
      "Eunjee Choi",
      "Junhyun Ahn",
      "XinYu Piao",
      "Jong-Kook Kim"
    ],
    "affiliations": [],
    "first_author": "Eunjee Choi",
    "pdf_url": "https://arxiv.org/pdf/2501.12422v2",
    "primary_category": "cs.LG",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2412.05855v2",
    "arxiv_id": "2412.05855v2",
    "title": "A priori estimates of solutions to local and nonlocal superlinear parabolic problems",
    "summary": "We consider a priori estimates of possibly sign-changing solutions to superlinear parabolic problems and their applications (blow-up rates, energy blow-up, continuity of blow-up time, existence of nontrivial steady states etc). Our estimates are based mainly on energy, interpolation and bootstrap arguments, but we also use the Pohozaev identity, for example. We first discuss some known results on local problems and then consider problems with nonlocal nonlinearities or nonlocal differential operators. In particular, we deal with the fractional Laplacian and nonlinearities of Choquard type.",
    "published": "2024-12-08T08:27:28Z",
    "updated": "2025-01-22T12:01:20Z",
    "authors": [
      "Pavol Quittner"
    ],
    "affiliations": [],
    "first_author": "Pavol Quittner",
    "pdf_url": "https://arxiv.org/pdf/2412.05855v2",
    "primary_category": "math.AP",
    "relevance_score": 9.0
  },
  {
    "id": "http://arxiv.org/abs/2411.19551v2",
    "arxiv_id": "2411.19551v2",
    "title": "Bootstraping Clustering of Gaussians for View-consistent 3D Scene Understanding",
    "summary": "Injecting semantics into 3D Gaussian Splatting (3DGS) has recently garnered significant attention. While current approaches typically distill 3D semantic features from 2D foundational models (e.g., CLIP and SAM) to facilitate novel view segmentation and semantic understanding, their heavy reliance on 2D supervision can undermine cross-view semantic consistency and necessitate complex data preparation processes, therefore hindering view-consistent scene understanding. In this work, we present FreeGS, an unsupervised semantic-embedded 3DGS framework that achieves view-consistent 3D scene understanding without the need for 2D labels. Instead of directly learning semantic features, we introduce the IDentity-coupled Semantic Field (IDSF) into 3DGS, which captures both semantic representations and view-consistent instance indices for each Gaussian. We optimize IDSF with a two-step alternating strategy: semantics help to extract coherent instances in 3D space, while the resulting instances regularize the injection of stable semantics from 2D space. Additionally, we adopt a 2D-3D joint contrastive loss to enhance the complementarity between view-consistent 3D geometry and rich semantics during the bootstrapping process, enabling FreeGS to uniformly perform tasks such as novel-view semantic segmentation, object selection, and 3D object detection. Extensive experiments on LERF-Mask, 3D-OVS, and ScanNet datasets demonstrate that FreeGS performs comparably to state-of-the-art methods while avoiding the complex data preprocessing workload. Our code is publicly available at https://github.com/wb014/FreeGS.",
    "published": "2024-11-29T08:52:32Z",
    "updated": "2025-05-18T12:06:28Z",
    "authors": [
      "Wenbo Zhang",
      "Lu Zhang",
      "Ping Hu",
      "Liqian Ma",
      "Yunzhi Zhuge",
      "Huchuan Lu"
    ],
    "affiliations": [],
    "first_author": "Wenbo Zhang",
    "pdf_url": "https://arxiv.org/pdf/2411.19551v2",
    "primary_category": "cs.CV",
    "relevance_score": 9.0
  },
  {
    "id": "http://arxiv.org/abs/2410.04390v1",
    "arxiv_id": "2410.04390v1",
    "title": "Approximate Maximum Likelihood Inference for Acoustic Spatial Capture-Recapture with Unknown Identities, Using Monte Carlo Expectation Maximization",
    "summary": "Acoustic spatial capture-recapture (ASCR) surveys with an array of synchronized acoustic detectors can be an effective way of estimating animal density or call density. However, constructing the capture histories required for ASCR analysis is challenging, as recognizing which detections at different detectors are of which calls is not a trivial task. Because calls from different distances take different times to arrive at detectors, the order in which calls are detected is not necessarily the same as the order in which they are made, and without knowing which detections are of the same call, we do not know how many different calls are detected. We propose a Monte Carlo expectation-maximization (MCEM) estimation method to resolve this unknown call identity problem. To implement the MCEM method in this context, we sample the latent variables from a complete-data likelihood model in the expectation step and use a semi-complete-data likelihood or conditional likelihood in the maximization step. We use a parametric bootstrap to obtain confidence intervals. When we apply our method to a survey of moss frogs, it gives an estimate within 15% of the estimate obtained using data with call capture histories constructed by experts, and unlike this latter estimate, our confidence interval incorporates the uncertainty about call identities. Simulations show it to have a low bias (6%) and coverage probabilities close to the nominal 95% value.",
    "published": "2024-10-06T08:06:15Z",
    "updated": "2024-10-06T08:06:15Z",
    "authors": [
      "Yuheng Wang",
      "Juan Ye",
      "Weiye Li",
      "David L. Borchers"
    ],
    "affiliations": [],
    "first_author": "Yuheng Wang",
    "pdf_url": "https://arxiv.org/pdf/2410.04390v1",
    "primary_category": "stat.ME",
    "relevance_score": 9.0
  },
  {
    "id": "http://arxiv.org/abs/2409.08091v4",
    "arxiv_id": "2409.08091v4",
    "title": "EZIGen: Enhancing zero-shot personalized image generation with precise subject encoding and decoupled guidance",
    "summary": "Zero-shot personalized image generation models aim to produce images that align with both a given text prompt and subject image, requiring the model to incorporate both sources of guidance. Existing methods often struggle to capture fine-grained subject details and frequently prioritize one form of guidance over the other, resulting in suboptimal subject encoding and imbalanced generation. In this study, we uncover key insights into overcoming such drawbacks, notably that 1) the choice of the subject image encoder critically influences subject identity preservation and training efficiency, and 2) the text and subject guidance should take effect at different denoising stages. Building on these insights, we introduce a new approach, EZIGen, that employs two main components: leveraging a fixed pre-trained Diffusion UNet itself as subject encoder, following a process that balances the two guidances by separating their dominance stage and revisiting certain time steps to bootstrap subject transfer quality. Through these two components, EZIGen, initially built upon SD2.1-base, achieved state-of-the-art performances on multiple personalized generation benchmarks with a unified model, while using 100 times less training data. Moreover, by further migrating our design to SDXL, EZIGen is proven to be a versatile model-agnostic solution for personalized generation. Demo Page: zichengduan.github.io/pages/EZIGen/index.html",
    "published": "2024-09-12T14:44:45Z",
    "updated": "2025-05-01T05:37:57Z",
    "authors": [
      "Zicheng Duan",
      "Yuxuan Ding",
      "Chenhui Gou",
      "Ziqin Zhou",
      "Ethan Smith",
      "Lingqiao Liu"
    ],
    "affiliations": [],
    "first_author": "Zicheng Duan",
    "pdf_url": "https://arxiv.org/pdf/2409.08091v4",
    "primary_category": "cs.CV",
    "relevance_score": 9.0
  },
  {
    "id": "http://arxiv.org/abs/2412.13368v1",
    "arxiv_id": "2412.13368v1",
    "title": "Bootstrapping Extremal Scalar Amplitudes With and Without Supersymmetry",
    "summary": "We re-examine positivity bounds on the $2\\to2$ scattering of identical massless real scalars with a novel perspective on how these bounds can be used to constrain the spectrum of UV theories. We propose that the entire space of consistent weakly-coupled (and generically non-supersymmetric) UV amplitudes is determined as a convex hull of the massive scalar amplitude and a one-parameter family of scalarless \"extremal amplitudes\" parameterized by the ratio of the masses of the two lightest massive states. Further, we propose that the extremal amplitudes can be constructed from a similar one-parameter set of maximally supersymmetric amplitudes, leading to the surprising possibility that the S-matrix bootstrap with maximal supersymmetry may be sufficient to determine the entire allowed space of four-point amplitudes! Finally, we show that minimal spectrum input reduces the allowed space of Wilson coefficients to small islands around the open string Dirac-Born-Infeld tree amplitude and the closed string Virasoro-Shapiro amplitude.",
    "published": "2024-12-17T22:52:54Z",
    "updated": "2024-12-17T22:52:54Z",
    "authors": [
      "Justin Berman",
      "Henriette Elvang",
      "Nicholas Geiser",
      "Loki L. Lin"
    ],
    "affiliations": [],
    "first_author": "Justin Berman",
    "pdf_url": "https://arxiv.org/pdf/2412.13368v1",
    "primary_category": "hep-th",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2412.09610v1",
    "arxiv_id": "2412.09610v1",
    "title": "The S-matrix bootstrap with neural optimizers I: zero double discontinuity",
    "summary": "In this work, we develop machine learning techniques to study nonperturbative scattering amplitudes. We focus on the two-to-two scattering amplitude of identical scalar particles, setting the double discontinuity to zero as a simplifying assumption. Neural networks provide an efficient parameterization for scattering amplitudes, offering a flexible toolkit to describe their fine nonperturbative structure. Combined with the bootstrap approach based on the dispersive representation of the amplitude and machine learning's gradient descent algorithms, they offer a new method to explore the space of consistent S-matrices. We derive bounds on the values of the first two low-energy Taylor coefficients of the amplitude and characterize the resulting amplitudes that populate the allowed region. Crucially, we parallel our neural network analysis with the standard S-matrix bootstrap, both primal and dual, and observe perfect agreement across all approaches.",
    "published": "2024-12-12T18:59:37Z",
    "updated": "2024-12-12T18:59:37Z",
    "authors": [
      "Mehmet Asim Gumus",
      "Damien Leflot",
      "Piotr Tourkine",
      "Alexander Zhiboedov"
    ],
    "affiliations": [],
    "first_author": "Mehmet Asim Gumus",
    "pdf_url": "https://arxiv.org/pdf/2412.09610v1",
    "primary_category": "hep-th",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2412.06907v1",
    "arxiv_id": "2412.06907v1",
    "title": "Theorems for the Lightcone Bootstrap",
    "summary": "Consider a conformally covariant four-point function of identical scalar operators with a discrete spectrum, a twist gap, and compatible with the unitarity conditions. We give a mathematical proof confirming that the spectrum and OPE coefficients at large spin and fixed twist always become that of a generalized free field theory.",
    "published": "2024-12-09T19:01:13Z",
    "updated": "2024-12-09T19:01:13Z",
    "authors": [
      "Balt C. van Rees"
    ],
    "affiliations": [],
    "first_author": "Balt C. van Rees",
    "pdf_url": "https://arxiv.org/pdf/2412.06907v1",
    "primary_category": "hep-th",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2412.05506v2",
    "arxiv_id": "2412.05506v2",
    "title": "Confidence Diagram of Nonparametric Ranking for Uncertainty Assessment in Large Language Models Evaluation",
    "summary": "We consider the inference for the ranking of large language models (LLMs). Alignment arises as a significant challenge to mitigate hallucinations in the use of LLMs. Ranking LLMs has proven to be an effective tool to improve alignment based on the best-of-$N$ policy. In this paper, we propose a new inferential framework for hypothesis testing among the ranking for language models. Our framework is based on a nonparametric contextual ranking framework designed to assess large language models' domain-specific expertise, leveraging nonparametric scoring methods to account for their sensitivity to the prompts. To characterize the combinatorial complexity of the ranking, we introduce a novel concept of confidence diagram, which leverages a Hasse diagram to represent the entire confidence set of rankings by a single directed graph. We show the validity of the proposed confidence diagram by advancing the Gaussian multiplier bootstrap theory to accommodate the supremum of independent empirical processes that are not necessarily identically distributed. Extensive numerical experiments conducted on both synthetic and real data demonstrate that our approach offers valuable insight into the evaluation for the performance of different LLMs across various medical domains.",
    "published": "2024-12-07T02:34:30Z",
    "updated": "2025-02-10T15:26:28Z",
    "authors": [
      "Zebin Wang",
      "Yi Han",
      "Ethan X. Fang",
      "Lan Wang",
      "Junwei Lu"
    ],
    "affiliations": [],
    "first_author": "Zebin Wang",
    "pdf_url": "https://arxiv.org/pdf/2412.05506v2",
    "primary_category": "stat.ML",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2412.01885v1",
    "arxiv_id": "2412.01885v1",
    "title": "Localized Black Holes in AdS$_3$: What Happens Below c/12 Stays Below c/12",
    "summary": "We construct asymptotically AdS$_3 \\times$S$^3 \\times$T$^4$ black holes that are localized on the S$^3$ and co-exist with the BTZ black hole at small positive energies. These black holes dominate the microcanonical ensemble for $ E\\leq \\frac{c}{24}\\left(5\\sqrt{5}-11\\right)$, suggesting they could represent the endpoint of the BTZ instability at low energies. Remarkably, they also exist at negative energies, where pure Einstein gravity predicts no states and the BTZ black hole does not exist. They appear in the spectrum immediately above $-\\frac{c}{12}$ (the energy of global AdS$_3$), and their entropy is a significant fraction (up to 1/2) of the entropy of the free orbifold CFT at negative energies. Our solutions exist in an energy window outside the universal predictable range of the modular bootstrap in large-$c$ CFT$_2$ and, despite their microcanonical dominance, do not dominate in the canonical ensemble. To calculate the holographic entanglement entropy of our solutions, we propose the first recipe that can be applied to arbitrary geometries asymptotic to AdS$_3$ times an internal manifold, and depend non-trivially on its coordinates. We find that our new geometries have an entanglement entropy nearly identical to that of the BTZ black hole with the same energy, despite having different horizon structures. However, they can be distinguished by non-minimal extremal surfaces, which unveil finer details of the microstructure.",
    "published": "2024-12-02T19:00:00Z",
    "updated": "2024-12-02T19:00:00Z",
    "authors": [
      "Iosif Bena",
      "Raphaël Dulac",
      "Pierre Heidmann",
      "Zixia Wei"
    ],
    "affiliations": [],
    "first_author": "Iosif Bena",
    "pdf_url": "https://arxiv.org/pdf/2412.01885v1",
    "primary_category": "hep-th",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2411.15819v2",
    "arxiv_id": "2411.15819v2",
    "title": "Bootstrap-based Inference for Bivariate Heteroscedastic Extremes with a Changing Tail Copula",
    "summary": "This paper introduces a copula-based model for independent but non-identically distributed data with heteroscedastic extremes marginal and changing tail dependence structures. We establish a unified framework for inference by proving the weak convergence of the bivariate sequential tail empirical process and its empirical bootstrap counterpart. We derive the asymptotic properties of several estimators on the tail, including the quasi-tail copula, integrated scedasis function, and Hill estimator, treating them as functionals of the bivariate sequential tail empirical process. This process-centric approach enables the development of bootstrap-based methods and ensures the theoretical validity of the derived statistics. As an application of our inference method, we propose bootstrap-based tests for the equivalence of extreme value indices, the equivalence of scedasis functions, and non-changing tail dependence when marginal scedasis functions are identical. Our simulations validate the robustness and efficiency of the bootstrap-based tests.",
    "published": "2024-11-24T12:49:03Z",
    "updated": "2025-02-22T11:09:10Z",
    "authors": [
      "Yifan Hu",
      "Yanxi Hou"
    ],
    "affiliations": [],
    "first_author": "Yifan Hu",
    "pdf_url": "https://arxiv.org/pdf/2411.15819v2",
    "primary_category": "stat.ME",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2411.00978v3",
    "arxiv_id": "2411.00978v3",
    "title": "The thermal bootstrap for the critical O(N) model",
    "summary": "We propose a numerical method to estimate one-point functions and the free-energy density of conformal field theories at finite temperature by solving the Kubo-Martin-Schwinger condition for the two-point functions of identical scalars. We apply the method for the critical O(N) model for N = 1,2,3 in 3 $\\leq$ d $\\leq$ 4. We find agreement with known results from Monte Carlo simulations and previous results for the 3d Ising model, and we provide new predictions for N = 2,3.",
    "published": "2024-11-01T19:05:23Z",
    "updated": "2025-06-13T16:51:17Z",
    "authors": [
      "Julien Barrat",
      "Enrico Marchetto",
      "Alessio Miscioscia",
      "Elli Pomoni"
    ],
    "affiliations": [],
    "first_author": "Julien Barrat",
    "pdf_url": "https://arxiv.org/pdf/2411.00978v3",
    "primary_category": "hep-th",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2410.24142v5",
    "arxiv_id": "2410.24142v5",
    "title": "Quantum Groups as Global Symmetries",
    "summary": "We study quantum field theories which have quantum groups as global internal symmetries. We show that in such theories operators are generically non-local, and should be thought as living at the ends of topological lines. We describe the general constraints of the quantum group symmetry, given by Ward identities, that correlation functions of the theory should satisfy. We also show that generators of the symmetry can be represented by topological lines with some novel properties. We then discuss a particular example of $U_q(sl_2)$ symmetric CFT, which we solve using the bootstrap techniques and relying on the symmetry. We finally show strong evidence that for a special value of $q$ a subsector of this theory reproduces the fermionic formulation of the Ising model. This suggests that a quantum group can act on local operators as well, however, it generically transforms them into non-local ones.",
    "published": "2024-10-31T17:04:57Z",
    "updated": "2025-05-17T17:40:25Z",
    "authors": [
      "Barak Gabai",
      "Victor Gorbenko",
      "Jiaxin Qiao",
      "Bernardo Zan",
      "Aleksandr Zhabin"
    ],
    "affiliations": [],
    "first_author": "Barak Gabai",
    "pdf_url": "https://arxiv.org/pdf/2410.24142v5",
    "primary_category": "hep-th",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2410.14400v1",
    "arxiv_id": "2410.14400v1",
    "title": "Variable Aperture Bokeh Rendering via Customized Focal Plane Guidance",
    "summary": "Bokeh rendering is one of the most popular techniques in photography. It can make photographs visually appealing, forcing users to focus their attentions on particular area of image. However, achieving satisfactory bokeh effect usually presents significant challenge, since mobile cameras with restricted optical systems are constrained, while expensive high-end DSLR lens with large aperture should be needed. Therefore, many deep learning-based computational photography methods have been developed to mimic the bokeh effect in recent years. Nevertheless, most of these methods were limited to rendering bokeh effect in certain single aperture. There lacks user-friendly bokeh rendering method that can provide precise focal plane control and customised bokeh generation. There as well lacks authentic realistic bokeh dataset that can potentially promote bokeh learning on variable apertures. To address these two issues, in this paper, we have proposed an effective controllable bokeh rendering method, and contributed a Variable Aperture Bokeh Dataset (VABD). In the proposed method, user can customize focal plane to accurately locate concerned subjects and select target aperture information for bokeh rendering. Experimental results on public EBB! benchmark dataset and our constructed dataset VABD have demonstrated that the customized focal plane together aperture prompt can bootstrap model to simulate realistic bokeh effect. The proposed method has achieved competitive state-of-the-art performance with only 4.4M parameters, which is much lighter than mainstream computational bokeh models. The contributed dataset and source codes will be released on github https://github.com/MoTong-AI-studio/VABM.",
    "published": "2024-10-18T12:04:23Z",
    "updated": "2024-10-18T12:04:23Z",
    "authors": [
      "Kang Chen",
      "Shijun Yan",
      "Aiwen Jiang",
      "Han Li",
      "Zhifeng Wang"
    ],
    "affiliations": [],
    "first_author": "Kang Chen",
    "pdf_url": "https://arxiv.org/pdf/2410.14400v1",
    "primary_category": "cs.CV",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2410.13220v1",
    "arxiv_id": "2410.13220v1",
    "title": "Chip-scale monolithic optoelectronic voltage boost conversion",
    "summary": "Voltage conversion is a fundamental electronic process critical to engineered systems across a wide spectrum of applications and spanning many orders of magnitude in scale. Conventional approaches like transformers and charge pumps perform well in specific contexts but face fundamental limitations to miniaturization, electromagnetic interference, and voltage range. Here we present a chip-scale, fully integrated monolithic, non-switching optoelectronic voltage conversion platform capable of high gain, bootstrap-free boost-mode operation across several orders of magnitude in power density and voltage scale. Using the bidirectional coupling between LEDs and PV cells with identical active layer materials, our chip-scale, single-die strategy eliminates Stokes losses while improving key parameters like physical footprint, series resistance, and photon leakage by orders of magnitude over implementations using multiple packaged, discrete components. Moreover, by exploiting the large étendue of NIR-transparent semi-insulating InP substrates and the atomically smooth, void-free interface of lattice-matched epitaxial growth, simulations indicate that our InGaAsP architecture's photon transport simultaneously provides a > 60x increase in current density and > 50x reduction in non-radiative recombination losses compared with a multiple-die solution while simultaneously reducing fabrication complexity and improving mechanical robustness. We experimentally demonstrate a boost gain of 3.8x in an 8x8 mm$^2$ InGaAs-on-InP chip while validating key aspects of the voltage conversion platform.",
    "published": "2024-10-17T05:01:28Z",
    "updated": "2024-10-17T05:01:28Z",
    "authors": [
      "Parthiban Santhanam",
      "Daniel Cui",
      "Jae Seung Hwang",
      "David Abraham",
      "Isabella He",
      "Enzo Watanabe",
      "Aaswath Pattabhi Raman"
    ],
    "affiliations": [],
    "first_author": "Parthiban Santhanam",
    "pdf_url": "https://arxiv.org/pdf/2410.13220v1",
    "primary_category": "physics.optics",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2410.00942v1",
    "arxiv_id": "2410.00942v1",
    "title": "AR-Sieve Bootstrap for the Random Forest and a simulation-based comparison with rangerts time series prediction",
    "summary": "The Random Forest (RF) algorithm can be applied to a broad spectrum of problems, including time series prediction. However, neither the classical IID (Independent and Identically distributed) bootstrap nor block bootstrapping strategies (as implemented in rangerts) completely account for the nature of the Data Generating Process (DGP) while resampling the observations. We propose the combination of RF with a residual bootstrapping technique where we replace the IID bootstrap with the AR-Sieve Bootstrap (ARSB), which assumes the DGP to be an autoregressive process. To assess the new model's predictive performance, we conduct a simulation study using synthetic data generated from different types of DGPs. It turns out that ARSB provides more variation amongst the trees in the forest. Moreover, RF with ARSB shows greater accuracy compared to RF with other bootstrap strategies. However, these improvements are achieved at some efficiency costs.",
    "published": "2024-10-01T14:07:58Z",
    "updated": "2024-10-01T14:07:58Z",
    "authors": [
      "Cabrel Teguemne Fokam",
      "Carsten Jentsch",
      "Michel Lang",
      "Markus Pauly"
    ],
    "affiliations": [],
    "first_author": "Cabrel Teguemne Fokam",
    "pdf_url": "https://arxiv.org/pdf/2410.00942v1",
    "primary_category": "stat.ML",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2409.09787v4",
    "arxiv_id": "2409.09787v4",
    "title": "BNEM: A Boltzmann Sampler Based on Bootstrapped Noised Energy Matching",
    "summary": "Developing an efficient sampler capable of generating independent and identically distributed (IID) samples from a Boltzmann distribution is a crucial challenge in scientific research, e.g. molecular dynamics. In this work, we intend to learn neural samplers given energy functions instead of data sampled from the Boltzmann distribution. By learning the energies of the noised data, we propose a diffusion-based sampler, Noised Energy Matching, which theoretically has lower variance and more complexity compared to related works. Furthermore, a novel bootstrapping technique is applied to NEM to balance between bias and variance. We evaluate NEM and BNEM on a 2-dimensional 40 Gaussian Mixture Model (GMM) and a 4-particle double-well potential (DW-4). The experimental results demonstrate that BNEM can achieve state-of-the-art performance while being more robust.",
    "published": "2024-09-15T16:41:30Z",
    "updated": "2025-05-12T16:54:02Z",
    "authors": [
      "RuiKang OuYang",
      "Bo Qiang",
      "José Miguel Hernández-Lobato"
    ],
    "affiliations": [],
    "first_author": "RuiKang OuYang",
    "pdf_url": "https://arxiv.org/pdf/2409.09787v4",
    "primary_category": "cs.LG",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2408.05420v1",
    "arxiv_id": "2408.05420v1",
    "title": "Facilitating bootstrapped and rarefaction-based microbiome diversity analysis with q2-boots",
    "summary": "Background: We present q2-boots, a QIIME 2 plugin that facilitates bootstrapped and rarefaction-based microbiome diversity analysis. This plugin provides eight new actions that allow users to apply any of thirty different alpha diversity metrics and twenty-two beta diversity metrics to bootstrapped or rarefied feature tables, using a single QIIME 2 Pipeline command, or more granular QIIME 2 Action commands.   Results: Given a feature table, an even sampling depth, and the number of iterations to perform (n), the command qiime boots core-metrics will resample the feature table n times and compute alpha and beta diversity metrics on each resampled table. The results will be integrated in summary data artifacts that are identical in structure and type to results that would be generated by applying diversity metrics to a single table. This enables all of the same downstream analytic tools to be applied to these tables, and ensures that all collected data is considered when computing microbiome diversity metrics.   Conclusions: A challenge of this work was deciding how to integrate distance matrices that were computed on n resampled feature tables, as a simple average of pairwise distances (median or mean) does not account for the structure of distance matrices. q2-boots provides three options, and we show here that the results of these approaches are highly correlated. q2-boots is free and open source. Source code, installation instructions, and a tutorial can be found at https://github.com/caporaso-lab/q2-boots.",
    "published": "2024-08-10T03:12:15Z",
    "updated": "2024-08-10T03:12:15Z",
    "authors": [
      "Isaiah Raspet",
      "Elizabeth Gehret",
      "Chloe Herman",
      "Jeff Meilander",
      "Andrew Manley",
      "Anthony Simard",
      "Evan Bolyen",
      "J. Gregory Caporaso"
    ],
    "affiliations": [],
    "first_author": "Isaiah Raspet",
    "pdf_url": "https://arxiv.org/pdf/2408.05420v1",
    "primary_category": "q-bio.QM",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2407.13967v2",
    "arxiv_id": "2407.13967v2",
    "title": "On gauge amplitudes first appearing at two loops",
    "summary": "We study scattering amplitudes in massless non-abelian gauge theory where all outgoing gluons have positive helicity. It has been argued recently by Costello that for a particular fermion representation (8 fundamentals plus one antisymmetric-tensor representation in $SU(N)$) the one-loop amplitudes vanish identically. We show that this vanishing leads to previously-observed identities among one-loop color-ordered partial amplitudes. We then turn to two loops, where Costello has computed the all-plus amplitudes for this theory, as rational functions of the kinematics for any number of gluons using the celestial chiral algebra (CCA) bootstrap. We show that in dimensional regularization, these two-loop amplitudes are not rational, and they are not even finite as $ε\\to0$. However, the finite remainder for four gluons agrees with the formula by Costello. In addition, we provide a mass regulator for the infrared-divergent loop integrals; with this regulator, the CCA bootstrap formula is recovered exactly. Finally, we use the CCA bootstrap to compute the double-trace terms in the theory at two loops for an arbitrary number of gluons.",
    "published": "2024-07-19T01:25:07Z",
    "updated": "2025-05-29T20:09:26Z",
    "authors": [
      "Lance J. Dixon",
      "Anthony Morales"
    ],
    "affiliations": [],
    "first_author": "Lance J. Dixon",
    "pdf_url": "https://arxiv.org/pdf/2407.13967v2",
    "primary_category": "hep-th",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2407.09080v2",
    "arxiv_id": "2407.09080v2",
    "title": "The CFT of SLE loop measures and the Kontsevich--Suhov conjecture",
    "summary": "This paper initiates the study of the conformal field theory of the SLE$_κ$ loop measure $ν$ for $κ\\in(0,4]$, the range where the loop is almost surely simple. First, we construct two commuting representations $(\\mathbf{L}_n,\\bar{\\mathbf{L}}_n)_{n\\in\\mathbb{Z}}$ of the Virasoro algebra with central charge $c_\\mathrm{M}=1-6(\\frac{2}{\\sqrtκ}-\\frac{\\sqrtκ}{2})^2\\leq1$ as (unbounded) first order differential operators on $L^2(ν)$. Second, we introduce highest-weight representations and characterise their structure: in particular, we prove the existence of vanishing singular vectors at arbitrary levels on the Kac table. Third, we prove an integration by parts formula for the SLE loop measure, and use it to define the Shapovalov form of the representation, a non degenerate (but \\emph{not} positive definite) Hermitian form $\\mathcal{Q}$ on $L^2(ν)$ with a remarkably simple geometric expression. The fact that $\\mathcal{Q}$ differs from the $L^2(ν)$-inner product is a manifestation of non-unitarity. Finally, we write down a spectral resolution of $\\mathcal{Q}$ using the joint diagonalisation of $\\mathbf{L}_0$ and $\\bar{\\mathbf{L}}_0$. As an application of these results, we provide the first proof of the uniqueness of restriction measures, as conjectured by Kontsevich and Suhov.   Our results lay the groundwork for an in-depth study of the CFT of SLE: in forthcoming works, we will define correlation functions on Riemann surfaces, and prove conformal Ward identities, BPZ equations, and conformal bootstrap formulas.",
    "published": "2024-07-12T08:09:51Z",
    "updated": "2024-09-25T13:58:36Z",
    "authors": [
      "Guillaume Baverez",
      "Antoine Jego"
    ],
    "affiliations": [],
    "first_author": "Guillaume Baverez",
    "pdf_url": "https://arxiv.org/pdf/2407.09080v2",
    "primary_category": "math.PR",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2405.18379v3",
    "arxiv_id": "2405.18379v3",
    "title": "A Note on the Prediction-Powered Bootstrap",
    "summary": "We introduce PPBoot: a bootstrap-based method for prediction-powered inference. PPBoot is applicable to arbitrary estimation problems and is very simple to implement, essentially only requiring one application of the bootstrap. Through a series of examples, we demonstrate that PPBoot often performs nearly identically to (and sometimes better than) the earlier PPI(++) method based on asymptotic normality$\\unicode{x2013}$when the latter is applicable$\\unicode{x2013}$without requiring any asymptotic characterizations. Given its versatility, PPBoot could simplify and expand the scope of application of prediction-powered inference to problems where central limit theorems are hard to prove.",
    "published": "2024-05-28T17:22:15Z",
    "updated": "2025-01-24T18:56:42Z",
    "authors": [
      "Tijana Zrnic"
    ],
    "affiliations": [],
    "first_author": "Tijana Zrnic",
    "pdf_url": "https://arxiv.org/pdf/2405.18379v3",
    "primary_category": "stat.ML",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2405.10862v1",
    "arxiv_id": "2405.10862v1",
    "title": "A note on integrated correlators with a Wilson line in $\\mathcal{N}=4$ SYM",
    "summary": "We revisit the analysis of the integrated 2-point functions of local operators with a $\\frac{1}{2}$-BPS Wilson line in $\\mathcal{N}=4$ SYM. After including suitable parity-odd terms in the parametrization of the defect correlators, we are able to solve the superconformal Ward identities in terms of an unconstrained function of the cross-ratios. Exploiting this general solution, we obtain a simple expression of the integration measure for the integrated correlators with a Wilson line. We test our result by integrating the available bootstrap expression of the unintegrated correlator at strong coupling against the predictions of supersymmetric localization, finding perfect agreement.",
    "published": "2024-05-17T15:48:32Z",
    "updated": "2024-05-17T15:48:32Z",
    "authors": [
      "M. Billò",
      "M. Frau",
      "F. Galvagno",
      "A. Lerda"
    ],
    "affiliations": [],
    "first_author": "M. Billò",
    "pdf_url": "https://arxiv.org/pdf/2405.10862v1",
    "primary_category": "hep-th",
    "relevance_score": 7.0
  }
]