{
  "search_date": "2025-12-11 11:49:03.721517",
  "total_papers": 250,
  "papers_by_year": {
    "2025": 250,
    "2024": 0
  },
  "papers_by_category": {
    "traffic_routing": 50,
    "deployment_patterns": 50,
    "disaster_recovery": 50,
    "consistency_models": 50,
    "replication": 50
  },
  "us_institution_count": 14,
  "papers": [
    {
      "title": "The CHASM-SWPC Dataset for Coronal Hole Detection & Analysis",
      "arxiv_id": "2511.14044v1",
      "published": "2025-11-18 01:51:13+00:00",
      "year": 2025,
      "authors": "Cutter Beck, Evan Smith, Khagendra Katuwal, Rudra Kafle, Jacob Whitehill",
      "summary": "Coronal holes (CHs) are low-activity, low-density solar coronal regions with open magnetic field lines (Cranmer 2009). In the extreme ultraviolet (EUV) spectrum, CHs appear as dark patches. Using daily hand-drawn maps from the Space Weather Prediction Center (SWPC), we developed a semi-automated pipeline to digitize the SWPC maps into binary segmentation masks. The resulting masks constitute the CHASM-SWPC dataset, a high-quality dataset to train and test automated CH detection models, which is ...",
      "pdf_url": "https://arxiv.org/pdf/2511.14044v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": true
    },
    {
      "title": "Autonomous X-ray Fluorescence Mapping of Chemically Heterogeneous Systems via a Correlative Feature Detection Framework",
      "arxiv_id": "2511.09975v1",
      "published": "2025-11-13 05:12:46+00:00",
      "year": 2025,
      "authors": "Carlos Deleon, Dmitri Gavrilov, Peggy ODay, Ajith Pattammattel",
      "summary": "We present X-AutoMap, a modular framework for autonomous X-ray fluorescence (XRF) mapping that enables chemically informed targeting of regions of interest through a correlative feature detection strategy. The system integrates classical computer vision and rule-based logic to identify features based on spatial relationships across multiple elemental maps, rather than relying solely on intensity or morphology. Tight integration with the Bluesky control infrastructure at the NSLS-II Hard X-ray Na...",
      "pdf_url": "https://arxiv.org/pdf/2511.09975v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": true
    },
    {
      "title": "GraspView: Active Perception Scoring and Best-View Optimization for Robotic Grasping in Cluttered Environments",
      "arxiv_id": "2511.04199v1",
      "published": "2025-11-06 09:00:27+00:00",
      "year": 2025,
      "authors": "Shenglin Wang, Mingtong Dai, Jingxuan Su, Lingbo Liu, Chunjie Chen, Xinyu Wu, Liang Lin",
      "summary": "Robotic grasping is a fundamental capability for autonomous manipulation, yet remains highly challenging in cluttered environments where occlusion, poor perception quality, and inconsistent 3D reconstructions often lead to unstable or failed grasps. Conventional pipelines have widely relied on RGB-D cameras to provide geometric information, which fail on transparent or glossy objects and degrade at close range. We present GraspView, an RGB-only robotic grasping pipeline that achieves accurate ma...",
      "pdf_url": "https://arxiv.org/pdf/2511.04199v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": true
    },
    {
      "title": "ReViSE: Towards Reason-Informed Video Editing in Unified Models with Self-Reflective Learning",
      "arxiv_id": "2512.09924v1",
      "published": "2025-12-10 18:57:09+00:00",
      "year": 2025,
      "authors": "Xinyu Liu, Hangjie Yuan, Yujie Wei, Jiazheng Xing, Yujin Han, Jiahao Pan, Yanbiao Ma, Chi-Min Chan, Kang Zhao, Shiwei Zhang, Wenhan Luo, Yike Guo",
      "summary": "Video unified models exhibit strong capabilities in understanding and generation, yet they struggle with reason-informed visual editing even when equipped with powerful internal vision-language models (VLMs). We attribute this gap to two factors: 1) existing datasets are inadequate for training and evaluating reasoning-aware video editing, and 2) an inherent disconnect between the models' reasoning and editing capabilities, which prevents the rich understanding from effectively instructing the e...",
      "pdf_url": "https://arxiv.org/pdf/2512.09924v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": true
    },
    {
      "title": "Quantum error correction via purification using a single auxiliary",
      "arxiv_id": "2512.09745v1",
      "published": "2025-12-10 15:23:03+00:00",
      "year": 2025,
      "authors": "Chandrima B. Pushpan, Tanoy Kanti Konar, Aditi Sen De, Amit Kumar Pal",
      "summary": "We propose a single auxiliary-assisted purification-based framework for quantum error correction, capable of correcting errors that drive a system from its ground-state subspace into excited-state sectors. The protocol consists of a joint time evolution of the system-auxiliary duo under a specially engineered interaction Hamiltonian, followed by a single measurement of the auxiliary in its energy eigenbasis and a subsequent post-selection of one of the measurement outcomes. We show that the resu...",
      "pdf_url": "https://arxiv.org/pdf/2512.09745v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": true
    },
    {
      "title": "Scaling Wideband Massive MIMO Radar via Tiled Beamspace Processing",
      "arxiv_id": "2512.06536v1",
      "published": "2025-12-06 19:04:21+00:00",
      "year": 2025,
      "authors": "Oveys Delafrooz Noroozi, Jiyoon Han, Wei Tang, Zhengya Zhang, Upamanyu Madhow",
      "summary": "We present a coordinated tiled architecture for scalable wideband digital beamforming in massive MIMO radar systems. As aperture size increases, conventional full-array MVDR processing becomes prohibitive due to the cubic complexity of covariance estimation and inversion. Building on the principle of energy concentration in beamspace, we introduce a tiled windowed-beamspace MVDR framework that distributes spatial FFT processing across subarrays while performing joint beamforming in a compact glo...",
      "pdf_url": "https://arxiv.org/pdf/2512.06536v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": true
    },
    {
      "title": "ALMA-QUARKS: Few-Thousand-Year Hatching out of \"Egg\": The Supersonic Breakout of a Hypercompact H II Region from Its Parental Hot Core",
      "arxiv_id": "2512.04744v1",
      "published": "2025-12-04 12:30:42+00:00",
      "year": 2025,
      "authors": "Siju Zhang, Guido Garay, Fengwei Xu, Luis F. Rodríguez, Neal J. Evans, Annie Zavagno, Paul F. Goldsmith, Dongting Yang, Xunchuan Liu, Aiyuan Yang, Tie Liu, Amelia M. Stutz, Hong-Li Liu, Wenyu Jiao, Anandmayee Tej, Lei Zhu, Kee-Tae Kim, Pablo García, Thomas Peters, Thomas Möller, Shanghuo Li, Leonardo Bronfman",
      "summary": "The kinematic evolution of hypercompact H II (HC H II) regions around young high-mass stars remains poorly understood due to complex interactions with parental environs. We present ALMA QUARKS/ATOMS 1.3 mm/3 mm observations (the highest resolution $\\sim0.01$ pc) of a deeply embedded HC H II region (diameter $\\sim0.015$ pc, electron density $\\sim2\\times10^{5}$ cm$^{-3}$) exhibiting a striking $\\gtrsim20$ km s$^{-1}$ global redshift seen in optically thin H30$α$/H40$α$ recombination lines relative...",
      "pdf_url": "https://arxiv.org/pdf/2512.04744v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": true
    },
    {
      "title": "CFLight: Enhancing Safety with Traffic Signal Control through Counterfactual Learning",
      "arxiv_id": "2512.09368v1",
      "published": "2025-12-10 06:59:46+00:00",
      "year": 2025,
      "authors": "Mingyuan Li, Chunyu Liu, Zhuojun Li, Xiao Liu, Guangsheng Yu, Bo Du, Jun Shen, Qiang Wu",
      "summary": "Traffic accidents result in millions of injuries and fatalities globally, with a significant number occurring at intersections each year. Traffic Signal Control (TSC) is an effective strategy for enhancing safety at these urban junctures. Despite the growing popularity of Reinforcement Learning (RL) methods in optimizing TSC, these methods often prioritize driving efficiency over safety, thus failing to address the critical balance between these two aspects. Additionally, these methods usually n...",
      "pdf_url": "https://arxiv.org/pdf/2512.09368v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": true
    },
    {
      "title": "TokenScale: Timely and Accurate Autoscaling for Disaggregated LLM Serving with Token Velocity",
      "arxiv_id": "2512.03416v1",
      "published": "2025-12-03 03:45:32+00:00",
      "year": 2025,
      "authors": "Ruiqi Lai, Hongrui Liu, Chengzhi Lu, Zonghao Liu, Siyu Cao, Siyang Shao, Yixin Zhang, Luo Mai, Dmitrii Ustiugov",
      "summary": "The architectural shift to prefill/decode (PD) disaggregation in LLM serving improves resource utilization but struggles with the bursty nature of modern workloads. Existing autoscaling policies, often retrofitted from monolithic systems like those in AIBrix and DistServe, rely on lagging indicators such as GPU utilization or coarse-grained request counts. This results in slow reactions to load spikes, leading to significant Time-to First-Token (TTFT) and Time-Per-Output-Token (TPOT) SLO violati...",
      "pdf_url": "https://arxiv.org/pdf/2512.03416v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": true
    },
    {
      "title": "Chart2Code-MoLA: Efficient Multi-Modal Code Generation via Adaptive Expert Routing",
      "arxiv_id": "2511.23321v1",
      "published": "2025-11-28 16:23:04+00:00",
      "year": 2025,
      "authors": "Yifei Wang, Jacky Keung, Zhenyu Mao, Jingyu Zhang, Yuchen Cao",
      "summary": "Chart-to-code generation is a critical task in automated data visualization, translating complex chart structures into executable programs. While recent Multi-modal Large Language Models (MLLMs) improve chart representation, existing approaches still struggle to achieve cross-type generalization, memory efficiency, and modular design. To address these challenges, this paper proposes C2C-MoLA, a multimodal framework that synergizes Mixture of Experts (MoE) with Low-Rank Adaptation (LoRA). The MoE...",
      "pdf_url": "https://arxiv.org/pdf/2511.23321v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": true
    },
    {
      "title": "On-the-fly Feedback SfM: Online Explore-and-Exploit UAV Photogrammetry with Incremental Mesh Quality-Aware Indicator and Predictive Path Planning",
      "arxiv_id": "2512.02375v1",
      "published": "2025-12-02 03:32:02+00:00",
      "year": 2025,
      "authors": "Liyuan Lou, Wanyun Li, Wentian Gan, Yifei Yu, Tengfei Wang, Xin Wang, Zongqian Zhan",
      "summary": "Compared with conventional offline UAV photogrammetry, real-time UAV photogrammetry is essential for time-critical geospatial applications such as disaster response and active digital-twin maintenance. However, most existing methods focus on processing captured images or sequential frames in real time, without explicitly evaluating the quality of the on-the-go 3D reconstruction or providing guided feedback to enhance image acquisition in the target area. This work presents On-the-fly Feedback Sf...",
      "pdf_url": "https://arxiv.org/pdf/2512.02375v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": true
    },
    {
      "title": "Super-resolved reconstruction of single-photon emitter locations from $g^{(2)}(0)$ maps",
      "arxiv_id": "2511.01279v1",
      "published": "2025-11-03 06:54:43+00:00",
      "year": 2025,
      "authors": "Sonali Gupta, Amit Kumar, Vikas S Bhat, Sushil Mujumdar",
      "summary": "Single-photon sources are vital for emerging quantum technologies. In particular, Nitrogen-vacancy (NV) centers in diamond are promising due to their room-temperature stability, long spin coherence, and compatibility with nanophotonic structures. A key challenge, however, is the reliable identification of isolated NV centers, since conventional confocal microscopy is diffraction-limited and cannot resolve emitter distributions within a focal spot. Besides, the associated intensity scanning is a ...",
      "pdf_url": "https://arxiv.org/pdf/2511.01279v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": true
    },
    {
      "title": "RESample: A Robust Data Augmentation Framework via Exploratory Sampling for Robotic Manipulation",
      "arxiv_id": "2510.17640v2",
      "published": "2025-10-20 15:21:12+00:00",
      "year": 2025,
      "authors": "Yuquan Xue, Guanxing Lu, Zhenyu Wu, Chuanrui Zhang, Bofang Jia, Zhengyi Gu, Yansong Tang, Ziwei Wang",
      "summary": "Vision-Language-Action models (VLAs) have demonstrated remarkable performance on complex robotic manipulation tasks through imitation learning. However, existing imitation learning datasets contain only successful trajectories and lack failure or recovery data, especially for out-of-distribution (OOD) states where the robot deviates from the main policy due to minor perturbations or errors, leading VLA models to struggle with states deviating from the training distribution. To this end, we propo...",
      "pdf_url": "https://arxiv.org/pdf/2510.17640v2",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": true
    },
    {
      "title": "Worlds Next Door: A Candidate Giant Planet Imaged in the Habitable Zone of $α$ Cen A. II. Binary Star Modeling, Planet and Exozodi Search, and Sensitivity Analysis",
      "arxiv_id": "2508.03812v1",
      "published": "2025-08-05 18:01:24+00:00",
      "year": 2025,
      "authors": "Aniket Sanghi, Charles Beichman, Dimitri Mawet, William O. Balmer, Nicolas Godoy, Laurent Pueyo, Anthony Boccaletti, Max Sommer, Alexis Bidot, Elodie Choquet, Pierre Kervella, Pierre-Olivier Lagage, Jarron Leisenring, Jorge Llop-Sayson, Michael Ressler, Kevin Wagner, Mark Wyatt",
      "summary": "JWST observed our closest solar twin, $α$ Cen A, with the MIRI coronagraph in F1550C (15.5 $μ$m) at three distinct epochs between August 2024 and April 2025. For the first time with JWST, we demonstrate the application of reference star differential imaging to simultaneously subtract the coronagraphic image of a primary star and the point spread function (PSF) of its binary companion to conduct a deep search for exoplanets and dust emission. We achieve a typical 5$σ$ point source contrast sensit...",
      "pdf_url": "https://arxiv.org/pdf/2508.03812v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": true
    },
    {
      "title": "Investigating ionising sources and the complex interstellar medium of GHZ2 at $z=12.3$",
      "arxiv_id": "2512.08490v1",
      "published": "2025-12-09 11:09:50+00:00",
      "year": 2025,
      "authors": "M. Castellano, L. Napolitano, B. Moreschini, A. Calabrò, L. Christensen, M. Llerena, T. J. L. C. Bakx, F. Belfiore, D. Bevacqua, M. Dickinson, A. Fontana, G. Gandolfi, T. Gasparetto, A. Marconi, S. Mascia, E. Merlin, T. Morishita, T. Nanayakkara, D. Paris, L. Pentericci, B. Pérez-Díaz, G. Roberts-Borsani, S. Rojas Ruiz, P. Santini, T. Treu, E. Vanzella, B. Vulcani, X. Wang, I. Yoon, J. Zavala",
      "summary": "An accurate characterisation of the physical properties of galaxies at cosmic dawn is key to understanding the origin of the high abundance of UV-bright galaxies at z$\\gtrsim$10. We exploit deep NIRSpec PRISM observations of GHZ2 to constrain the sources of ionising radiation and the properties of the ISM in this bright, compact, and highly ionising galaxy at z=12.3. We measure with high significance the prominent N IV, C IV, He II, O III, C III, O II, and Ne III emission features previously det...",
      "pdf_url": "https://arxiv.org/pdf/2512.08490v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Extremely energetic EUV late phase of a pair of C-class flares caused by a non-eruptive sigmoid",
      "arxiv_id": "2512.08324v1",
      "published": "2025-12-09 07:36:17+00:00",
      "year": 2025,
      "authors": "Ya Wang, Sargam M. Mulay, Lyndsay Fletcher",
      "summary": "The EUV late phase is the second increase of the irradiance of the warm coronal lines during solar flares, and has a crucial impact on the Earth's ionosphere. In this paper, we report on the extremely energetic EUV late phase of a pair of C-class flares (SOL2012-06-17T17:26:11) observed on 2012 June 17 in NOAA active region 11504 by the \\textit{Atmospheric Imaging Assembly} (AIA) instrument on board the \\textit{Solar Dynamics Observatory} (SDO). The light curves integrated over the flaring regio...",
      "pdf_url": "https://arxiv.org/pdf/2512.08324v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Residual-SwinCA-Net: A Channel-Aware Integrated Residual CNN-Swin Transformer for Malignant Lesion Segmentation in BUSI",
      "arxiv_id": "2512.08243v1",
      "published": "2025-12-09 04:52:30+00:00",
      "year": 2025,
      "authors": "Saeeda Naz, Saddam Hussain Khan",
      "summary": "A novel deep hybrid Residual-SwinCA-Net segmentation framework is proposed in the study for addressing such challenges by extracting locally correlated and robust features, incorporating residual CNN modules. Furthermore, for learning global dependencies, Swin Transformer blocks are customized using internal residual pathways, which reinforce gradient stability, refine local patterns, and facilitate global feature fusion. Formerly, for enhancing tissue continuity, ultrasound noise suppressions, ...",
      "pdf_url": "https://arxiv.org/pdf/2512.08243v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Debiasing Diffusion Priors via 3D Attention for Consistent Gaussian Splatting",
      "arxiv_id": "2512.07345v1",
      "published": "2025-12-08 09:33:39+00:00",
      "year": 2025,
      "authors": "Shilong Jin, Haoran Duan, Litao Hua, Wentao Huang, Yuan Zhou",
      "summary": "Versatile 3D tasks (e.g., generation or editing) that distill from Text-to-Image (T2I) diffusion models have attracted significant research interest for not relying on extensive 3D training data. However, T2I models exhibit limitations resulting from prior view bias, which produces conflicting appearances between different views of an object. This bias causes subject-words to preferentially activate prior view features during cross-attention (CA) computation, regardless of the target view condit...",
      "pdf_url": "https://arxiv.org/pdf/2512.07345v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "A Chunked-Object Pattern for Multi-Region Large Payload Storage in Managed NoSQL Databases",
      "arxiv_id": "2512.06852v1",
      "published": "2025-12-07 14:06:09+00:00",
      "year": 2025,
      "authors": "Manideep Reddy Chinthareddy",
      "summary": "Many managed key-value and NoSQL databases - such as Amazon DynamoDB, Azure Cosmos DB, and Google Cloud Firestore - enforce strict maximum item sizes (e.g., 400 KB in DynamoDB). This constraint imposes significant architectural challenges for applications requiring low-latency, multi-region access to objects that exceed these limits. The standard industry recommendation is to offload payloads to object storage (e.g., Amazon S3) while retaining a pointer in the database. While cost-efficient, thi...",
      "pdf_url": "https://arxiv.org/pdf/2512.06852v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "The Ratan Active Region Patches (RARPs) Database: A New Database of Solar Active Region Radio Signatures from the RATAN-600 Telescope",
      "arxiv_id": "2512.05702v1",
      "published": "2025-12-05 13:30:02+00:00",
      "year": 2025,
      "authors": "Maxim Korelov, Irina Knyazeva, Evgenii Kurochkin, Nikolay Makarenko, Denis Derkach",
      "summary": "Solar flares and coronal mass ejections, originating from solar active regions (ARs), are the primary drivers of space weather and can disrupt technological systems. Forecasting efforts heavily rely on photospheric magnetic field data from the Space-weather HMI Active Region Patch (SHARPs) data products. However, the crucial energy release occurs higher in the solar corona. Radio observations from instruments like the RATAN-600 telescope directly probe this region, but their scientific use has b...",
      "pdf_url": "https://arxiv.org/pdf/2512.05702v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Design and Performance of a 96-channel Resistive Micromegas Detector for ENUBET",
      "arxiv_id": "2512.05589v1",
      "published": "2025-12-05 10:23:46+00:00",
      "year": 2025,
      "authors": "A. Kallitsopoulou, S. Aune, Y. Angelis, R. Aleksan, A. Bonenfant, J. Bortfeldt, F. Brunbauer, M. Brunoldi, J. Datta, D. Desforge, G. Fanourakis, D. Fiorina, K. J. Floethner, M. Gallinaro, F. Garcia, I. Giomataris, K. Gnanvo, F. J. Iguaz, D. Janssens, F. Jeanneau, M. Kebbiri, M. Kovacic, B. Kross, P. Legou, M. Lisowska, J. Liu, C. Loiseau, M. Lupberger, I. Maniatis, J. McKisson, B. Moreno, Y. Meng, H. Muller, E. Oliveri, G. Orlandini, A. Pandey, T. Papaevangelou, M. Pomorski, E. F. Ribas, L. Ropelewski, D. Sampsonidis, L. Scharenberg, T. Schneider, E. Scorsone, L. Sohl, M. van Stenis, Y. Tsipolitis, S. E. Tzamarias, A. Utrobicic, I. Vai, R. Veenhof, P. Vitulo, X. Wang, S. White, W. Xi, Z. Zhang, Y. Zhou",
      "summary": "The PICOSEC-Micromegas (PICOSEC-MM) detector is a fast gaseous detector that achieves picosecond-level timing by coupling a Cherenkov radiator, typically an MgF2 crystal, to a Micromegas-based photodetector with a photocathode. This configuration allows the fast photoelectron-induced signal to suppress the intrinsic time jitter of gaseous detectors, enabling sub-20 ps timing precision while preserving the robustness and scalability of micro-pattern gaseous detector technologies. The 96-pad PICOS...",
      "pdf_url": "https://arxiv.org/pdf/2512.05589v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "MedDIFT: Multi-Scale Diffusion-Based Correspondence in 3D Medical Imaging",
      "arxiv_id": "2512.05571v1",
      "published": "2025-12-05 09:53:07+00:00",
      "year": 2025,
      "authors": "Xingyu Zhang, Anna Reithmeir, Fryderyk Kögl, Rickmer Braren, Julia A. Schnabel, Daniel M. Lang",
      "summary": "Accurate spatial correspondence between medical images is essential for longitudinal analysis, lesion tracking, and image-guided interventions. Medical image registration methods rely on local intensity-based similarity measures, which fail to capture global semantic structure and often yield mismatches in low-contrast or anatomically variable regions. Recent advances in diffusion models suggest that their intermediate representations encode rich geometric and semantic information. We present Me...",
      "pdf_url": "https://arxiv.org/pdf/2512.05571v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "CookAnything: A Framework for Flexible and Consistent Multi-Step Recipe Image Generation",
      "arxiv_id": "2512.03540v2",
      "published": "2025-12-03 08:01:48+00:00",
      "year": 2025,
      "authors": "Ruoxuan Zhang, Bin Wen, Hongxia Xie, Yi Yao, Songhan Zuo, Jian-Yu Jiang-Lin, Hong-Han Shuai, Wen-Huang Cheng",
      "summary": "Cooking is a sequential and visually grounded activity, where each step such as chopping, mixing, or frying carries both procedural logic and visual semantics. While recent diffusion models have shown strong capabilities in text-to-image generation, they struggle to handle structured multi-step scenarios like recipe illustration. Additionally, current recipe illustration methods are unable to adjust to the natural variability in recipe length, generating a fixed number of images regardless of th...",
      "pdf_url": "https://arxiv.org/pdf/2512.03540v2",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Hear What Matters! Text-conditioned Selective Video-to-Audio Generation",
      "arxiv_id": "2512.02650v1",
      "published": "2025-12-02 11:12:16+00:00",
      "year": 2025,
      "authors": "Junwon Lee, Juhan Nam, Jiyoung Lee",
      "summary": "This work introduces a new task, text-conditioned selective video-to-audio (V2A) generation, which produces only the user-intended sound from a multi-object video. This capability is especially crucial in multimedia production, where audio tracks are handled individually for each sound source for precise editing, mixing, and creative control. However, current approaches generate single source-mixed sounds at once, largely because visual features are entangled, and region cues or prompts often fa...",
      "pdf_url": "https://arxiv.org/pdf/2512.02650v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Vision to Geometry: 3D Spatial Memory for Sequential Embodied MLLM Reasoning and Exploration",
      "arxiv_id": "2512.02458v1",
      "published": "2025-12-02 06:35:30+00:00",
      "year": 2025,
      "authors": "Zhongyi Cai, Yi Du, Chen Wang, Yu Kong",
      "summary": "Existing research on indoor embodied tasks typically requires agents to actively explore unknown environments and reason about the scene to achieve a specific goal. However, when deployed in real life, agents often face sequential tasks, where each new sub-task follows the completion of the previous one, and certain sub-tasks may be infeasible, such as searching for a non-existent object. Compared with the single-task setting, the core challenge lies in reusing spatial knowledge accumulated from...",
      "pdf_url": "https://arxiv.org/pdf/2512.02458v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "A multi-weight self-matching visual explanation for cnns on sar images",
      "arxiv_id": "2512.02344v1",
      "published": "2025-12-02 02:31:34+00:00",
      "year": 2025,
      "authors": "Siyuan Sun, Yongping Zhang, Hongcheng Zeng, Yamin Wang, Wei Yang, Wanting Yang, Jie Chen",
      "summary": "In recent years, convolutional neural networks (CNNs) have achieved significant success in various synthetic aperture radar (SAR) tasks. However, the complexity and opacity of their internal mechanisms hinder the fulfillment of high-reliability requirements, thereby limiting their application in SAR. Improving the interpretability of CNNs is thus of great importance for their development and deployment in SAR. In this paper, a visual explanation method termed multi-weight self-matching class act...",
      "pdf_url": "https://arxiv.org/pdf/2512.02344v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Kinematics of young stellar objects in NGC 2024 based on infrared proper motions",
      "arxiv_id": "2512.02124v1",
      "published": "2025-12-01 19:00:05+00:00",
      "year": 2025,
      "authors": "Alena Rottensteiner, Monika G. Petr-Gotzens, Stefan Meingast, João Alves, Emmanuel Bertin, Hervé Bouy, Martin Piecka, Sebastian Ratzenböck, Andrea Socci",
      "summary": "The most recently formed young stellar objects (YSOs) in active star forming regions are excellent tracers of their parent cloud motion. Their positions and dynamics provide insight into cluster formation and constrain kinematic decoupling timescales between stars and gas. However, because of their strong extinction and young age, embedded YSOs are mainly visible at infrared wavelengths and thus absent from astrometric surveys such as Gaia. We measured the proper motions of 6,769 sources toward ...",
      "pdf_url": "https://arxiv.org/pdf/2512.02124v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "SSR: Semantic and Spatial Rectification for CLIP-based Weakly Supervised Segmentation",
      "arxiv_id": "2512.01701v1",
      "published": "2025-12-01 14:06:50+00:00",
      "year": 2025,
      "authors": "Xiuli Bi, Die Xiao, Junchao Fan, Bin Xiao",
      "summary": "In recent years, Contrastive Language-Image Pretraining (CLIP) has been widely applied to Weakly Supervised Semantic Segmentation (WSSS) tasks due to its powerful cross-modal semantic understanding capabilities. This paper proposes a novel Semantic and Spatial Rectification (SSR) method to address the limitations of existing CLIP-based weakly supervised semantic segmentation approaches: over-activation in non-target foreground regions and background areas. Specifically, at the semantic level, th...",
      "pdf_url": "https://arxiv.org/pdf/2512.01701v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Diffusion-Based Synthesis of 3D T1w MPRAGE Images from Multi-Echo GRE with Multi-Parametric MRI Integration",
      "arxiv_id": "2512.01135v1",
      "published": "2025-11-30 23:20:13+00:00",
      "year": 2025,
      "authors": "Sizhe Fang, Deqiang Qiu",
      "summary": "Multi-echo Gradient Echo (mGRE) sequences provide valuable quantitative parametric maps, such as Quantitative Susceptibility Mapping (QSM) and transverse relaxation rate (R2*), sensitive to tissue iron and myelin. However, structural morphometry typically relies on separate T1-weighted MPRAGE acquisitions, prolonging scan times. We propose a deep learning framework to synthesize high-contrast 3D T1w MPRAGE images directly from mGRE data, streamlining neuroimaging protocols. We developed a novel ...",
      "pdf_url": "https://arxiv.org/pdf/2512.01135v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Green Bean galaxies and the fading echoes of AGN activity",
      "arxiv_id": "2512.00793v1",
      "published": "2025-11-30 09:08:02+00:00",
      "year": 2025,
      "authors": "A. Arshinova, K. Sanderson, A. Moiseev",
      "summary": "Green Bean is a rare type of galaxy which represents a short-lived phase in the life cycle of active galactic nuclei (AGN), characterised by large-scale, powerful ionised clouds in the circumgalactic medium. Recent studies demonstrate that these extended ionised structures may reflect fading signatures of past AGN activity, often manifested in the form of large-scale ionisation cones. The analysis of their observational properties provides unique constraints on AGN lifetimes, feedback mechanisms...",
      "pdf_url": "https://arxiv.org/pdf/2512.00793v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "NeuroVolve: Evolving Visual Stimuli toward Programmable Neural Objectives",
      "arxiv_id": "2512.00557v1",
      "published": "2025-11-29 16:57:59+00:00",
      "year": 2025,
      "authors": "Haomiao Chen, Keith W Jamison, Mert R. Sabuncu, Amy Kuceyeski",
      "summary": "What visual information is encoded in individual brain regions, and how do distributed patterns combine to create their neural representations? Prior work has used generative models to replicate known category selectivity in isolated regions (e.g., faces in FFA), but these approaches offer limited insight into how regions interact during complex, naturalistic vision. We introduce NeuroVolve, a generative framework that provides brain-guided image synthesis via optimization of a neural objective ...",
      "pdf_url": "https://arxiv.org/pdf/2512.00557v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Non-reciprocal interactions between condensates in chemically active mixtures",
      "arxiv_id": "2511.23425v1",
      "published": "2025-11-28 18:21:10+00:00",
      "year": 2025,
      "authors": "Jacopo Romano, Martin Kjøllesdal Johnsrud, Benoît Mahault, Ramin Golestanian",
      "summary": "We study the behaviour of catalytically active droplets in multi-component conserved mixtures affected by noise. Working in the thin interface limit, we analytically determine the state diagram of the system, characterized by multiple dynamical regimes, and verify our findings using numerical simulations. In particular, we show the emergence of a non-reciprocal, chemically-mediated interaction between the droplets, which leads to the formation of (meta-)stable clusters of droplets of different s...",
      "pdf_url": "https://arxiv.org/pdf/2511.23425v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "DEAL-300K: Diffusion-based Editing Area Localization with a 300K-Scale Dataset and Frequency-Prompted Baseline",
      "arxiv_id": "2511.23377v1",
      "published": "2025-11-28 17:22:07+00:00",
      "year": 2025,
      "authors": "Rui Zhang, Hongxia Wang, Hangqing Liu, Yang Zhou, Qiang Zeng",
      "summary": "Diffusion-based image editing has made semantic level image manipulation easy for general users, but it also enables realistic local forgeries that are hard to localize. Existing benchmarks mainly focus on the binary detection of generated images or the localization of manually edited regions and do not reflect the properties of diffusion-based edits, which often blend smoothly into the original content. We present Diffusion-Based Image Editing Area Localization Dataset (DEAL-300K), a large scal...",
      "pdf_url": "https://arxiv.org/pdf/2511.23377v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "DisCEdge: Distributed Context Management for Large Language Models at the Edge",
      "arxiv_id": "2511.22599v1",
      "published": "2025-11-27 16:27:35+00:00",
      "year": 2025,
      "authors": "Mohammadreza Malekabbasi, Minghe Wang, David Bermbach",
      "summary": "Deploying Large Language Model (LLM) services at the edge benefits latency-sensitive and privacy-aware applications. However, the stateless nature of LLMs makes managing user context (e.g., sessions, preferences) across geo-distributed edge nodes challenging. Existing solutions, such as client-side context storage, often introduce network latency and bandwidth overhead, undermining the advantages of edge deployment.\n  We propose DisCEdge, a distributed context management system that stores and r...",
      "pdf_url": "https://arxiv.org/pdf/2511.22599v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Tracing Footsteps of Similar Cities: Modeling Urban Economic Vitality with Dynamic Inter-City Graph Embeddings",
      "arxiv_id": "2511.22325v1",
      "published": "2025-11-27 10:55:11+00:00",
      "year": 2025,
      "authors": "Xiaofeng Li, Xiangyi Xiao, Xiaocong Du, Ying Zhang, Haipeng Zhang",
      "summary": "Urban economic vitality is a crucial indicator of a city's long-term growth potential, comprising key metrics such as the annual number of new companies and the population employed. However, modeling urban economic vitality remains challenging. This study develops ECO-GROW, a multi-graph framework modeling China's inter-city networks (2005-2021) to generate urban embeddings that model urban economic vitality. Traditional approaches relying on static city-level aggregates fail to capture a fundam...",
      "pdf_url": "https://arxiv.org/pdf/2511.22325v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Towards an Effective Action-Region Tracking Framework for Fine-grained Video Action Recognition",
      "arxiv_id": "2511.21202v1",
      "published": "2025-11-26 09:32:06+00:00",
      "year": 2025,
      "authors": "Baoli Sun, Yihan Wang, Xinzhu Ma, Zhihui Wang, Kun Lu, Zhiyong Wang",
      "summary": "Fine-grained action recognition (FGAR) aims to identify subtle and distinctive differences among fine-grained action categories. However, current recognition methods often capture coarse-grained motion patterns but struggle to identify subtle details in local regions evolving over time. In this work, we introduce the Action-Region Tracking (ART) framework, a novel solution leveraging a query-response mechanism to discover and track the dynamics of distinctive local details, enabling effective di...",
      "pdf_url": "https://arxiv.org/pdf/2511.21202v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Broad-band temporal and spectral study of TeV blazar TXS 0518+211",
      "arxiv_id": "2511.21182v2",
      "published": "2025-11-26 08:56:39+00:00",
      "year": 2025,
      "authors": "Avik Kumar Das, Pankaj Kushwaha, Veeresh Singh, Sandeep Kumar Mondal, Goldy Ahuja, Deekshya R. Sarkar",
      "summary": "We present a long-term broad-band temporal and spectral study of a TeV BL Lac source TXS 0518+211 by analyzing nearly 16 years (MJD 54682 -- 60670) of simultaneous optical, UV and X-ray light curves from Swift-XRT/UVOT and gamma-ray light curves from Fermi-LAT. Based on the availability of simultaneous multi-wavelength data and considering flux level as the depiction of AGN-jet activity we identified 11 epochs (named as Epoch-A to Epoch-K) and investigated temporal as well as spectral variabilit...",
      "pdf_url": "https://arxiv.org/pdf/2511.21182v2",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Tails of Gravity: Persistence of Star Formation in the CMZ Environment",
      "arxiv_id": "2511.20300v2",
      "published": "2025-11-25 13:38:09+00:00",
      "year": 2025,
      "authors": "Linjing Feng, Sihan Jiao, Fengwei Xu, Hauyu Baobab Liu, Xing Lu, Neal J. Evans, Elisabeth A. C. Mills, Attila Kovács, Qizhou Zhang, Yuxin Lin, Jingwen Wu, Chao-Wei Tsai, Di Li, Zhi-Yu Zhang, Zhiqiang Yan, Hao Ruan, Fangyuan Deng, Yuanzhen Xiong, Ruofei Zhang",
      "summary": "We characterize star-forming gas in six molecular clouds (Sgr B1-off, Sgr B2, Sgr C, the 20 km s$^{-1}$ and 50 km s$^{-1}$ molecular clouds, and the Brick) in the Galactic central molecular zone (CMZ), and compare their star-forming activities with those in molecular clouds outside the CMZ. Using multi-band continuum observations taken from ${\\it Planck}$, ${\\it Herschel}$, JCMT/SCUBA-2, and CSO/SHARC2, we derived 8.5\" resolution column density maps for the CMZ clouds and evaluated the column de...",
      "pdf_url": "https://arxiv.org/pdf/2511.20300v2",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Active3D: Active High-Fidelity 3D Reconstruction via Hierarchical Uncertainty Quantification",
      "arxiv_id": "2511.20050v1",
      "published": "2025-11-25 08:17:32+00:00",
      "year": 2025,
      "authors": "Yan Li, Yingzhao Li, Gim Hee Lee",
      "summary": "In this paper, we present an active exploration framework for high-fidelity 3D reconstruction that incrementally builds a multi-level uncertainty space and selects next-best-views through an uncertainty-driven motion planner. We introduce a hybrid implicit-explicit representation that fuses neural fields with Gaussian primitives to jointly capture global structural priors and locally observed details. Based on this hybrid state, we derive a hierarchical uncertainty volume that quantifies both im...",
      "pdf_url": "https://arxiv.org/pdf/2511.20050v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "SAMBA: Toward a Long-Context EEG Foundation Model via Spatial Embedding and Differential Mamba",
      "arxiv_id": "2511.18571v1",
      "published": "2025-11-23 18:31:18+00:00",
      "year": 2025,
      "authors": "Jiazhen Hong, Geoffrey Mackellar, Soheila Ghane",
      "summary": "Long-sequence electroencephalogram (EEG) modeling is essential for developing generalizable EEG representation models. This need arises from the high sampling rate of EEG data and the long recording durations required to capture extended neurological patterns in brain activity. Transformer-based models have shown promise in modeling short sequences of a few seconds; however, their quadratic complexity limits scalability to longer contexts. Moreover, variability in electrode montage across availa...",
      "pdf_url": "https://arxiv.org/pdf/2511.18571v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "CO Multi-line Imaging of Nearby Galaxies (COMING). XI. Azimuthally averaged star formation rate and stellar mass relation with molecular gas amount",
      "arxiv_id": "2511.16892v1",
      "published": "2025-11-21 02:16:02+00:00",
      "year": 2025,
      "authors": "Ayumi Kajikawa, Kazuo Sorai, Kana Morokuma-Matsui, Tsutomu T. Takeuchi, Dragan Salak, Nario Kuno, Kazuyuki Muraoka, Yusuke Miyamoto, Hiroyuki Kaneko, Yoshiyuki Yajima, Atsushi Yasuda, Takahiro Tanaka, Kiyoaki Christopher Omori, Kazuki Shimizu, Suphakorn Suphapolthaworn, Kyoko Hama",
      "summary": "This study investigated the relation between the surface density of star formation rate (SFR) ($Σ_{\\mathrm{SFR}}$), stellar mass ($Σ_{M_{\\ast}}$), and molecular gas mass ($Σ_{M_\\mathrm{mol}}$) on nearly 1 kpc scales averaged over concentric tilted rings using the $^{12}$CO $J=1-0$ mapping data of 92 nearby galaxies obtained in the CO Multi-line Imaging of Nearby Galaxies (COMING) project. We categorized these galaxies into three groups based on the deviation of each global SFR from the star-form...",
      "pdf_url": "https://arxiv.org/pdf/2511.16892v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Aql X-1 from dawn 'til dusk: the early rise, fast state transition and decay of its 2024 outburst",
      "arxiv_id": "2511.16437v1",
      "published": "2025-11-20 15:05:47+00:00",
      "year": 2025,
      "authors": "A. Marino, F. Coti Zelati, K. Alabarta, D. M. Russell, Y. Cavecchi, N. Rea, S. K. Rout, T. Di Salvo, J. Homan, Á. Jurado-López, L. Ji, R. Soria, T. D. Russell, Y. L. Wang, A. Anitra, M. C. Baglio, H. Feng, S. Fijma, S. Guillot, Y. F. Huang, G. Illiano, M. Imbrogno, C. Jin, F. Lewis, Y. F. Liang, M. J. Liu, R. Ma, G. Mastroserio, S. E. Motta, J. U. Ness, E. Parent, A. Patruno, P. Saikia, L. Tao, M. Veresvarska, X. P. Xu, W. Yuan, G. B. Zhang, Z. J. Zhang",
      "summary": "Transient Low-Mass X-ray Binaries (LMXBs) are usually first detected by all-sky X-ray monitors when they enter new outbursts, typically at X-ray luminosities above $\\sim$10$^{36}$ erg/s. Observations of these sources during the early rise of the outbursts have so far been very limited. However, the launch of the Einstein Probe (EP) has greatly improved our ability to detect fainter X-ray activity, unlocking access to the outburst early rise. In September 2024, EP detected the early onset of a ne...",
      "pdf_url": "https://arxiv.org/pdf/2511.16437v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Multi-Text Guided Few-Shot Semantic Segmentation",
      "arxiv_id": "2511.15515v1",
      "published": "2025-11-19 15:09:19+00:00",
      "year": 2025,
      "authors": "Qiang Jiao, Bin Yan, Yi Yang, Mengrui Shi, Qiang Zhang",
      "summary": "Recent CLIP-based few-shot semantic segmentation methods introduce class-level textual priors to assist segmentation by typically using a single prompt (e.g., a photo of class). However, these approaches often result in incomplete activation of target regions, as a single textual description cannot fully capture the semantic diversity of complex categories. Moreover, they lack explicit cross-modal interaction and are vulnerable to noisy support features, further degrading visual prior quality. T...",
      "pdf_url": "https://arxiv.org/pdf/2511.15515v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Explosions in the Empty: A Survey of Transients in Local Void Galaxies",
      "arxiv_id": "2511.15401v1",
      "published": "2025-11-19 12:56:14+00:00",
      "year": 2025,
      "authors": "Suo-Ning Wang, Bin-Bin Zhang, Rubén García Benito",
      "summary": "We present a systematic analysis of transient astrophysical events -- including supernovae (SNe), gamma-ray bursts (GRBs), and fast radio bursts (FRBs) -- in void and non-void galaxies within the local universe ($0.005 < z < 0.05$). Cosmic voids, defined by low galaxy densities and characterized by minimal environmental interactions, offer a natural laboratory for isolating the impact of large-scale underdensities on stellar evolution and transient production. Using multi-wavelength data from th...",
      "pdf_url": "https://arxiv.org/pdf/2511.15401v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "A Brain Wave Encodes a Thousand Tokens: Modeling Inter-Cortical Neural Interactions for Effective EEG-based Emotion Recognition",
      "arxiv_id": "2511.13954v1",
      "published": "2025-11-17 22:27:12+00:00",
      "year": 2025,
      "authors": "Nilay Kumar, Priyansh Bhandari, G. Maragatham",
      "summary": "Human emotions are difficult to convey through words and are often abstracted in the process; however, electroencephalogram (EEG) signals can offer a more direct lens into emotional brain activity. Recent studies show that deep learning models can process these signals to perform emotion recognition with high accuracy. However, many existing approaches overlook the dynamic interplay between distinct brain regions, which can be crucial to understanding how emotions unfold and evolve over time, po...",
      "pdf_url": "https://arxiv.org/pdf/2511.13954v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Metasurface-Enabled Superheterodyne Transmitter With Decoupled Harmonic-Free Signal Generation and Precoding",
      "arxiv_id": "2511.12469v1",
      "published": "2025-11-16 05:55:28+00:00",
      "year": 2025,
      "authors": "Xuehui Dong, Miyu Feng, Chen Shao, Bokai Lai, Jianan Zhang, Rujing Xiong, Kai Wan, Tiebin Mi, Robert Caiming Qiu",
      "summary": "The evolution of programmable metasurfaces (PM) from passive beamforming to active information transmission marks a paradigm shift for next-generation wireless systems. However, this transition is hindered by fundamental limitations in conventional metasurface transmitter architectures, including restricted modulation orders, symbol-level spatial inconsistency, and significant harmonic interference. These issues stem from the intrinsic coupling between baseband signal processing and radio-freque...",
      "pdf_url": "https://arxiv.org/pdf/2511.12469v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "The influence of AGN feedback on star formation in red spiral galaxies",
      "arxiv_id": "2511.12454v1",
      "published": "2025-11-16 04:53:41+00:00",
      "year": 2025,
      "authors": "Moreom Akter, Wayne A. Barkhouse, Sandanuwan P Kalawila Vithanage, Gihan L. Gamage, Omar López-Cruz",
      "summary": "We investigated the influence of Active Galactic Nuclei (AGN) feedback on star formation in red spiral galaxies by analyzing a sample of 324 red and 273 blue face-on spirals selected from 115 low-redshift galaxy clusters. This multi-wavelength dataset combines optical emission line data from the Sloan Digital Sky Survey with X-ray fluxes from Chandra and XMM-Newton X-ray space telescopes. Using diagnostic emission line ratios, we constructed Baldwin-Phillips-Terlevich (BPT) diagrams, introduced ...",
      "pdf_url": "https://arxiv.org/pdf/2511.12454v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Enhancing Road Safety Through Multi-Camera Image Segmentation with Post-Encroachment Time Analysis",
      "arxiv_id": "2511.12018v1",
      "published": "2025-11-15 04:06:24+00:00",
      "year": 2025,
      "authors": "Shounak Ray Chaudhuri, Arash Jahangiri, Christopher Paolini",
      "summary": "Traffic safety analysis at signalized intersections is vital for reducing vehicle and pedestrian collisions, yet traditional crash-based studies are limited by data sparsity and latency. This paper presents a novel multi-camera computer vision framework for real-time safety assessment through Post-Encroachment Time (PET) computation, demonstrated at the intersection of H Street and Broadway in Chula Vista, California. Four synchronized cameras provide continuous visual coverage, with each frame ...",
      "pdf_url": "https://arxiv.org/pdf/2511.12018v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Hi-DREAM: Brain Inspired Hierarchical Diffusion for fMRI Reconstruction via ROI Encoder and visuAl Mapping",
      "arxiv_id": "2511.11437v1",
      "published": "2025-11-14 16:05:44+00:00",
      "year": 2025,
      "authors": "Guowei Zhang, Yun Zhao, Moein Khajehnejad, Adeel Razi, Levin Kuhlmann",
      "summary": "Mapping human brain activity to natural images offers a new window into vision and cognition, yet current diffusion-based decoders face a core difficulty: most condition directly on fMRI features without analyzing how visual information is organized across the cortex. This overlooks the brain's hierarchical processing and blurs the roles of early, middle, and late visual areas. We propose Hi-DREAM, a brain-inspired conditional diffusion framework that makes the cortical organization explicit. A ...",
      "pdf_url": "https://arxiv.org/pdf/2511.11437v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Deep Learning for Short-Term Precipitation Prediction in Four Major Indian Cities: A ConvLSTM Approach with Explainable AI",
      "arxiv_id": "2511.11152v1",
      "published": "2025-11-14 10:30:01+00:00",
      "year": 2025,
      "authors": "Tanmay Ghosh, Shaurabh Anand, Rakesh Gomaji Nannewar, Nithin Nagaraj",
      "summary": "Deep learning models for precipitation forecasting often function as black boxes, limiting their adoption in real-world weather prediction. To enhance transparency while maintaining accuracy, we developed an interpretable deep learning framework for short-term precipitation prediction in four major Indian cities: Bengaluru, Mumbai, Delhi, and Kolkata, spanning diverse climate zones. We implemented a hybrid Time-Distributed CNN-ConvLSTM (Convolutional Neural Network-Long Short-Term Memory) archit...",
      "pdf_url": "https://arxiv.org/pdf/2511.11152v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Motor Imagery Classification Using Feature Fusion of Spatially Weighted Electroencephalography",
      "arxiv_id": "2511.13752v1",
      "published": "2025-11-14 01:36:08+00:00",
      "year": 2025,
      "authors": "Abdullah Al Shiam, Md. Khademul Islam Molla, Abu Saleh Musa Miah, Md. Abdus Samad Kamal",
      "summary": "A Brain Computer Interface (BCI) connects the human brain to the outside world, providing a direct communication channel. Electroencephalography (EEG) signals are commonly used in BCIs to reflect cognitive patterns related to motor function activities. However, due to the multichannel nature of EEG signals, explicit information processing is crucial to lessen computational complexity in BCI systems. This study proposes an innovative method based on brain region-specific channel selection and mul...",
      "pdf_url": "https://arxiv.org/pdf/2511.13752v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Habit learning is associated with efficiently controlled network dynamics in naive macaque monkeys",
      "arxiv_id": "2511.10757v1",
      "published": "2025-11-13 19:21:12+00:00",
      "year": 2025,
      "authors": "Julia K. Brynildsen, Panagiotis Fotiadis, Karol P. Szymula, Jason Z. Kim, Fabio Pasqualetti, Ann M. Graybiel, Theresa M. Desrochers, Dani S. Bassett",
      "summary": "Primates utilize distributed neural circuits to learn habits in uncertain environments, but the underlying mechanisms remain poorly understood. We propose a formal theory of network energetics explaining how brain states influence sequential behavior. We test our theory on multi-unit recordings from the caudate nucleus and cortical regions of macaques performing a motor habit task. The theory predicts the energy required to transition between brain states represented by trial-specific firing rat...",
      "pdf_url": "https://arxiv.org/pdf/2511.10757v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "The One Where They Brain-Tune for Social Cognition: Multi-Modal Brain-Tuning on Friends",
      "arxiv_id": "2511.07988v1",
      "published": "2025-11-11 08:53:35+00:00",
      "year": 2025,
      "authors": "Nico Policzer, Cameron Braunstein, Mariya Toneva",
      "summary": "Recent studies on audio models show brain-tuning - fine-tuning models to better predict corresponding fMRI activity - improves brain alignment and increases performance on downstream semantic and audio tasks. We extend this approach to a multimodal audio-video model to enhance social cognition, targeting the Superior Temporal Sulcus (STS), a key region for social processing, while subjects watch Friends. We find significant increases in brain alignment to the STS and an adjacent ROI, as well as ...",
      "pdf_url": "https://arxiv.org/pdf/2511.07988v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Probing the Physical Origin of the Balmer Decrement in the Broad-line Region of Nearby Active Galactic Nuclei via Spectral Variability",
      "arxiv_id": "2511.07714v1",
      "published": "2025-11-11 00:37:44+00:00",
      "year": 2025,
      "authors": "Suyeon Son, Minjin Kim, Luis C. Ho, Ruancun Li",
      "summary": "To investigate the physical origin of the Balmer decrement in the broad-line region of active galactic nuclei (AGNs), we measure the temporal variability of the fluxes of the broad H$β$ and H$α$ emission lines using multi-epoch spectroscopic data of low-redshift AGNs from the Sloan Digital Sky Survey. The analysis of the mean spectra reveals that the Balmer decrement shows no correlation with AGN luminosity, while it is inversely correlated with the Eddington ratio. However, the temporal variati...",
      "pdf_url": "https://arxiv.org/pdf/2511.07714v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Multi-messenger flare in the quasar PKS 0446+11",
      "arxiv_id": "2511.07535v1",
      "published": "2025-11-10 19:00:12+00:00",
      "year": 2025,
      "authors": "Y. Y. Kovalev, M. F. Aller, A. K. Erkenov, J. L. Gómez, D. C. Homan, P. I. Kivokurtseva, Yu. A. Kovalev, M. L. Lister, P. V. de la Parra, A. V. Plavin, A. V. Popkov, A. B. Pushkarev, A. C. S. Readhead, E. Shablovinskaia, Yu. V. Sotnikova, O. I. Spiridonova, S. V. Troitsky, V. V. Vlasyuk",
      "summary": "The physical mechanisms driving neutrino and electromagnetic flares in blazars remain poorly understood. We investigate a prominent multi-messenger flare in the quasar PKS 0446+11 to identify the processes responsible for its high-energy emission. We analyze the IceCube-240105A high-energy neutrino event together with contemporaneous observations in the gamma-ray, X-ray, optical, and radio bands. The on- and off-flare spectral energy distributions (SEDs) are modeled within a single-zone leptohad...",
      "pdf_url": "https://arxiv.org/pdf/2511.07535v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "UAV-Assisted Resilience in 6G and Beyond Network Energy Saving: A Multi-Agent DRL Approach",
      "arxiv_id": "2511.07366v1",
      "published": "2025-11-10 18:23:03+00:00",
      "year": 2025,
      "authors": "Dao Lan Vy Dinh, Anh Nguyen Thi Mai, Hung Tran, Giang Quynh Le Vu, Tu Dac Ho, Zhenni Pan, Vo Nhan Van, Symeon Chatzinotas, Dinh-Hieu Tran",
      "summary": "This paper investigates the unmanned aerial vehicle (UAV)-assisted resilience perspective in the 6G network energy saving (NES) scenario. More specifically, we consider multiple ground base stations (GBSs) and each GBS has three different sectors/cells in the terrestrial networks, and multiple cells are turned off due to NES or incidents, e.g., disasters, hardware failures, or outages. To address this, we propose a Multi-Agent Deep Deterministic Policy Gradient (MADDPG) framework to enable UAV-a...",
      "pdf_url": "https://arxiv.org/pdf/2511.07366v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Offset-Free Robust Nonlinear Control Using Data-Driven Model: A Nonlinear Multi-Model Computationally Efficient Approach",
      "arxiv_id": "2511.07255v1",
      "published": "2025-11-10 16:03:56+00:00",
      "year": 2025,
      "authors": "Carine Menezes Rebello, Erbet Almeida Costa, Idelfonso B. R. Nogueira",
      "summary": "Robust model predictive control (MPC) aims to preserve performance under model-plant mismatch, yet robust formulations for nonlinear MPC (NMPC) with data-driven surrogates remain limited. This work proposes an offset-free robust NMPC scheme based on symbolic regression (SR). Using a compact NARX structure, we identify interpretable surrogate models that explicitly represent epistemic (structural) uncertainty at the operating-zone level, and we enforce robustness by embedding these models as hard...",
      "pdf_url": "https://arxiv.org/pdf/2511.07255v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Active Learning for Animal Re-Identification with Ambiguity-Aware Sampling",
      "arxiv_id": "2511.06658v2",
      "published": "2025-11-10 03:13:40+00:00",
      "year": 2025,
      "authors": "Depanshu Sani, Mehar Khurana, Saket Anand",
      "summary": "Animal Re-ID has recently gained substantial attention in the AI research community due to its high impact on biodiversity monitoring and unique research challenges arising from environmental factors. The subtle distinguishing patterns, handling new species and the inherent open-set nature make the problem even harder. To address these complexities, foundation models trained on labeled, large-scale and multi-species animal Re-ID datasets have recently been introduced to enable zero-shot Re-ID. H...",
      "pdf_url": "https://arxiv.org/pdf/2511.06658v2",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Multi-Reward GRPO Fine-Tuning for De-biasing Large Language Models: A Study Based on Chinese-Context Discrimination Data",
      "arxiv_id": "2511.06023v1",
      "published": "2025-11-08 14:33:21+00:00",
      "year": 2025,
      "authors": "Deng Yixuan, Ji Xiaoqiang",
      "summary": "Large Language Models (LLMs) often exhibit implicit biases and discriminatory tendencies that reflect underlying social stereotypes. While recent alignment techniques such as RLHF and DPO have mitigated some of these issues, they remain limited in addressing culturally specific and multi-dimensional forms of discrimination. This paper proposes a Multi-Reward Group Relative Policy Optimization (GRPO) framework to fine-tune LLMs toward ethical and bias-free behavior. Our approach constructs a synt...",
      "pdf_url": "https://arxiv.org/pdf/2511.06023v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "High-spectral Resolution, Multi-wavelength Center-to-limb Observations of the Sun",
      "arxiv_id": "2511.05174v1",
      "published": "2025-11-07 11:43:27+00:00",
      "year": 2025,
      "authors": "Meetu Verma, Carsten Denker, Alexander G. M. Pietrow, Robert Kamlah, Dominique J. M. Petit dit de la Roche",
      "summary": "The center-to-limb variations (CLVs) of photospheric and chromospheric spectral lines were obtained in 2025 July and August using drift scans from the echelle spectrograph of the 0.7 m Vacuum Tower Telescope at the Observatorio del Teide (ODT) in Tenerife, Spain. This instrument can observe four spectral regions simultaneously, enabling multi-line spectroscopy with high spectral resolution of various activity features and the quiet Sun in the lower solar atmosphere. The initial results of Halpha...",
      "pdf_url": "https://arxiv.org/pdf/2511.05174v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "The ALMA-ATOMS-QUARKS survey: Resolving a chemically rich massive protostellar outflow",
      "arxiv_id": "2511.04504v1",
      "published": "2025-11-06 16:24:00+00:00",
      "year": 2025,
      "authors": "Jia-Hang Zou, Tie Liu, Fengwei Xu, Xindi Tang, Dezhao Meng, Yankun Zhang, Aiyuan Yang, Tapas Baug, Chang Won Lee, L. Viktor Toth, Ariful Hoque, Sami Dib, Pablo Garcia, Hong-Li Liu, Prasanta Gorai, Swagat R. Das, Guido Garay, Patricio Sanhueza, Li Chen, Di Li, Jihye Hwang, Dongting Yang",
      "summary": "We present a comprehensive study on the physical and chemical structures of a chemically rich bipolar outflow in a high-mass star forming region IRAS 16272$-$4837 (SDC335), utilizing high-resolution spectral line data at 1.3 mm and 3 mm dual-bands from the ALMA ATOMS and QUARKS surveys. The high-velocity jet is enveloped by a lower-velocity outflow cavity, containing bright knots that show enhanced molecular intensities and elevated excitation temperatures. Along the outflow, we have identified ...",
      "pdf_url": "https://arxiv.org/pdf/2511.04504v1",
      "category": "deployment_patterns",
      "query_name": "multi_region_deployment",
      "is_us_institution": false
    },
    {
      "title": "Evaluating Function-as-a-Service (FaaS) frameworks for the Accelerator Control System",
      "arxiv_id": "2512.09917v1",
      "published": "2025-12-10 18:53:00+00:00",
      "year": 2025,
      "authors": "A. Jaikar, J. Diamond, A. Tiradani, B. Harrison",
      "summary": "As particle accelerator control systems evolve in complexity and scale, the need for responsive, scalable, and cost-effective computational infrastructure becomes increasingly critical. Function-as-a-Service (FaaS) offers an alternative to traditional monolithic architecture by enabling event-driven execution, automatic scaling, and fine-grained resource utilization. This paper explores the applicability and performance of FaaS frameworks in the context of a modern particle accelerator control s...",
      "pdf_url": "https://arxiv.org/pdf/2512.09917v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "A Model Intercomparison Study of Mixed-Phase Clouds in a Laboratory Chamber",
      "arxiv_id": "2512.09915v1",
      "published": "2025-12-10 18:50:55+00:00",
      "year": 2025,
      "authors": "Aaron Wang, Sisi Chen, Steve Krueger, Piotr Dziekan, Kotaro Enokido, Fabian Hoffmann, Agnieszka Makulska, Bernhard Mehlig, Gaetano Sardina, Grigory Sarnitsky, Silvio Schmalfuß, Shin-ichiro Shima, Fan Yang, Mikhail Ovchinnikov, Raymond A. Shaw",
      "summary": "Mixed-phase clouds, composed of supercooled liquid droplets and ice crystals, play a critical role in weather and climate systems. Their complex microphysical interactions and coupling with turbulence at microscales govern the cloud properties at macroscales, yet remain challenging to observe and quantify under atmospheric conditions. This model intercomparison study utilizes ten model configurations to simulate mixed-phase cloud evolution in the Michigan Technological University's Pi Chamber. T...",
      "pdf_url": "https://arxiv.org/pdf/2512.09915v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "FALCON: Few-step Accurate Likelihoods for Continuous Flows",
      "arxiv_id": "2512.09914v1",
      "published": "2025-12-10 18:47:25+00:00",
      "year": 2025,
      "authors": "Danyal Rehman, Tara Akhound-Sadegh, Artem Gazizov, Yoshua Bengio, Alexander Tong",
      "summary": "Scalable sampling of molecular states in thermodynamic equilibrium is a long-standing challenge in statistical physics. Boltzmann Generators tackle this problem by pairing a generative model, capable of exact likelihood computation, with importance sampling to obtain consistent samples under the target distribution. Current Boltzmann Generators primarily use continuous normalizing flows (CNFs) trained with flow matching for efficient training of powerful models. However, likelihood calculation f...",
      "pdf_url": "https://arxiv.org/pdf/2512.09914v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Superconductivity and geometric superfluid weight of a tunable flat band system",
      "arxiv_id": "2512.09901v1",
      "published": "2025-12-10 18:31:25+00:00",
      "year": 2025,
      "authors": "M. A. Mojarro, Sergio E. Ulloa",
      "summary": "We study superconductivity and superfluid weight of the two-dimensional $α$-$\\mathcal{T}_3$ lattice with on-site asymmetries, hosting an isolated quasi-flat band with tunable bandwidth via a parameter $α$. Within a mean-field approximation of the attractive Hubbard model, we obtain the superconducting order parameters on the three inequivalent sublattices and show their strong dependence on $α$, interaction strength, and electron filling. At quasi-flat band filling, a superconducting gap opens a...",
      "pdf_url": "https://arxiv.org/pdf/2512.09901v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Visual Heading Prediction for Autonomous Aerial Vehicles",
      "arxiv_id": "2512.09898v1",
      "published": "2025-12-10 18:27:37+00:00",
      "year": 2025,
      "authors": "Reza Ahmari, Ahmad Mohammadi, Vahid Hemmati, Mohammed Mynuddin, Parham Kebria, Mahmoud Nabil Mahmoud, Xiaohong Yuan, Abdollah Homaifar",
      "summary": "The integration of Unmanned Aerial Vehicles (UAVs) and Unmanned Ground Vehicles (UGVs) is increasingly central to the development of intelligent autonomous systems for applications such as search and rescue, environmental monitoring, and logistics. However, precise coordination between these platforms in real-time scenarios presents major challenges, particularly when external localization infrastructure such as GPS or GNSS is unavailable or degraded [1]. This paper proposes a vision-based, data...",
      "pdf_url": "https://arxiv.org/pdf/2512.09898v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Comparing AI Agents to Cybersecurity Professionals in Real-World Penetration Testing",
      "arxiv_id": "2512.09882v1",
      "published": "2025-12-10 18:12:29+00:00",
      "year": 2025,
      "authors": "Justin W. Lin, Eliot Krzysztof Jones, Donovan Julian Jasper, Ethan Jun-shen Ho, Anna Wu, Arnold Tianyi Yang, Neil Perry, Andy Zou, Matt Fredrikson, J. Zico Kolter, Percy Liang, Dan Boneh, Daniel E. Ho",
      "summary": "We present the first comprehensive evaluation of AI agents against human cybersecurity professionals in a live enterprise environment. We evaluate ten cybersecurity professionals alongside six existing AI agents and ARTEMIS, our new agent scaffold, on a large university network consisting of ~8,000 hosts across 12 subnets. ARTEMIS is a multi-agent framework featuring dynamic prompt generation, arbitrary sub-agents, and automatic vulnerability triaging. In our comparative study, ARTEMIS placed se...",
      "pdf_url": "https://arxiv.org/pdf/2512.09882v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Diffusion Posterior Sampler for Hyperspectral Unmixing with Spectral Variability Modeling",
      "arxiv_id": "2512.09871v1",
      "published": "2025-12-10 17:57:52+00:00",
      "year": 2025,
      "authors": "Yimin Zhu, Lincoln Linlin Xu",
      "summary": "Linear spectral mixture models (LMM) provide a concise form to disentangle the constituent materials (endmembers) and their corresponding proportions (abundance) in a single pixel. The critical challenges are how to model the spectral prior distribution and spectral variability. Prior knowledge and spectral variability can be rigorously modeled under the Bayesian framework, where posterior estimation of Abundance is derived by combining observed data with endmember prior distribution. Considerin...",
      "pdf_url": "https://arxiv.org/pdf/2512.09871v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "MedForget: Hierarchy-Aware Multimodal Unlearning Testbed for Medical AI",
      "arxiv_id": "2512.09867v1",
      "published": "2025-12-10 17:55:06+00:00",
      "year": 2025,
      "authors": "Fengli Wu, Vaidehi Patil, Jaehong Yoon, Yue Zhang, Mohit Bansal",
      "summary": "Pretrained Multimodal Large Language Models (MLLMs) are increasingly deployed in medical AI systems for clinical reasoning, diagnosis support, and report generation. However, their training on sensitive patient data raises critical privacy and compliance challenges under regulations such as HIPAA and GDPR, which enforce the \"right to be forgotten\". Unlearning, the process of tuning models to selectively remove the influence of specific training data points, offers a potential solution, yet its e...",
      "pdf_url": "https://arxiv.org/pdf/2512.09867v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "UniUGP: Unifying Understanding, Generation, and Planing For End-to-end Autonomous Driving",
      "arxiv_id": "2512.09864v1",
      "published": "2025-12-10 17:50:29+00:00",
      "year": 2025,
      "authors": "Hao Lu, Ziyang Liu, Guangfeng Jiang, Yuanfei Luo, Sheng Chen, Yangang Zhang, Ying-Cong Chen",
      "summary": "Autonomous driving (AD) systems struggle in long-tail scenarios due to limited world knowledge and weak visual dynamic modeling. Existing vision-language-action (VLA)-based methods cannot leverage unlabeled videos for visual causal learning, while world model-based methods lack reasoning capabilities from large language models. In this paper, we construct multiple specialized datasets providing reasoning and planning annotations for complex scenarios. Then, a unified Understanding-Generation-Pla...",
      "pdf_url": "https://arxiv.org/pdf/2512.09864v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Mitigating Social Bias in English and Urdu Language Models Using PRM-Guided Candidate Selection and Sequential Refinement",
      "arxiv_id": "2512.09854v1",
      "published": "2025-12-10 17:36:39+00:00",
      "year": 2025,
      "authors": "Muneeb Ur Raheem Khan",
      "summary": "Large language models (LLMs) increasingly mediate human communication, decision support, content creation, and information retrieval. Despite impressive fluency, these systems frequently produce biased or stereotypical content, especially when prompted with socially sensitive language. A growing body of research has demonstrated that such biases disproportionately affect low-resource languages, where training data is limited and culturally unrepresentative. This paper presents a comprehensive st...",
      "pdf_url": "https://arxiv.org/pdf/2512.09854v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Relativistic accretion process onto rotating black holes in Einstein-Euler-Heisenberg nonlinear electrodynamic gravity",
      "arxiv_id": "2512.09845v1",
      "published": "2025-12-10 17:24:55+00:00",
      "year": 2025,
      "authors": "Orhan Donmez, G. Mustafa, Himanshu Chaudhary, M. Yousaf, Abdelmalek Bouzenada, Allah Ditta, Farruh Atamurotov",
      "summary": "In this study, we uncover the accretion dynamics and oscillatory behavior around rotating black holes within the EEH nonlinear electrodynamic framework by analyzing both the motion of test particles and numerically solving the general relativistic hydrodynamic equations. Using EEH geometry, we compute the structure of circular motion, the effective potential and force, and we evaluate the orbital, radial, and vertical epicyclic frequencies together with the Lense-Thirring and periastron precessi...",
      "pdf_url": "https://arxiv.org/pdf/2512.09845v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "A Relaxed Randomized Averaging Block Extended Bregman-Kaczmarz Method for Combined Optimization Problems",
      "arxiv_id": "2512.09825v1",
      "published": "2025-12-10 17:01:22+00:00",
      "year": 2025,
      "authors": "Zeyu Dong, Aqin Xiao, Guojian Yin, Junfeng Yin",
      "summary": "Randomized Kaczmarz-type methods are widely used for their simplicity and efficiency in solving large-scale linear systems and optimization problems. However, their applicability is limited when dealing with inconsistent systems or incorporating structural information such as sparsity. In this work, we propose a \\emph{relaxed randomized averaging block extended Bregman-Kaczmarz} (rRABEBK) method for solving a broad class of combined optimization problems. The proposed method integrates an averag...",
      "pdf_url": "https://arxiv.org/pdf/2512.09825v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "RECAP Framework v1.0: A Multi-Layer Inheritance Architecture for Evidence Synthesis",
      "arxiv_id": "2512.09821v1",
      "published": "2025-12-10 16:52:25+00:00",
      "year": 2025,
      "authors": "Hung Kuan Lee",
      "summary": "Evidence synthesis has advanced through improved reporting standards, bias assessment tools, and analytic methods, but current workflows remain limited by a single-layer structure in which conceptual, methodological, and procedural decisions are made on the same level. This forces each project to rebuild its methodological foundations from scratch, leading to inconsistencies, conceptual drift, and unstable reasoning across projects. RECAP Framework v1.0 introduces a three-layer meta-architecture...",
      "pdf_url": "https://arxiv.org/pdf/2512.09821v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Towards Practical and Usable In-network Classification",
      "arxiv_id": "2512.09809v1",
      "published": "2025-12-10 16:24:59+00:00",
      "year": 2025,
      "authors": "Di Zhu, Jianxi Chen, Hyojoon Kim",
      "summary": "In-network machine learning enables real-time classification directly on network hardware, offering consistently low inference latency. However, current solutions are limited by strict hardware constraints, scarce on-device resources, and poor usability, making them impractical for ML developers and cloud operators. To this end, we propose ACORN, an end-to-end system that automates the distributed deployment of practical machine learning models across the network. ACORN provides a fully automate...",
      "pdf_url": "https://arxiv.org/pdf/2512.09809v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "OnCoCo 1.0: A Public Dataset for Fine-Grained Message Classification in Online Counseling Conversations",
      "arxiv_id": "2512.09804v1",
      "published": "2025-12-10 16:18:20+00:00",
      "year": 2025,
      "authors": "Jens Albrecht, Robert Lehmann, Aleksandra Poltermann, Eric Rudolph, Philipp Steigerwald, Mara Stieler",
      "summary": "This paper presents OnCoCo 1.0, a new public dataset for fine-grained message classification in online counseling. It is based on a new, integrative system of categories, designed to improve the automated analysis of psychosocial online counseling conversations. Existing category systems, predominantly based on Motivational Interviewing (MI), are limited by their narrow focus and dependence on datasets derived mainly from face-to-face counseling. This limits the detailed examination of textual c...",
      "pdf_url": "https://arxiv.org/pdf/2512.09804v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Time-dependent ab__initio molecular-orbital decomposition for high-harmonic generation spectroscopy",
      "arxiv_id": "2512.09793v1",
      "published": "2025-12-10 16:11:00+00:00",
      "year": 2025,
      "authors": "Marco Marchetta, Chiara Morassut, Julien Toulouse, Emanuele Coccia, Eleonora Luppi",
      "summary": "We propose a real-time time-dependent ab__initio approach within a configuration-interaction-singles ansatz to decompose the high-harmonic generation (HHG) signal of molecules in terms of individual molecular-orbital (MO) contributions. Calculations have been performed by propagating the time-dependent Schr{ö}dinger equation with complex energies, in order to account for ionization of the system, and by using tailored Gaussian basis sets for high-energy and continuum states. We have studied the ...",
      "pdf_url": "https://arxiv.org/pdf/2512.09793v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "DeepSeek's WEIRD Behavior: The cultural alignment of Large Language Models and the effects of prompt language and cultural prompting",
      "arxiv_id": "2512.09772v1",
      "published": "2025-12-10 15:54:18+00:00",
      "year": 2025,
      "authors": "James Luther, Donald Brown",
      "summary": "Culture is a core component of human-to-human interaction and plays a vital role in how we perceive and interact with others. Advancements in the effectiveness of Large Language Models (LLMs) in generating human-sounding text have greatly increased the amount of human-to-computer interaction. As this field grows, the cultural alignment of these human-like agents becomes an important field of study. Our work uses Hofstede's VSM13 international surveys to understand the cultural alignment of these...",
      "pdf_url": "https://arxiv.org/pdf/2512.09772v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Revisiting the X-ray-to-UV relation of Quasars in the era of all-sky surveys",
      "arxiv_id": "2512.09767v1",
      "published": "2025-12-10 15:52:03+00:00",
      "year": 2025,
      "authors": "Maria Chira, Antonis Georgakakis, Angel Ruiz, Shi-Jiang Chen, Johannes Buchner, Amy L. Rankine, Elias Kammoun, Catarina Aydar, Mara Salvato, Andrea Merloni, Mirko Krumpe",
      "summary": "The X-ray--to--UV relation of active galactic nuclei (AGNs), commonly parametrized via the monochromatic luminosities at $2500\\,\\mathring{A}$ and $2\\,keV$, reflects the energetic interplay between the accretion disc and the X-ray-emitting corona, and is key for understanding accretion physics. Previous studies suggest that disc-dominated emission becomes more prominent with increasing optical luminosity. However, the redshift evolution of this relation remains debated, and a dependence on Edding...",
      "pdf_url": "https://arxiv.org/pdf/2512.09767v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Towards Language Model Guided TLA+ Proof Automation",
      "arxiv_id": "2512.09758v1",
      "published": "2025-12-10 15:37:59+00:00",
      "year": 2025,
      "authors": "Yuhao Zhou, Stavros Tripakis",
      "summary": "Formal theorem proving with TLA+ provides rigorous guarantees for system specifications, but constructing proofs requires substantial expertise and effort. While large language models have shown promise in automating proofs for tactic-based theorem provers like Lean, applying these approaches directly to TLA+ faces significant challenges due to the unique hierarchical proof structure of the TLA+ proof system. We present a prompt-based approach that leverages LLMs to guide hierarchical decomposit...",
      "pdf_url": "https://arxiv.org/pdf/2512.09758v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Well-posedness of the motion of a rigid body immersed in a compressible inviscid fluid",
      "arxiv_id": "2512.09741v1",
      "published": "2025-12-10 15:20:57+00:00",
      "year": 2025,
      "authors": "Frédéric Rousset, Pei Su",
      "summary": "We consider a rigid body freely moving in a compressible inviscid fluid within a bounded domain $Ω\\subset\\mathbb{R}^3$. The fluid is thereby governed by the non necessarily isentropic compressible Euler equations, while the rigid body obeys the conservation of linear and angular momentum. This forms a coupled system comprising an ODE and the initial boundary value problem (IBVP) of a hyperbolic system with characteristic boundary in a moving domain, where the fluid velocity matches the solid vel...",
      "pdf_url": "https://arxiv.org/pdf/2512.09741v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Mode Control and Dynamic Population Gratings in Quantum-Dot Lasers",
      "arxiv_id": "2512.09740v1",
      "published": "2025-12-10 15:20:50+00:00",
      "year": 2025,
      "authors": "Xiangpeng Ou, Artem Prokoshin, Hongyan Yu, Xin Yao, Ying Shi, William He, Zhican Zhou, Yating Wan",
      "summary": "Single-mode operation is essential for integrated semiconductor lasers, yet most solutions rely on regrowth, etched gratings, or other complex fabrication steps that limit scalability. We show that quantum-dot (QD) lasers can achieve stable single-mode lasing through a simple cavity design using dynamic population gratings (DPGs). Owing to the low lateral carrier diffusion of QDs, a strong standing-wave-induced carrier grating forms in a reverse-biased saturable absorber and provides self-aligne...",
      "pdf_url": "https://arxiv.org/pdf/2512.09740v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Oceanic internal tides: do they get phased at the Equator?",
      "arxiv_id": "2512.09728v1",
      "published": "2025-12-10 15:09:29+00:00",
      "year": 2025,
      "authors": "Camille Moisset, Bruce Sutherland, Lois Baker",
      "summary": "Low-mode baroclinic tides play a major role in ocean dynamics, especially for energy redistribution and deep ocean mixing. These internal waves, generated by tidal flow over submarine topography, can propagate for thousands of kilometres across ocean basins, and become unstable through wave-mean flow or wave-wave interactions. Satellite observations of internal tides have shown that part of their lunar semidiurnal (M2) altimetry signal loses phase coherence in equatorial regions, thus affecting ...",
      "pdf_url": "https://arxiv.org/pdf/2512.09728v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Numerical simulations of astrophysical dynamos and applications to giant planets",
      "arxiv_id": "2512.09725v1",
      "published": "2025-12-10 15:08:22+00:00",
      "year": 2025,
      "authors": "Albert Elias-López",
      "summary": "Magnetic fields pervade astrophysical systems and strongly influence their dynamics. Because magnetic diffusion is usually much faster than system evolution, ancient fields cannot explain the present magnetization of planets, stars, and galaxies. Instead, self-sustaining dynamos, which convert fluid motion into magnetic energy, offer the most robust explanation. Numerical magnetohydrodynamic simulations are essential to understanding this phenomenon. This thesis uses numerical models of self-exc...",
      "pdf_url": "https://arxiv.org/pdf/2512.09725v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Weak-Strong Uniqueness and Relaxation Limit for a Navier-Stokes-Korteweg Model",
      "arxiv_id": "2512.09719v1",
      "published": "2025-12-10 15:02:20+00:00",
      "year": 2025,
      "authors": "Nilasis Chaudhuri, Christian Rohde, Florian Wendt",
      "summary": "We consider a parabolic relaxation model for the compressible Navier-Stokes-Korteweg equations in the isothermal framework. This system depends on the relaxation parameters $α,β>0$ and approximates formally solutions of the compressible Navier-Stokes-Korteweg equations in the relaxation limit $α\\to \\infty$ and $β\\to 0$. Introducing the class of finite energy weak solutions for the initial-boundary value problem corresponding to the relaxation model in spatial dimension three, we show that the we...",
      "pdf_url": "https://arxiv.org/pdf/2512.09719v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Reinterpreting Landauer conductance, solving the quantum measurement problem, grand unification",
      "arxiv_id": "2512.09709v1",
      "published": "2025-12-10 14:57:09+00:00",
      "year": 2025,
      "authors": "Kanchan Meena, Souvik Ghosh, P. Singha Deo",
      "summary": "In a series of recent papers we have proved rigorously that time travel is a reality and very much feasible by using quantum mechanical processes. There are plenty of indirect experimental support untill a direct experiment is conducted. The process crucially depend on the reality of a local time as well as a local partial density of states (LPDOS) that can become negative very easily in the quantum regime of mesoscopic systems. Mesoscopic systems are small enough to allow us to experimentally a...",
      "pdf_url": "https://arxiv.org/pdf/2512.09709v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Knowledge Graph Enrichment and Reasoning for Nobel Laureates",
      "arxiv_id": "2512.09707v1",
      "published": "2025-12-10 14:53:35+00:00",
      "year": 2025,
      "authors": "Thanh-Lam T. Nguyen, Ngoc-Quang Le, Thu-Trang Pham, Mai-Vu Tran",
      "summary": "This project aims to construct and analyze a comprehensive knowledge graph of Nobel Prize and Laureates by enriching existing datasets with biographical information extracted from Wikipedia. Our approach integrates multiple advanced techniques, consisting of automatic data augmentation using LLMs for Named Entity Recognition (NER) and Relation Extraction (RE) tasks, and social network analysis to uncover hidden patterns within the scientific community. Furthermore, we also develop a GraphRAG-bas...",
      "pdf_url": "https://arxiv.org/pdf/2512.09707v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Three-body interaction in a magnon-Andreev-superconducting qubit system: collapse-revival phenomena and entanglement redistribution",
      "arxiv_id": "2512.09697v1",
      "published": "2025-12-10 14:44:32+00:00",
      "year": 2025,
      "authors": "Sheng Zhao, Peng-Bo Li",
      "summary": "Three-body interactions are fundamental for realizing novel quantum phenomena beyond pairwise physics, yet their implementation -- particularly among distinct quantum systems -- remains challenging. Here, we propose a hybrid quantum architecture comprising a magnonic mode (in a YIG sphere), an Andreev spin qubit (ASQ), and a superconducting qubit (SCQ), to realize a strong three-body interaction at the single-quantum level. Leveraging the spin-dependent supercurrent and circuit-integration flexi...",
      "pdf_url": "https://arxiv.org/pdf/2512.09697v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Understanding Chain-of-Thought Effectiveness in Code Generation: An Empirical and Information-Theoretic Analysis",
      "arxiv_id": "2512.09679v1",
      "published": "2025-12-10 14:25:46+00:00",
      "year": 2025,
      "authors": "Naizhu Jin, Zhong Li, Guang Yang, Tian Zhang, Qingkai Zeng",
      "summary": "Large language models (LLMs) achieve strong performance on code generation, but the mechanisms by which Chain-of-Thought (CoT) prompting helps remain unclear. We present a systematic empirical and information-theoretic study of CoT effectiveness in neural code generation, evaluating five paradigms (Zero-Shot, Zero-Shot CoT, Self-Planning, Structured CoT, Reasoning-CoT) across six Python benchmarks, a multilingual benchmark with 12 programming languages, and six models from 7B to 480B parameters,...",
      "pdf_url": "https://arxiv.org/pdf/2512.09679v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "A Monotone--Operator Proof of Existence and Uniqueness for a Simple Stationary Mean Field Game",
      "arxiv_id": "2512.09671v1",
      "published": "2025-12-10 14:14:47+00:00",
      "year": 2025,
      "authors": "Hikmatullo Ismatov",
      "summary": "We study a stationary first--order mean field game on the $d$--dimensional torus. The system couples a Hamilton--Jacobi equation for the value function with a transport equation for the density of players. Our goal is to give a detailed and friendly exposition of the monotone--operator argument that yields existence and uniqueness of solutions.\n  We first present a general framework in a Hilbert space and prove existence of a strong solution by adding a simple coercive regularisation and applyin...",
      "pdf_url": "https://arxiv.org/pdf/2512.09671v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "IF-Bench: Benchmarking and Enhancing MLLMs for Infrared Images with Generative Visual Prompting",
      "arxiv_id": "2512.09663v1",
      "published": "2025-12-10 14:01:02+00:00",
      "year": 2025,
      "authors": "Tao Zhang, Yuyang Hong, Yang Xia, Kun Ding, Zeyu Zhang, Ying Wang, Shiming Xiang, Chunhong Pan",
      "summary": "Recent advances in multimodal large language models (MLLMs) have led to impressive progress across various benchmarks. However, their capability in understanding infrared images remains unexplored. To address this gap, we introduce IF-Bench, the first high-quality benchmark designed for evaluating multimodal understanding of infrared images. IF-Bench consists of 499 images sourced from 23 infrared datasets and 680 carefully curated visual question-answer pairs, covering 10 essential dimensions o...",
      "pdf_url": "https://arxiv.org/pdf/2512.09663v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Relaxation limit and asymptotic stability for the Euler-Navier-Stokes equations",
      "arxiv_id": "2512.09650v1",
      "published": "2025-12-10 13:47:08+00:00",
      "year": 2025,
      "authors": "Mingwen Fei, Ling-Yun Shou, Houzhi Tang",
      "summary": "The Euler-Navier-Stokes (E-NS) system arises as a macroscopic description of kinetic-fluid interactions, derived from the local-Maxwellian closure of the Vlasov-Fokker-Planck-Navier-Stokes flow. In this paper, we investigate the singular limit of the system in $\\mathbb{R}^d$ ($d\\ge2$) when the relaxation parameter $\\varepsilon>0$ tends to zero. In contrast to the Euler system with velocity damping, the E-NS model features only a weaker relaxation of the relative velocity, which makes it challeng...",
      "pdf_url": "https://arxiv.org/pdf/2512.09650v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Hadron Emission and Stopping in Heavy-Ion Collisions: Baryon-Rich Matter to Meson-Dominated Matter",
      "arxiv_id": "2512.09630v1",
      "published": "2025-12-10 13:17:17+00:00",
      "year": 2025,
      "authors": "Manuel Lorenz, Christoph Blume",
      "summary": "Today's accelerator facilities used for studies of relativistic heavy-ion collisions cover an energy range spanning over three orders of magnitude, from a few GeV up to a few TeV in center-of-mass energy per nucleon pair ($\\sqrt{s_{NN}}$). We present a systematic overview of hadron emission in heavy-ion collisions across this entire energy range. The presented energy excitation functions of the approximated baryon and meson yields at mid-rapidity reflect the interplay between baryon stopping and...",
      "pdf_url": "https://arxiv.org/pdf/2512.09630v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Real-Time Non-Smooth MPC for Switching Systems: Application to a Three-Tank Process",
      "arxiv_id": "2512.09611v1",
      "published": "2025-12-10 12:58:11+00:00",
      "year": 2025,
      "authors": "Hendrik Alsmeier, Felix Häusser, Andreas Knödler, Armin Nurkanović, Anton Pozharskiy, Moritz Diehl, Rolf Findeisen",
      "summary": "Real-time model predictive control of non-smooth switching systems remains challenging due to discontinuities and the presence of discrete modes, which complicate numerical integration and optimization. This paper presents a real-time feasible non-smooth model predictive control scheme for a physical three-tank process, implemented without mixed-integer formulations. The approach combines Filippov system modeling with finite elements and switch detection for time discretization, leading to a fin...",
      "pdf_url": "https://arxiv.org/pdf/2512.09611v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "ImageTalk: Designing a Multimodal AAC Text Generation System Driven by Image Recognition and Natural Language Generation",
      "arxiv_id": "2512.09610v1",
      "published": "2025-12-10 12:57:55+00:00",
      "year": 2025,
      "authors": "Boyin Yang, Puming Jiang, Per Ola Kristensson",
      "summary": "People living with Motor Neuron Disease (plwMND) frequently encounter speech and motor impairments that necessitate a reliance on augmentative and alternative communication (AAC) systems. This paper tackles the main challenge that traditional symbol-based AAC systems offer a limited vocabulary, while text entry solutions tend to exhibit low communication rates. To help plwMND articulate their needs about the system efficiently and effectively, we iteratively design and develop a novel multimodal...",
      "pdf_url": "https://arxiv.org/pdf/2512.09610v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "On the Frechet Root Kernel of Certain Wave Equations",
      "arxiv_id": "2512.09609v1",
      "published": "2025-12-10 12:57:27+00:00",
      "year": 2025,
      "authors": "Rafael Abreu, Chahana Nagesh",
      "summary": "We extend the adjoint method to complex-valued PDEs and introduce the Fréchet root sensitivity kernel, as the most fundamental kernel from which all other material-sensitivity kernels can be derived. We apply this framework to four representative equations: two real-valued PDEs (the second-order wave equation and the Euler--Bernoulli beam equation) and two complex-valued PDEs (the complex transport equation and the Schroedinger equation with zero potential). We compute and analyze the Frechet ro...",
      "pdf_url": "https://arxiv.org/pdf/2512.09609v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Super4DR: 4D Radar-centric Self-supervised Odometry and Gaussian-based Map Optimization",
      "arxiv_id": "2512.09608v1",
      "published": "2025-12-10 12:55:05+00:00",
      "year": 2025,
      "authors": "Zhiheng Li, Weihua Wang, Qiang Shen, Yichen Zhao, Zheng Fang",
      "summary": "Conventional SLAM systems using visual or LiDAR data often struggle in poor lighting and severe weather. Although 4D radar is suited for such environments, its sparse and noisy point clouds hinder accurate odometry estimation, while the radar maps suffer from obscure and incomplete structures. Thus, we propose Super4DR, a 4D radar-centric framework for learning-based odometry estimation and gaussian-based map optimization. First, we design a cluster-aware odometry network that incorporates objec...",
      "pdf_url": "https://arxiv.org/pdf/2512.09608v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "A unified framework for identifying influential nodes in hypergraphs",
      "arxiv_id": "2512.09606v1",
      "published": "2025-12-10 12:53:41+00:00",
      "year": 2025,
      "authors": "Yajing Hao, Longzhao Liu, Xin Wang, Zhihao Han, Ming Wei, Zhiming Zheng, Shaoting Tang",
      "summary": "Identifying influential nodes plays a pivotal role in understanding, controlling, and optimizing the behavior of complex systems, ranging from social to biological and technological domains. Yet most centrality-based approaches rely on pairwise topology and are purely structural, neglecting the higher-order interactions and the coupling between structure and dynamics. Consequently, the practical effectiveness of existing approaches remains uncertain when applied to complex spreading processes. T...",
      "pdf_url": "https://arxiv.org/pdf/2512.09606v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Temporal Windows of Integration for Multisensory Wireless Systems as Enablers of Physical AI",
      "arxiv_id": "2512.09589v1",
      "published": "2025-12-10 12:32:32+00:00",
      "year": 2025,
      "authors": "Anup Mishra, João Henrique Inacio de Souza, Petar Popovski",
      "summary": "Physical artificial intelligence (AI) refers to the AI that interacts with the physical world in real time. Similar to multisensory perception, Physical AI makes decisions based on multimodal updates from sensors and devices. Physical AI thus operates with a finite spatial footprint of its sensory tributaries. The multimodal updates traverse heterogeneous and unreliable paths, involving wireless links. Throughput or latency guarantees do not ensure correct decision-making, as misaligned, misorde...",
      "pdf_url": "https://arxiv.org/pdf/2512.09589v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Investigate the Low-level Visual Perception in Vision-Language based Image Quality Assessment",
      "arxiv_id": "2512.09573v1",
      "published": "2025-12-10 12:06:47+00:00",
      "year": 2025,
      "authors": "Yuan Li, Zitang Sun, Yen-Ju Chen, Shin'ya Nishida",
      "summary": "Recent advances in Image Quality Assessment (IQA) have leveraged Multi-modal Large Language Models (MLLMs) to generate descriptive explanations. However, despite their strong visual perception modules, these models often fail to reliably detect basic low-level distortions such as blur, noise, and compression, and may produce inconsistent evaluations across repeated inferences. This raises an essential question: do MLLM-based IQA systems truly perceive the visual features that matter? To examine ...",
      "pdf_url": "https://arxiv.org/pdf/2512.09573v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "PHWSOA: A Pareto-based Hybrid Whale-Seagull Scheduling for Multi-Objective Tasks in Cloud Computing",
      "arxiv_id": "2512.09568v1",
      "published": "2025-12-10 12:01:50+00:00",
      "year": 2025,
      "authors": "Zhi Zhao, Hang Xiao, Wei Rang",
      "summary": "Task scheduling is a critical research challenge in cloud computing, a transformative technology widely adopted across industries. Although numerous scheduling solutions exist, they predominantly optimize singular or limited metrics such as execution time or resource utilization often neglecting the need for comprehensive multi-objective optimization. To bridge this gap, this paper proposes the Pareto-based Hybrid Whale-Seagull Optimization Algorithm (PHWSOA). This algorithm synergistically comb...",
      "pdf_url": "https://arxiv.org/pdf/2512.09568v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "From Graphs to Gates: DNS-HyXNet, A Lightweight and Deployable Sequential Model for Real-Time DNS Tunnel Detection",
      "arxiv_id": "2512.09565v1",
      "published": "2025-12-10 11:59:05+00:00",
      "year": 2025,
      "authors": "Faraz Ali, Muhammad Afaq, Mahmood Niazi, Muzammil Behzad",
      "summary": "Domain Name System (DNS) tunneling remains a covert channel for data exfiltration and command-and-control communication. Although graph-based methods such as GraphTunnel achieve strong accuracy, they introduce significant latency and computational overhead due to recursive parsing and graph construction, limiting their suitability for real-time deployment. This work presents DNS-HyXNet, a lightweight extended Long Short-Term Memory (xLSTM) hybrid framework designed for efficient sequence-based D...",
      "pdf_url": "https://arxiv.org/pdf/2512.09565v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Magnetic properties of molecular beam epitaxy-grown ultrathin Cr2Ge2Te6 films down to monolayer limit on Si substrates",
      "arxiv_id": "2512.09557v1",
      "published": "2025-12-10 11:53:15+00:00",
      "year": 2025,
      "authors": "Pengfei Ji, Ruixuan Liu, Tianchen Zhu, Jinxuan Liang, Yang Chen, Yitian Tong, Yunhe Bai, Zuhan Geng, Fangting Chen, Yunyi Zang, Xiyu Hong, Jiatong Zhang, Luyi Yang, Qi-Kun Xue, Ke He, Xiao Feng",
      "summary": "Cr2Ge2Te6, a prototypical van der Waals ferromagnetic semiconductor, have attracted significant interest for its potential applications in high-performance spintronics. However, the magnetic ground state of monolayer Cr2Ge2Te6 remains elusive due to fragile and irregular-shaped thin flake samples with weak magnetic signals. Here, we successfully grow uniform ferromagnetic Cr2Ge2Te6 films down to monolayer by molecular beam epitaxy. By exploiting a self-limiting growth mode, we achieve synthesis ...",
      "pdf_url": "https://arxiv.org/pdf/2512.09557v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "A State-Space-View of Atom-Diatom Reactions Relevant to Rarefied Gas Flow",
      "arxiv_id": "2512.09545v1",
      "published": "2025-12-10 11:34:45+00:00",
      "year": 2025,
      "authors": "Abhirami Vijayakumar, Raidel Martin-Barrios, Markus Meuwly",
      "summary": "A microscopically resolved picture of energy flow in atom-diatom collisions is essential for understanding the non-equilibrium chemistry in rarefied and hypersonic gas flow. Here, a comprehensive ensemble of quasi-classical trajectories on global, reactive, and ``vetted'' potential energy surfaces are employed to construct state-resolved probability maps and to determine the dependence of the outcomes on the initial ro-vibrational states $(v,j)$. The full range of processes, including elastic, i...",
      "pdf_url": "https://arxiv.org/pdf/2512.09545v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Don't Throw Away Your Beams: Improving Consistency-based Uncertainties in LLMs via Beam Search",
      "arxiv_id": "2512.09538v1",
      "published": "2025-12-10 11:24:29+00:00",
      "year": 2025,
      "authors": "Ekaterina Fadeeva, Maiya Goloburda, Aleksandr Rubashevskii, Roman Vashurin, Artem Shelmanov, Preslav Nakov, Mrinmaya Sachan, Maxim Panov",
      "summary": "Consistency-based methods have emerged as an effective approach to uncertainty quantification (UQ) in large language models. These methods typically rely on several generations obtained via multinomial sampling, measuring their agreement level. However, in short-form QA, multinomial sampling is prone to producing duplicates due to peaked distributions, and its stochasticity introduces considerable variance in uncertainty estimates across runs. We introduce a new family of methods that employ bea...",
      "pdf_url": "https://arxiv.org/pdf/2512.09538v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Effect of cold rolling strain on the microstructural evolution in equimolar MoNbTaTiZr refractory complex concentrated alloy: Comprehensive characterization",
      "arxiv_id": "2512.09534v1",
      "published": "2025-12-10 11:16:20+00:00",
      "year": 2025,
      "authors": "Andrea Skolakova, Haruka Katayama, Pavel Lejcek, Orsolya Molnarova, Sadahiro Tsurekawa, Petr Vertat, Jan Duchon, Jaroslav Cech, Petr Svora, Ondrej Ekrt, Jan Pinc",
      "summary": "This work presents a pilot study on a strained complex concentrated alloy based on refractory elements: MoNbTaTiZr. Initially, the as-cast and homogenization-annealed conditions were characterized. After casting, the alloy consists of two solid solutions with BCC 1 and BCC 2 crystal structures. Homogenization annealing promotes the growth, ordering, and refinement of the BCC 2 phase. TEM and AES analyses indicate possible Zr segregation at grain boundaries in the as-cast state. In contrast, anne...",
      "pdf_url": "https://arxiv.org/pdf/2512.09534v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "SLICE -- Combining Strong Lensing and X-ray in AC\\,114. Insights into the Merger Scenario",
      "arxiv_id": "2512.09512v1",
      "published": "2025-12-10 10:36:06+00:00",
      "year": 2025,
      "authors": "Marceau Limousin, Benjamin Beauchesne, Keren Sharon, Johan Richard, Gourav Khullar, Mathilde Jauzac, Mike Gladders, Eric Jullo, Catherine Cerny, Stefano Ettori, Gavin Leroy, Nency Patel",
      "summary": "AC114 is a historically significant galaxy cluster, being one of the first strong lensing clusters detected from the ground in the early 1990s, prior to the launch of the HST. Despite this early prominence, no detailed lensing analyses have been carried out for more than fifteen years. We here study this cluster using JWST imaging obtained as part of the SLICE program, complemented by archival HST and X-ray observations. JWST data reveal ten new multiply imaged systems and enable the identificat...",
      "pdf_url": "https://arxiv.org/pdf/2512.09512v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "CNFinBench: A Benchmark for Safety and Compliance of Large Language Models in Finance",
      "arxiv_id": "2512.09506v1",
      "published": "2025-12-10 10:30:00+00:00",
      "year": 2025,
      "authors": "Jinru Ding, Chao Ding, Wenrao Pang, Boyi Xiao, Zhiqiang Liu, Pengcheng Chen, Jiayuan Chen, Tiantian Yuan, Junming Guan, Yidong Jiang, Dawei Cheng, Jie Xu",
      "summary": "Large language models are increasingly deployed across the financial sector for tasks such as research, compliance, risk analysis, and customer service, which makes rigorous safety evaluation essential. However, existing financial benchmarks primarily focus on textbook-style question answering and numerical problem solving, but fail to evaluate models' real-world safety behaviors. They weakly assess regulatory compliance and investor-protection norms, rarely stress-test multi-turn adversarial ta...",
      "pdf_url": "https://arxiv.org/pdf/2512.09506v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Modeling the dynamics of trapped electrons in quantum dots",
      "arxiv_id": "2512.09470v1",
      "published": "2025-12-10 09:45:36+00:00",
      "year": 2025,
      "authors": "R. Carmina Monreal",
      "summary": "We analyze the effects of electron-electron and electron-phonon interactions in the dynamics of a system of two or three electrons that can be trapped to a localized state and detrapped to ab extended band states of a quantum dot using a simple model. In spite of its simplicity the time dependent problem has no analytical solution but a numerically exact one can be found at a relatively low computational cost. Within this model, we study the time evolution of the electron occupancies of conducti...",
      "pdf_url": "https://arxiv.org/pdf/2512.09470v1",
      "category": "consistency_models",
      "query_name": "data_consistency",
      "is_us_institution": false
    },
    {
      "title": "Table-top all-attosecond transient absorption spectrscopy",
      "arxiv_id": "2512.09585v1",
      "published": "2025-12-10 12:23:02+00:00",
      "year": 2025,
      "authors": "Mikhail Volkov, Evaldas Svirplys, Stefanos Carlström, Serguei Patchkovskii, Misha Yu. Ivanov, Marc J. J. Vrakking, Bernd Schütte",
      "summary": "Attosecond transient absorption spectroscopy (ATAS) has emerged as a powerful technique within the field of attosecond science, combining extremely high temporal and excellent spectral resolution. So far, ATAS has been implemented in pump-probe experiments where an attosecond extreme-ultraviolet (XUV) pump or probe pulse was combined with a near-infrared (NIR) pulse in the femtosecond range, with the attosecond time resolution deriving from sub-cycle NIR-driven dynamics. Investigations of ultraf...",
      "pdf_url": "https://arxiv.org/pdf/2512.09585v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Food, Affection and Gaze: Which Cues do Free-Ranging Dogs Consider for Engaging with Humans?",
      "arxiv_id": "2512.09493v1",
      "published": "2025-12-10 10:11:16+00:00",
      "year": 2025,
      "authors": "Srijaya Nandi, Dipayanti Aditya, Tithi Chakraborty, Rachael Sara Paul, Anindita Bhadra",
      "summary": "Free-ranging dogs (Canis lupus familiaris) constitute the majority of the global dog population and rely heavily on human-derived resources. Studies show different levels of responses to various cues like food, petting and gazing by humans. However, the relative importance that dogs associate with these rewards, driving their interactions with unfamiliar humans remain understudied. Understanding how these dogs prioritize different rewards, ranging from food to social contact, can offer insights ...",
      "pdf_url": "https://arxiv.org/pdf/2512.09493v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Proof of Trusted Execution: A Consensus Paradigm for Deterministic Blockchain Finality",
      "arxiv_id": "2512.09409v1",
      "published": "2025-12-10 08:04:38+00:00",
      "year": 2025,
      "authors": "Kyle Habib, Vladislav Kapitsyn, Giovanni Mazzeo, Faisal Mehrban",
      "summary": "Current blockchain consensus protocols -- notably, Proof of Work (PoW) and Proof of Stake (PoS) -- deliver global agreement but exhibit structural constraints. PoW anchors security in heavy computation, inflating energy use and imposing high confirmation latency. PoS improves efficiency but introduces stake concentration, long-range and \"nothing-at-stake\" vulnerabilities, and a hard performance ceiling shaped by slot times and multi-round committee voting. In this paper, we propose Proof of Trus...",
      "pdf_url": "https://arxiv.org/pdf/2512.09409v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "FUSER: Feed-Forward MUltiview 3D Registration Transformer and SE(3)$^N$ Diffusion Refinement",
      "arxiv_id": "2512.09373v1",
      "published": "2025-12-10 07:11:22+00:00",
      "year": 2025,
      "authors": "Haobo Jiang, Jin Xie, Jian Yang, Liang Yu, Jianmin Zheng",
      "summary": "Registration of multiview point clouds conventionally relies on extensive pairwise matching to build a pose graph for global synchronization, which is computationally expensive and inherently ill-posed without holistic geometric constraints. This paper proposes FUSER, the first feed-forward multiview registration transformer that jointly processes all scans in a unified, compact latent space to directly predict global poses without any pairwise estimation. To maintain tractability, FUSER encodes...",
      "pdf_url": "https://arxiv.org/pdf/2512.09373v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Targeting Misalignment: A Conflict-Aware Framework for Reward-Model-based LLM Alignment",
      "arxiv_id": "2512.09212v1",
      "published": "2025-12-10 00:52:21+00:00",
      "year": 2025,
      "authors": "Zixuan Liu, Siavash H. Khajavi, Guangkai Jiang, Xinru Liu",
      "summary": "Reward-model-based fine-tuning is a central paradigm in aligning Large Language Models with human preferences. However, such approaches critically rely on the assumption that proxy reward models accurately reflect intended supervision, a condition often violated due to annotation noise, bias, or limited coverage. This misalignment can lead to undesirable behaviors, where models optimize for flawed signals rather than true human values. In this paper, we investigate a novel framework to identify ...",
      "pdf_url": "https://arxiv.org/pdf/2512.09212v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Binding Kinetics Oppositely Regulates type II Topoisomerase Relaxation and Decatenation Activities",
      "arxiv_id": "2512.09141v1",
      "published": "2025-12-09 21:41:03+00:00",
      "year": 2025,
      "authors": "Cleis Battaglia, Filippo Conforto, Yair Augusto Gutierrez Fosado, Matt Newton, Erin Cutts, Davide Michieletto, Antonio Valdes",
      "summary": "Type II Topoisomerases (topo II) are critical to simplify genome topology during transcription and replication. They identify topological problems and resolve them by passing a double-stranded DNA segment through a transient break in another segment. The precise mechanisms underpinning topo IIs ability to maintain a topologically simple genome are not fully understood. Here, we investigate how binding kinetics affects the resolution of two distinct forms of topological entanglement: decatenation...",
      "pdf_url": "https://arxiv.org/pdf/2512.09141v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "GimbalDiffusion: Gravity-Aware Camera Control for Video Generation",
      "arxiv_id": "2512.09112v1",
      "published": "2025-12-09 20:54:35+00:00",
      "year": 2025,
      "authors": "Frédéric Fortier-Chouinard, Yannick Hold-Geoffroy, Valentin Deschaintre, Matheus Gadelha, Jean-François Lalonde",
      "summary": "Recent progress in text-to-video generation has achieved remarkable realism, yet fine-grained control over camera motion and orientation remains elusive. Existing approaches typically encode camera trajectories through relative or ambiguous representations, limiting explicit geometric control. We introduce GimbalDiffusion, a framework that enables camera control grounded in physical-world coordinates, using gravity as a global reference. Instead of describing motion relative to previous frames, ...",
      "pdf_url": "https://arxiv.org/pdf/2512.09112v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Foreground Mitigation for CMB Lensing with the Global Minimum Variance Quadratic Estimator",
      "arxiv_id": "2512.08908v1",
      "published": "2025-12-09 18:45:59+00:00",
      "year": 2025,
      "authors": "Yuka Nakato, W. L. Kimmy Wu, Ana Carolina Silva Oliveira, Yuuki Omori, Abhishek S. Maniyar",
      "summary": "Weak gravitational lensing of the cosmic microwave background (CMB) is a powerful probe of cosmology, providing insight into structure formation and the evolution of the universe. Current and upcoming CMB experiments such as SPT-3G and the Simons Observatory (SO) provide high-resolution, low-noise temperature and polarization maps that are ideal for lensing reconstruction. The global minimum variance (GMV) quadratic estimator for CMB lensing reduces reconstruction noise over the standard quadrat...",
      "pdf_url": "https://arxiv.org/pdf/2512.08908v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Dual-wavelength Fourier Ptychographic Topography",
      "arxiv_id": "2512.08883v1",
      "published": "2025-12-09 18:19:29+00:00",
      "year": 2025,
      "authors": "Yi Shen, Tongyu Li, Hao Wang, Jinyong Kim, Hojun Lee, Wookrae Kim, Jonghyeok Park, Junho Shin, Seungbeam Park, Lei Tian",
      "summary": "We introduce a dual-wavelength Fourier ptychographic topography (FPT) method that extends the lambda/2 height-range limit of single-wavelength FPT. By reconstructing complex fields at two illumination wavelengths and exploiting their phase difference, the method achieves an effective synthetic wavelength lambda_s and an unambiguous range of lambda_s/2 without reducing lateral resolution. A noise-robust wrapped-number search is used to select per-pixel integer pairs (k1, k2), and a global refinem...",
      "pdf_url": "https://arxiv.org/pdf/2512.08883v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Decentralized Trust for Space AI: Blockchain-Based Federated Learning Across Multi-Vendor LEO Satellite Networks",
      "arxiv_id": "2512.08882v1",
      "published": "2025-12-09 18:16:34+00:00",
      "year": 2025,
      "authors": "Mohamed Elmahallawy, Asma Jodeiri Akbarfam",
      "summary": "The rise of space AI is reshaping government and industry through applications such as disaster detection, border surveillance, and climate monitoring, powered by massive data from commercial and governmental low Earth orbit (LEO) satellites. Federated satellite learning (FSL) enables joint model training without sharing raw data, but suffers from slow convergence due to intermittent connectivity and introduces critical trust challenges--where biased or falsified updates can arise across satelli...",
      "pdf_url": "https://arxiv.org/pdf/2512.08882v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Fed-SE: Federated Self-Evolution for Privacy-Constrained Multi-Environment LLM Agents",
      "arxiv_id": "2512.08870v1",
      "published": "2025-12-09 18:04:41+00:00",
      "year": 2025,
      "authors": "Xiang Chen, Yuling Shi, Qizhen Lan, Yuchao Qiu, Xiaodong Gu",
      "summary": "LLM agents are widely deployed in complex interactive tasks, yet privacy constraints often preclude centralized optimization and co-evolution across dynamic environments. While Federated Learning (FL) has proven effective on static datasets, its extension to the open-ended self-evolution of agents remains underexplored. Directly applying standard FL is challenging: heterogeneous tasks and sparse, trajectory-level rewards introduce severe gradient conflicts, destabilizing the global optimization ...",
      "pdf_url": "https://arxiv.org/pdf/2512.08870v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Chemical analysis of the Milky Way's Nuclear Star Cluster: Evidence for a metallicity gradient",
      "arxiv_id": "2512.08387v1",
      "published": "2025-12-09 09:18:08+00:00",
      "year": 2025,
      "authors": "M. Schultheis, L. Serrano, B. Thorsbro, F. Nogueras-Lara, A. Feldmeier-Krause, G. Nandakumar, K. Fiteni, M. C. Sormani",
      "summary": "The Milky Way nuclear star cluster (MWNSC) is located together with its surrounding nuclear stellar disc (MWNSD) in the Galactic centre and they dominate the gravitational potential within the inner 300\\,pc. However, the formation and evolution of both systems and their possible connections are still under debate. We reanalyse the low-resolution KMOS spectra in the MWNSC with the aim to improve the stellar parameters ($\\rm T_{eff}$, $\\rm \\log\\,g$, and $\\rm [M/H])$ for the MWNSC. We use an improv...",
      "pdf_url": "https://arxiv.org/pdf/2512.08387v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Bi^2MAC: Bimodal Bi-Adaptive Mask-Aware Convolution for Remote Sensing Pansharpening",
      "arxiv_id": "2512.08331v1",
      "published": "2025-12-09 08:00:43+00:00",
      "year": 2025,
      "authors": "Xianghong Xiao, Zeyu Xia, Zhou Fei, Jinliang Xiao, Haorui Chen, Liangjian Deng",
      "summary": "Pansharpening aims to fuse a high-resolution panchromatic (PAN) image with a low-resolution multispectral (LRMS) image to generate a high-resolution multispectral image (HRMS). Conventional deep learning-based methods are inherently limited in their ability to adapt to regional heterogeneity within feature representations. Although various adaptive convolution methods have been proposed to address this limitation, they often suffer from excessive computational costs and a limited ability to capt...",
      "pdf_url": "https://arxiv.org/pdf/2512.08331v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Liver Fibrosis Quantification and Analysis: The LiQA Dataset and Baseline Method",
      "arxiv_id": "2512.07651v1",
      "published": "2025-12-08 15:44:24+00:00",
      "year": 2025,
      "authors": "Yuanye Liu, Hanxiao Zhang, Nannan Shi, Yuxin Shi, Arif Mahmood, Murtaza Taj, Xiahai Zhuang",
      "summary": "Liver fibrosis represents a significant global health burden, necessitating accurate staging for effective clinical management. This report introduces the LiQA (Liver Fibrosis Quantification and Analysis) dataset, established as part of the CARE 2024 challenge. Comprising $440$ patients with multi-phase, multi-center MRI scans, the dataset is curated to benchmark algorithms for Liver Segmentation (LiSeg) and Liver Fibrosis Staging (LiFS) under complex real-world conditions, including domain shif...",
      "pdf_url": "https://arxiv.org/pdf/2512.07651v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Bridging CORDEX and CMIP6: Machine Learning Downscaling for Wind and Solar Energy Droughts in Central Europe",
      "arxiv_id": "2512.07429v1",
      "published": "2025-12-08 11:03:15+00:00",
      "year": 2025,
      "authors": "Nina Effenberger, Maxim Samarin, Maybritt Schillinger, Reto Knutti",
      "summary": "Reliable regional climate information is essential for assessing the impacts of climate change and for planning in sectors such as renewable energy; yet, producing high-resolution projections through coordinated initiatives like CORDEX that run multiple physical regional climate models is both computationally demanding and difficult to organize. Machine learning emulators that learn the mapping between global and regional climate fields offer a promising way to address these limitations. Here we...",
      "pdf_url": "https://arxiv.org/pdf/2512.07429v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Microseismic event classification with a lightweight Fourier Neural Operator model",
      "arxiv_id": "2512.07425v1",
      "published": "2025-12-08 10:57:36+00:00",
      "year": 2025,
      "authors": "Ayrat Abdullin, Umair bin Waheed, Leo Eisner, Abdullatif Al-Shuhail",
      "summary": "Real-time monitoring of induced seismicity is crucial for mitigating operational hazards, relying on the rapid and accurate classification of microseismic events from continuous data streams. However, while many deep learning models excel at this task, their high computational requirements often limit their practical application in real-time monitoring systems. To address this limitation, a lightweight model based on the Fourier Neural Operator (FNO) is proposed for microseismic event classifica...",
      "pdf_url": "https://arxiv.org/pdf/2512.07425v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Debiasing Diffusion Priors via 3D Attention for Consistent Gaussian Splatting",
      "arxiv_id": "2512.07345v1",
      "published": "2025-12-08 09:33:39+00:00",
      "year": 2025,
      "authors": "Shilong Jin, Haoran Duan, Litao Hua, Wentao Huang, Yuan Zhou",
      "summary": "Versatile 3D tasks (e.g., generation or editing) that distill from Text-to-Image (T2I) diffusion models have attracted significant research interest for not relying on extensive 3D training data. However, T2I models exhibit limitations resulting from prior view bias, which produces conflicting appearances between different views of an object. This bias causes subject-words to preferentially activate prior view features during cross-attention (CA) computation, regardless of the target view condit...",
      "pdf_url": "https://arxiv.org/pdf/2512.07345v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Integrating Multi-scale and Multi-filtration Topological Features for Medical Image Classification",
      "arxiv_id": "2512.07190v1",
      "published": "2025-12-08 06:02:02+00:00",
      "year": 2025,
      "authors": "Pengfei Gu, Huimin Li, Haoteng Tang, Dongkuan, Xu, Erik Enriquez, DongChul Kim, Bin Fu, Danny Z. Chen",
      "summary": "Modern deep neural networks have shown remarkable performance in medical image classification. However, such networks either emphasize pixel-intensity features instead of fundamental anatomical structures (e.g., those encoded by topological invariants), or they capture only simple topological features via single-parameter persistence. In this paper, we propose a new topology-guided classification framework that extracts multi-scale and multi-filtration persistent topological features and integra...",
      "pdf_url": "https://arxiv.org/pdf/2512.07190v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Distributed Traffic State Estimation in V2X-Enabled Connected Vehicle Networks",
      "arxiv_id": "2512.06765v1",
      "published": "2025-12-07 09:59:34+00:00",
      "year": 2025,
      "authors": "Vincent de Heij, M. Umar B. Niazi, Saeed Ahmed, Karl Henrik Johansson",
      "summary": "This paper presents a distributed traffic state estimation framework in which infrastructure sensors and connected vehicles act as autonomous, cooperative sensing nodes. These nodes share local traffic estimates with nearby nodes using Vehicle-to-Everything (V2X) communication. The proposed estimation algorithm uses a distributed Kalman filter tailored to a second-order macroscopic traffic flow model. To achieve global state awareness, the algorithm employs a consensus protocol to fuse heterogen...",
      "pdf_url": "https://arxiv.org/pdf/2512.06765v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "From Forecast to Action: A Deep Learning Model for Predicting Power Outages During Tropical Cyclones",
      "arxiv_id": "2512.06644v1",
      "published": "2025-12-07 03:45:34+00:00",
      "year": 2025,
      "authors": "Yongchuan Yang, Naiyu Wang, Zhenguo Wang, Min Ouyang, Can Wan",
      "summary": "Power outages caused by tropical cyclones (TCs) pose serious risks to electric power systems and the communities they serve. Accurate, high-resolution outage forecasting is essential for enabling both proactive mitigation planning and real-time emergency response. This study introduces the SpatioTemporal Outage ForeCAST (STO-CAST) model, a deep learning framework developed for real-time, regional-scale outage prediction during TC events with high-resolution outputs in both space and time. STO-CA...",
      "pdf_url": "https://arxiv.org/pdf/2512.06644v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "From Remote Sensing to Multiple Time Horizons Forecasts: Transformers Model for CyanoHAB Intensity in Lake Champlain",
      "arxiv_id": "2512.06598v1",
      "published": "2025-12-06 23:51:45+00:00",
      "year": 2025,
      "authors": "Muhammad Adil, Patrick J. Clemins, Andrew W. Schroth, Panagiotis D. Oikonomou, Donna M. Rizzo, Peter D. F. Isles, Xiaohan Zhang, Kareem I. Hannoun, Scott Turnbull, Noah B. Beckage, Asim Zia, Safwan Wshah",
      "summary": "Cyanobacterial Harmful Algal Blooms (CyanoHABs) pose significant threats to aquatic ecosystems and public health globally. Lake Champlain is particularly vulnerable to recurring CyanoHAB events, especially in its northern segment: Missisquoi Bay, St. Albans Bay, and Northeast Arm, due to nutrient enrichment and climatic variability. Remote sensing provides a scalable solution for monitoring and forecasting these events, offering continuous coverage where in situ observations are sparse or unavai...",
      "pdf_url": "https://arxiv.org/pdf/2512.06598v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Bridging spatial awareness and global context in medical image segmentation",
      "arxiv_id": "2512.06560v1",
      "published": "2025-12-06 20:25:24+00:00",
      "year": 2025,
      "authors": "Dalia Alzu'bi, A. Ben Hamza",
      "summary": "Medical image segmentation is a fundamental task in computer-aided diagnosis, requiring models that balance segmentation accuracy and computational efficiency. However, existing segmentation models often struggle to effectively capture local and global contextual information, leading to boundary pixel loss and segmentation errors. In this paper, we propose U-CycleMLP, a novel U-shaped encoder-decoder network designed to enhance segmentation performance while maintaining a lightweight architectur...",
      "pdf_url": "https://arxiv.org/pdf/2512.06560v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "AI as \"Co-founder\": GenAI for Entrepreneurship",
      "arxiv_id": "2512.06506v1",
      "published": "2025-12-06 17:36:36+00:00",
      "year": 2025,
      "authors": "Junhui Jeff Cai, Xian Gu, Liugang Sheng, Mengjia Xia, Linda Zhao, Wu Zhu",
      "summary": "This paper studies whether, how, and for whom generative artificial intelligence (GenAI) facilitates firm creation. Our identification strategy exploits the November 2022 release of ChatGPT as a global shock that lowered start-up costs and leverages variations across geo-coded grids with differential pre-existing AI-specific human capital. Using high-resolution and universal data on Chinese firm registrations by the end of 2024, we find that grids with stronger AI-specific human capital experien...",
      "pdf_url": "https://arxiv.org/pdf/2512.06506v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "HuPrior3R: Incorporating Human Priors for Better 3D Dynamic Reconstruction from Monocular Videos",
      "arxiv_id": "2512.06368v2",
      "published": "2025-12-06 09:42:56+00:00",
      "year": 2025,
      "authors": "Weitao Xiong, Zhiyuan Yuan, Jiahao Lu, Chengfeng Zhao, Peng Li, Yuan Liu",
      "summary": "Monocular dynamic video reconstruction faces significant challenges in dynamic human scenes due to geometric inconsistencies and resolution degradation issues. Existing methods lack 3D human structural understanding, producing geometrically inconsistent results with distorted limb proportions and unnatural human-object fusion, while memory-constrained downsampling causes human boundary drift toward background geometry. To address these limitations, we propose to incorporate hybrid geometric prio...",
      "pdf_url": "https://arxiv.org/pdf/2512.06368v2",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "TriaGS: Differentiable Triangulation-Guided Geometric Consistency for 3D Gaussian Splatting",
      "arxiv_id": "2512.06269v1",
      "published": "2025-12-06 03:45:39+00:00",
      "year": 2025,
      "authors": "Quan Tran, Tuan Dang",
      "summary": "3D Gaussian Splatting is crucial for real-time novel view synthesis due to its efficiency and ability to render photorealistic images. However, building a 3D Gaussian is guided solely by photometric loss, which can result in inconsistencies in reconstruction. This under-constrained process often results in \"floater\" artifacts and unstructured geometry, preventing the extraction of high-fidelity surfaces. To address this issue, our paper introduces a novel method that improves reconstruction by e...",
      "pdf_url": "https://arxiv.org/pdf/2512.06269v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "A pan-galaxy study of synthetic giant molecular filaments: a turbulence-dominated life cycle",
      "arxiv_id": "2512.06241v1",
      "published": "2025-12-06 01:41:42+00:00",
      "year": 2025,
      "authors": "Zipeng Hu, Ke Wang, Mark R. Krumholz, Keyun Su",
      "summary": "Recent surveys of the Galactic plane have revealed dozens of giant molecular filaments (GMFs), with lengths ranging from tens to hundreds of parsecs, yet their origins and life cycles remain debated. In this work, we analyze over 700 GMFs identified from synthetic CO emission maps of a high-resolution magnetohydrodynamic simulation of a Milky Way-like galaxy, whose lengths range from $\\sim 10$ pc to $\\sim 300$ pc. We find that turbulent shock from galactic shear and stellar feedback are the prim...",
      "pdf_url": "https://arxiv.org/pdf/2512.06241v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Capturing Classic Authorial Style in Long-Form Story Generation with GRPO Fine-Tuning",
      "arxiv_id": "2512.05747v1",
      "published": "2025-12-05 14:29:27+00:00",
      "year": 2025,
      "authors": "Jinlong Liu, Mohammed Bahja, Venelin Kovatchev, Mark Lee",
      "summary": "Recent advances in large language models (LLMs) show impressive performance in open-ended story generation, but fine-grained stylistic control remains limited. Existing methods often rely on shallow cues (e.g., names or topics) to simulate authorial style, without robust evaluation. In this work, we present a training framework for style-conditioned story generation using Group Relative Policy Optimization (GRPO) and a custom multi-reward setup. The style reward is derived from a fine-tuned sent...",
      "pdf_url": "https://arxiv.org/pdf/2512.05747v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Refined HLA Linkage Disequilibrium Architectures of World Populations by a Novel Allelic Correlation Measure",
      "arxiv_id": "2512.05573v1",
      "published": "2025-12-05 09:55:22+00:00",
      "year": 2025,
      "authors": "Fei Zhang, Weixiong Zhang",
      "summary": "Numerous diseases, particularly autoimmune disorders, are associated with the human leukocyte antigen (HLA), a small genomic region located on human chromosome 6. Adequate characterization of linkage disequilibrium (LD) in the HLA across populations is crucial for identifying genetic markers associated with specific traits and phenotypes. However, current LD measures often fail to capture HLA's structural complexity due to methodological limitations and sensitivity to low-frequency variants, mar...",
      "pdf_url": "https://arxiv.org/pdf/2512.05573v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Conscious Gaze: Adaptive Attention Mechanisms for Hallucination Mitigation in Vision-Language Models",
      "arxiv_id": "2512.05546v1",
      "published": "2025-12-05 09:07:55+00:00",
      "year": 2025,
      "authors": "Weijue Bu, Guan Yuan, Guixian Zhang",
      "summary": "Large Vision-Language Models (VLMs) often exhibit text inertia, where attention drifts from visual evidence toward linguistic priors, resulting in object hallucinations. Existing decoding strategies intervene only at the output logits and thus cannot correct internal reasoning drift, while recent internal-control methods based on heuristic head suppression or global steering vectors lack principled grounding. We introduce Conscious Gaze (CG-VLM), a training-free, inference-time framework that co...",
      "pdf_url": "https://arxiv.org/pdf/2512.05546v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Privacy-Preserving Fully Distributed Gaussian Process Regression",
      "arxiv_id": "2512.05473v1",
      "published": "2025-12-05 07:05:54+00:00",
      "year": 2025,
      "authors": "Yeongjun Jang, Kaoru Teranishi, Jihoon Suh, Takashi Tanaka",
      "summary": "Although distributed Gaussian process regression (GPR) enables multiple agents with separate datasets to jointly learn a model of the target function, its collaborative nature poses risks of private data leakage. To address this, we propose a privacy-preserving fully distributed GPR protocol based on secure multi-party computation (SMPC) that preserves the confidentiality of each agent's local dataset. Building upon a secure distributed average consensus algorithm, the protocol guarantees that e...",
      "pdf_url": "https://arxiv.org/pdf/2512.05473v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "China Regional 3km Downscaling Based on Residual Corrective Diffusion Model",
      "arxiv_id": "2512.05377v2",
      "published": "2025-12-05 02:27:08+00:00",
      "year": 2025,
      "authors": "Honglu Sun, Hao Jing, Zhixiang Dai, Sa Xiao, Wei Xue, Jian Sun, Qifeng Lu",
      "summary": "A fundamental challenge in numerical weather prediction is to efficiently produce high-resolution forecasts. A common solution is applying downscaling methods, which include dynamical downscaling and statistical downscaling, to the outputs of global models. This work focuses on statistical downscaling, which establishes statistical relationships between low-resolution and high-resolution historical data using statistical models. Deep learning has emerged as a powerful tool for this task, giving ...",
      "pdf_url": "https://arxiv.org/pdf/2512.05377v2",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Your Latent Mask is Wrong: Pixel-Equivalent Latent Compositing for Diffusion Models",
      "arxiv_id": "2512.05198v1",
      "published": "2025-12-04 19:07:42+00:00",
      "year": 2025,
      "authors": "Rowan Bradbury, Dazhi Zhong",
      "summary": "Latent inpainting in diffusion models still relies almost universally on linearly interpolating VAE latents under a downsampled mask. We propose a key principle for compositing image latents: Pixel-Equivalent Latent Compositing (PELC). An equivalent latent compositor should be the same as compositing in pixel space. This principle enables full-resolution mask control and true soft-edge alpha compositing, even though VAEs compress images 8x spatially. Modern VAEs capture global context beyond pat...",
      "pdf_url": "https://arxiv.org/pdf/2512.05198v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Virtually Unrolling the Herculaneum Papyri by Diffeomorphic Spiral Fitting",
      "arxiv_id": "2512.04927v1",
      "published": "2025-12-04 15:57:35+00:00",
      "year": 2025,
      "authors": "Paul Henderson",
      "summary": "The Herculaneum Papyri are a collection of rolled papyrus documents that were charred and buried by the famous eruption of Mount Vesuvius. They promise to contain a wealth of previously unseen Greek and Latin texts, but are extremely fragile and thus most cannot be unrolled physically. A solution to access these texts is virtual unrolling, where the papyrus surface is digitally traced out in a CT scan of the scroll, to create a flattened representation. This tracing is very laborious to do manua...",
      "pdf_url": "https://arxiv.org/pdf/2512.04927v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "CIG-MAE: Cross-Modal Information-Guided Masked Autoencoder for Self-Supervised WiFi Sensing",
      "arxiv_id": "2512.04723v1",
      "published": "2025-12-04 12:06:48+00:00",
      "year": 2025,
      "authors": "Gang Liu, Yanling Hao, Yixuan Zou",
      "summary": "Human Action Recognition using WiFi Channel State Information (CSI) has emerged as an attractive alternative to vision-based methods due to its ubiquity, device-agnostic nature, and inherent privacy-preserving capabilities. However, the high cost of manual annotation and the limited scale of publicly available CSI datasets restrict the performance of supervised approaches. Self-supervised learning (SSL) offers a promising avenue, but existing contrastive paradigms rely on data augmentations that...",
      "pdf_url": "https://arxiv.org/pdf/2512.04723v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "The Fractured Metropolis: Optimization Cutoffs, Uneven Congestion, and the Spatial Politics of Globalization",
      "arxiv_id": "2512.05163v1",
      "published": "2025-12-04 12:02:47+00:00",
      "year": 2025,
      "authors": "Dong Yang",
      "summary": "The divergence in globalization strategies between the US (retrenchment and polarization) and China (expansion) presents a puzzle that traditional distributional theories fail to fully explain. This paper offers a novel framework by conceptualizing the globalized economy as a \"Congestible Club Good,\" leading to a \"Fractured Metropolis.\" We argue that globalization flows ($M$) are constrained by domestic Institutional Capacity ($K$), which is heterogeneous and historically contingent. We introduc...",
      "pdf_url": "https://arxiv.org/pdf/2512.05163v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "DuGI-MAE: Improving Infrared Mask Autoencoders via Dual-Domain Guidance",
      "arxiv_id": "2512.04511v1",
      "published": "2025-12-04 06:45:20+00:00",
      "year": 2025,
      "authors": "Yinghui Xing, Xiaoting Su, Shizhou Zhang, Donghao Chu, Di Xu",
      "summary": "Infrared imaging plays a critical role in low-light and adverse weather conditions. However, due to the distinct characteristics of infrared images, existing foundation models such as Masked Autoencoder (MAE) trained on visible data perform suboptimal in infrared image interpretation tasks. To bridge this gap, an infrared foundation model known as InfMAE was developed and pre-trained on large-scale infrared datasets. Despite its effectiveness, InfMAE still faces several limitations, including th...",
      "pdf_url": "https://arxiv.org/pdf/2512.04511v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "UltraImage: Rethinking Resolution Extrapolation in Image Diffusion Transformers",
      "arxiv_id": "2512.04504v1",
      "published": "2025-12-04 06:24:04+00:00",
      "year": 2025,
      "authors": "Min Zhao, Bokai Yan, Xue Yang, Hongzhou Zhu, Jintao Zhang, Shilong Liu, Chongxuan Li, Jun Zhu",
      "summary": "Recent image diffusion transformers achieve high-fidelity generation, but struggle to generate images beyond these scales, suffering from content repetition and quality degradation. In this work, we present UltraImage, a principled framework that addresses both issues. Through frequency-wise analysis of positional embeddings, we identify that repetition arises from the periodicity of the dominant frequency, whose period aligns with the training resolution. We introduce a recursive dominant frequ...",
      "pdf_url": "https://arxiv.org/pdf/2512.04504v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "AI-Assisted Game Management Decisions: A Fuzzy Logic Approach to Real-Time Soccer Substitutions",
      "arxiv_id": "2512.04480v2",
      "published": "2025-12-04 05:33:28+00:00",
      "year": 2025,
      "authors": "Pedro Passos",
      "summary": "In elite soccer, substitution decisions entail significant financial and sporting consequences yet remain heavily reliant on intuition or predictive models that merely mimic historical biases. This paper introduces a Fuzzy Logic based Decision Support System (DSS) designed for real time, prescriptive game management. Unlike traditional Machine Learning approaches that encounter a predictive ceiling by attempting to replicate human behavior, our system audits performance through an objective, rul...",
      "pdf_url": "https://arxiv.org/pdf/2512.04480v2",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Distributed Articulation Point Identification in Time-Varying Undirected Networks",
      "arxiv_id": "2512.04409v1",
      "published": "2025-12-04 03:13:17+00:00",
      "year": 2025,
      "authors": "Xinye Xie, Ronghao Zheng, Senlin Zhang, Meiqin Liu",
      "summary": "Identifying articulation points (APs) is fundamental to assessing the robustness of time-varying networks. In such dynamic environments, topological changes including edge additions and deletions can instantly alter the set of APs, demanding rapid and efficient re-assessment. This paper proposes a fully distributed algorithm for identifying APs and monitoring biconnectivity. Our core contribution is an incremental update protocol. Unlike static methods that require global re-initialization which...",
      "pdf_url": "https://arxiv.org/pdf/2512.04409v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "LangSAT: A Novel Framework Combining NLP and Reinforcement Learning for SAT Solving",
      "arxiv_id": "2512.04374v1",
      "published": "2025-12-04 01:47:06+00:00",
      "year": 2025,
      "authors": "Muyu Pan, Matthew Walter, Dheeraj Kodakandla, Mahfuza Farooque",
      "summary": "Our work presents a novel reinforcement learning (RL) based framework to optimize heuristic selection within the conflict-driven clause learning (CDCL) process, improving the efficiency of Boolean satisfiability (SAT) solving. The proposed system, LangSAT, bridges the gap between natural language inputs and propositional logic by converting English descriptions into Conjunctive Normal Form (CNF) expressions and solving them using an RL-enhanced CDCL SAT solver. Unlike existing SAT-solving platfo...",
      "pdf_url": "https://arxiv.org/pdf/2512.04374v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "A Lyapunov-based MPC for Distributed Multi Agent Systems with Time Delays and Packet Dropouts using Hidden Markov Models",
      "arxiv_id": "2512.03708v1",
      "published": "2025-12-03 11:58:12+00:00",
      "year": 2025,
      "authors": "Loaie Solyman, Aamir Ahmad, Ayman El-Badawy",
      "summary": "We propose a SCHMM LMPC framework, integrating Semi Continuous Hidden Markov Models with Lyapunov based Model Predictive Control, for distributed optimal control of multi agent systems under network imperfections. The SCHMM captures the stochastic network behavior in real time, while LMPC ensures consensus and optimality via Linear Matrix Inequalities LMIs. The developed optimal control problem simultaneously minimizes three elements. First, the control effort is reduced to avoid aggressive inpu...",
      "pdf_url": "https://arxiv.org/pdf/2512.03708v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Multi-Scale Visual Prompting for Lightweight Small-Image Classification",
      "arxiv_id": "2512.03663v1",
      "published": "2025-12-03 10:51:18+00:00",
      "year": 2025,
      "authors": "Salim Khazem",
      "summary": "Visual prompting has recently emerged as an efficient strategy to adapt vision models using lightweight, learnable parameters injected into the input space. However, prior work mainly targets large Vision Transformers and high-resolution datasets such as ImageNet. In contrast, small-image benchmarks like MNIST, Fashion-MNIST, and CIFAR-10 remain widely used in education, prototyping, and research, yet have received little attention in the context of prompting. In this paper, we introduce \\textbf...",
      "pdf_url": "https://arxiv.org/pdf/2512.03663v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "DM3D: Deformable Mamba via Offset-Guided Gaussian Sequencing for Point Cloud Understanding",
      "arxiv_id": "2512.03424v1",
      "published": "2025-12-03 03:57:41+00:00",
      "year": 2025,
      "authors": "Bin Liu, Chunyang Wang, Xuelian Liu",
      "summary": "State Space Models (SSMs) demonstrate significant potential for long-sequence modeling, but their reliance on input order conflicts with the irregular nature of point clouds. Existing approaches often rely on predefined serialization strategies, which cannot adjust based on diverse geometric structures. To overcome this limitation, we propose \\textbf{DM3D}, a deformable Mamba architecture for point cloud understanding. Specifically, DM3D introduces an offset-guided Gaussian sequencing mechanism ...",
      "pdf_url": "https://arxiv.org/pdf/2512.03424v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Hierarchical Attention for Sparse Volumetric Anomaly Detection in Subclinical Keratoconus",
      "arxiv_id": "2512.03346v1",
      "published": "2025-12-03 01:20:13+00:00",
      "year": 2025,
      "authors": "Lynn Kandakji, William Woof, Nikolas Pontikos",
      "summary": "The detection of weak, spatially distributed anomalies in volumetric medical imaging remains a major challenge. The subtle, non-adjacent nature of early disease signals is often lost due to suboptimal architectural inductive biases: 2D/3D CNNs impose strong locality, while ViTs diffuse unconstrained global attention. This conflict leaves the optimal inductive structure for robust, sparse volumetric pattern recognition unresolved. This study presents a controlled comparison of sixteen modern deep...",
      "pdf_url": "https://arxiv.org/pdf/2512.03346v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "A three-dimensional model for the reversal in the local large-scale interstellar magnetic field",
      "arxiv_id": "2512.03332v2",
      "published": "2025-12-03 00:52:11+00:00",
      "year": 2025,
      "authors": "Rebecca A. Booth, Anna Ordog, Jo-Anne Brown, T. L. Landecker, Alex S. Hill, Jennifer L. West, Minjie Lei, S. E. Clark, Andrea Bracco, John M. Dickey, Ettore Carretti",
      "summary": "We probe the three-dimensional geometry of the large-scale Galactic magnetic field within 1 kpc of the Sun using the Dominion Radio Astrophysical Observatory (DRAO) Global Magneto-Ionic Medium Survey (GMIMS) of the Northern Sky (DRAGONS). DRAGONS is a new full polarization survey of the Northern sky from 350 to 1030 MHz covering declinations -20° < $δ$ < 90° and a component of GMIMS. The first moment of the Faraday depth spectra produced from DRAGONS above 500 MHz reveals large-angular-scale Far...",
      "pdf_url": "https://arxiv.org/pdf/2512.03332v2",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "The First Crypto President: Presidential Power and Cryptocurrency Markets During Trump's Second Term (2025-2029)",
      "arxiv_id": "2512.03189v1",
      "published": "2025-12-02 19:39:03+00:00",
      "year": 2025,
      "authors": "Habib Badawi",
      "summary": "This paper analyzes the intersection of presidential authority and cryptocurrency markets during Donald J. Trump's second term (2025-2029). We examine developments from 2024 through October 2025, focusing on how executive influence, family business ventures, and digital assets became intertwined in ways that blurred boundaries between public office and private profit. Using a mixed-methods approach that combines quantitative market data with qualitative institutional assessment, we identify poli...",
      "pdf_url": "https://arxiv.org/pdf/2512.03189v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "High-angular-resolution ALMA imaging of the inhomogeneous dynamical atmosphere of the asymptotic giant branch star W Hya",
      "arxiv_id": "2512.03156v1",
      "published": "2025-12-02 19:02:25+00:00",
      "year": 2025,
      "authors": "K. Ohnaka, K. T. Wong, G. Weigelt, K. -H. Hofmann",
      "summary": "We present high-angular-resolution imaging of the asymptotic giant branch star W Hya with the Atacama Large Millimeter/submillimeter Array (ALMA) to probe the dynamics and chemistry in the atmosphere and inner wind. W Hya was observed with the longest baselines of ALMA at 250-268 GHz with an angular resolution of ~17x20 mas. ALMA's high angular resolution allowed us to resolve the stellar disk of W Hya, along with clumpy, irregularly shaped emission extending to ~100 mas: plume in the north-nort...",
      "pdf_url": "https://arxiv.org/pdf/2512.03156v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "GNSS Array-Based Multipath Detection Employing UKF on Manifolds",
      "arxiv_id": "2512.02994v1",
      "published": "2025-12-02 18:18:24+00:00",
      "year": 2025,
      "authors": "Abdelgabar Ahmed, Tarig Ballal, Xing Liu, Mohanad Ahmed, Tareq Y. Al-Naffouri",
      "summary": "Global Navigation Satellite Systems (GNSS) applications are often hindered by various sources of error, with multipath interference being one of the most challenging, particularly in urban environments. In this work, we build on previous research by implementing a GNSS array-based multipath detection algorithm, incorporating real-time attitude estimation for dynamic scenarios. The method fuses GNSS and IMU data using an Unscented Kalman Filter (UKF) on a manifold, enabling continuous attitude tr...",
      "pdf_url": "https://arxiv.org/pdf/2512.02994v1",
      "category": "replication",
      "query_name": "cross_region_replication",
      "is_us_institution": false
    },
    {
      "title": "Towards Practical and Usable In-network Classification",
      "arxiv_id": "2512.09809v1",
      "published": "2025-12-10 16:24:59+00:00",
      "year": 2025,
      "authors": "Di Zhu, Jianxi Chen, Hyojoon Kim",
      "summary": "In-network machine learning enables real-time classification directly on network hardware, offering consistently low inference latency. However, current solutions are limited by strict hardware constraints, scarce on-device resources, and poor usability, making them impractical for ML developers and cloud operators. To this end, we propose ACORN, an end-to-end system that automates the distributed deployment of practical machine learning models across the network. ACORN provides a fully automate...",
      "pdf_url": "https://arxiv.org/pdf/2512.09809v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Eunomia: A Multicontroller Domain Partitioning Framework in Hierarchical Satellite Network",
      "arxiv_id": "2512.09345v1",
      "published": "2025-12-10 06:07:45+00:00",
      "year": 2025,
      "authors": "Qi Zhang, Kun Qiu, Zhe Chen, Wenjun Zhu, Xiaofan Xu, Ping Du, Yue Gao",
      "summary": "With the rise of mega-satellite constellations, the integration of hierarchical non-terrestrial and terrestrial networks has become a cornerstone of 6G coverage enhancements. In these hierarchical satellite networks, controllers manage satellite switches within their assigned domains. However, the high mobility of LEO satellites and field-of-view (FOV) constraints pose fundamental challenges to efficient domain partitioning. Centralized control approaches face scalability bottlenecks, while dist...",
      "pdf_url": "https://arxiv.org/pdf/2512.09345v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Traffic Scene Small Target Detection Method Based on YOLOv8n-SPTS Model for Autonomous Driving",
      "arxiv_id": "2512.09296v1",
      "published": "2025-12-10 03:46:57+00:00",
      "year": 2025,
      "authors": "Songhan Wu",
      "summary": "This paper focuses on the key issue in autonomous driving: small target recognition in dynamic perception. Existing algorithms suffer from poor detection performance due to missing small target information, scale imbalance, and occlusion. We propose an improved YOLOv8n-SPTS model, which enhances the detection accuracy of small traffic targets through three key innovations: First, optimizing the feature extraction module. In the Backbone Bottleneck structure of YOLOv8n, 4 traditional convolution ...",
      "pdf_url": "https://arxiv.org/pdf/2512.09296v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Efficient MoE Serving in the Memory-Bound Regime: Balance Activated Experts, Not Tokens",
      "arxiv_id": "2512.09277v1",
      "published": "2025-12-10 02:57:35+00:00",
      "year": 2025,
      "authors": "Yanpeng Yu, Haiyue Ma, Krish Agarwal, Nicolai Oswald, Qijing Huang, Hugo Linsenmaier, Chunhui Mei, Ritchie Zhao, Ritika Borkar, Bita Darvish Rouhani, David Nellans, Ronny Krashinsky, Anurag Khandelwal",
      "summary": "Expert Parallelism (EP) permits Mixture of Experts (MoE) models to scale beyond a single GPU. To address load imbalance across GPUs in EP, existing approaches aim to balance the number of tokens each GPU processes. Surprisingly, we find that this objective degrades performance rather than improving it when processing is memory-bound - a common occurrence in MoE serving, especially in the decode phase. Our analysis reveals that balancing the number of tokens processed per GPU increases the number...",
      "pdf_url": "https://arxiv.org/pdf/2512.09277v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Astra: General Interactive World Model with Autoregressive Denoising",
      "arxiv_id": "2512.08931v1",
      "published": "2025-12-09 18:59:57+00:00",
      "year": 2025,
      "authors": "Yixuan Zhu, Jiaqi Feng, Wenzhao Zheng, Yuan Gao, Xin Tao, Pengfei Wan, Jie Zhou, Jiwen Lu",
      "summary": "Recent advances in diffusion transformers have empowered video generation models to generate high-quality video clips from texts or images. However, world models with the ability to predict long-horizon futures from past observations and actions remain underexplored, especially for general-purpose scenarios and various forms of actions. To bridge this gap, we introduce Astra, an interactive general world model that generates real-world futures for diverse scenarios (e.g., autonomous driving, rob...",
      "pdf_url": "https://arxiv.org/pdf/2512.08931v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "C-DIRA: Computationally Efficient Dynamic ROI Routing and Domain-Invariant Adversarial Learning for Lightweight Driver Behavior Recognition",
      "arxiv_id": "2512.08647v2",
      "published": "2025-12-09 14:35:35+00:00",
      "year": 2025,
      "authors": "Keito Inoshita",
      "summary": "Driver distraction behavior recognition using in-vehicle cameras demands real-time inference on edge devices. However, lightweight models often fail to capture fine-grained behavioral cues, resulting in reduced performance on unseen drivers or under varying conditions. ROI-based methods also increase computational cost, making it difficult to balance efficiency and accuracy. This work addresses the need for a lightweight architecture that overcomes these constraints. We propose Computationally e...",
      "pdf_url": "https://arxiv.org/pdf/2512.08647v2",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Laser-pumped drilling carbon nanotube vortex shock waves in optical fibers",
      "arxiv_id": "2512.08538v1",
      "published": "2025-12-09 12:36:35+00:00",
      "year": 2025,
      "authors": "Ricardo E. da Silva, Marcos A. R. Franco",
      "summary": "We experimentally demonstrate laser-induced vortex shock waves formed by carbon nanotubes drilling optical fibers for the first time. Three samples of standard single-mode optical fibers (SMF) are sequentially inserted in a syringe loaded with a 1 mL solution of single-walled carbon nanotubes (CNT) and methanol, and a high-power laser is injected into the fibers for 5 (SMF 1), 10 (SMF 2), and 20 (SMF 3) minutes. The CNT solution thermally expands and generates vortex acoustic flows, which are co...",
      "pdf_url": "https://arxiv.org/pdf/2512.08538v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Higher Josephson harmonics in a tunable double-junction transmon qubit",
      "arxiv_id": "2512.08470v1",
      "published": "2025-12-09 10:42:06+00:00",
      "year": 2025,
      "authors": "Ksenia Shagalov, David Feldstein-Bofill, Leo Uhre Jakobsen, Zhenhai Sun, Casper Wied, Amalie T. J. Paulsen, Johann Bock Severin, Malthe A. Marciniak, Clinton A. Potts, Anders Kringhøj, Jacob Hastrup, Karsten Flensberg, Svend Krøjer, Morten Kjaergaard",
      "summary": "Tunable Josephson harmonics open up for new qubit design. We demonstrate a superconducting circuit element with a tunnel junction in series with a SQUID loop, yielding a highly magnetic-flux tunable harmonic content of the Josephson potential. We analyze spectroscopy of the first four qubit transitions with a circuit model which includes the internal mode, revealing a second harmonic up to $\\sim10\\%$ of the fundamental harmonic. Interestingly, a sweet spot where the dispersive shift vanishes is ...",
      "pdf_url": "https://arxiv.org/pdf/2512.08470v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Bi^2MAC: Bimodal Bi-Adaptive Mask-Aware Convolution for Remote Sensing Pansharpening",
      "arxiv_id": "2512.08331v1",
      "published": "2025-12-09 08:00:43+00:00",
      "year": 2025,
      "authors": "Xianghong Xiao, Zeyu Xia, Zhou Fei, Jinliang Xiao, Haorui Chen, Liangjian Deng",
      "summary": "Pansharpening aims to fuse a high-resolution panchromatic (PAN) image with a low-resolution multispectral (LRMS) image to generate a high-resolution multispectral image (HRMS). Conventional deep learning-based methods are inherently limited in their ability to adapt to regional heterogeneity within feature representations. Although various adaptive convolution methods have been proposed to address this limitation, they often suffer from excessive computational costs and a limited ability to capt...",
      "pdf_url": "https://arxiv.org/pdf/2512.08331v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "MoCA: Mixture-of-Components Attention for Scalable Compositional 3D Generation",
      "arxiv_id": "2512.07628v1",
      "published": "2025-12-08 15:17:01+00:00",
      "year": 2025,
      "authors": "Zhiqi Li, Wenhuan Li, Tengfei Wang, Zhenwei Wang, Junta Wu, Haoyuan Wang, Yunhan Yang, Zehuan Huang, Yang Li, Peidong Liu, Chunchao Guo",
      "summary": "Compositionality is critical for 3D object and scene generation, but existing part-aware 3D generation methods suffer from poor scalability due to quadratic global attention costs when increasing the number of components. In this work, we present MoCA, a compositional 3D generative model with two key designs: (1) importance-based component routing that selects top-k relevant components for sparse global attention, and (2) unimportant components compression that preserve contextual priors of unse...",
      "pdf_url": "https://arxiv.org/pdf/2512.07628v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Microseismic event classification with a lightweight Fourier Neural Operator model",
      "arxiv_id": "2512.07425v1",
      "published": "2025-12-08 10:57:36+00:00",
      "year": 2025,
      "authors": "Ayrat Abdullin, Umair bin Waheed, Leo Eisner, Abdullatif Al-Shuhail",
      "summary": "Real-time monitoring of induced seismicity is crucial for mitigating operational hazards, relying on the rapid and accurate classification of microseismic events from continuous data streams. However, while many deep learning models excel at this task, their high computational requirements often limit their practical application in real-time monitoring systems. To address this limitation, a lightweight model based on the Fourier Neural Operator (FNO) is proposed for microseismic event classifica...",
      "pdf_url": "https://arxiv.org/pdf/2512.07425v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "OnePiece: The Great Route to Generative Recommendation -- A Case Study from Tencent Algorithm Competition",
      "arxiv_id": "2512.07424v1",
      "published": "2025-12-08 10:56:56+00:00",
      "year": 2025,
      "authors": "Jiangxia Cao, Shuo Yang, Zijun Wang, Qinghai Tan",
      "summary": "In past years, the OpenAI's Scaling-Laws shows the amazing intelligence with the next-token prediction paradigm in neural language modeling, which pointing out a free-lunch way to enhance the model performance by scaling the model parameters. In RecSys, the retrieval stage is also follows a 'next-token prediction' paradigm, to recall the hunderds of items from the global item set, thus the generative recommendation usually refers specifically to the retrieval stage (without Tree-based methods). ...",
      "pdf_url": "https://arxiv.org/pdf/2512.07424v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Enhancing Urban Sensing Utility with Sensor-enabled Vehicles and Easily Accessible Data",
      "arxiv_id": "2512.07124v1",
      "published": "2025-12-08 03:19:25+00:00",
      "year": 2025,
      "authors": "Hui Zhong, Qing-Long Lu, Qiming Zhang, Hongliang Lu, Xinhu Zheng",
      "summary": "Urban sensing is essential for the development of smart cities, enabling monitoring, computing, and decision-making for urban management.Thanks to the advent of vehicle technologies, modern vehicles are transforming from solely mobility tools to valuable sensors for urban data collection, and hold the potential of improving traffic congestion, transport sustainability, and infrastructure inspection.Vehicle-based sensing is increasingly recognized as a promising technology due to its flexibility,...",
      "pdf_url": "https://arxiv.org/pdf/2512.07124v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "AQUILA: A QUIC-Based Link Architecture for Resilient Long-Range UAV Communication",
      "arxiv_id": "2512.06889v1",
      "published": "2025-12-07 15:30:01+00:00",
      "year": 2025,
      "authors": "Ximing Huang, Yirui Rao",
      "summary": "The proliferation of autonomous Unmanned Aerial Vehicles (UAVs) in Beyond Visual Line of Sight (BVLOS) applications is critically dependent on resilient, high-bandwidth, and low-latency communication links. Existing solutions face critical limitations: TCP's head-of-line blocking stalls time-sensitive data, UDP lacks reliability and congestion control, and cellular networks designed for terrestrial users degrade severely for aerial platforms. This paper introduces AQUILA, a cross-layer communica...",
      "pdf_url": "https://arxiv.org/pdf/2512.06889v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Distributed Traffic State Estimation in V2X-Enabled Connected Vehicle Networks",
      "arxiv_id": "2512.06765v1",
      "published": "2025-12-07 09:59:34+00:00",
      "year": 2025,
      "authors": "Vincent de Heij, M. Umar B. Niazi, Saeed Ahmed, Karl Henrik Johansson",
      "summary": "This paper presents a distributed traffic state estimation framework in which infrastructure sensors and connected vehicles act as autonomous, cooperative sensing nodes. These nodes share local traffic estimates with nearby nodes using Vehicle-to-Everything (V2X) communication. The proposed estimation algorithm uses a distributed Kalman filter tailored to a second-order macroscopic traffic flow model. To achieve global state awareness, the algorithm employs a consensus protocol to fuse heterogen...",
      "pdf_url": "https://arxiv.org/pdf/2512.06765v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "PG-Flow: Deterministic implicit policy gradients for geometric product-form queueing networks",
      "arxiv_id": "2512.06633v1",
      "published": "2025-12-07 02:52:41+00:00",
      "year": 2025,
      "authors": "Youssef Ait El Mahjoub",
      "summary": "Product-form queueing networks (PFQNs) admit steady-state distributions that factorize into local terms, and in many classical PFQNs including Jackson, BCMP, G-networks, and Energy Packet Networks, these marginals are geometric and parametrized by local flow variables satisfying balance equations. While this structure yields closed-form expressions for key performance metrics, its use for deterministic steady-state optimization remains limited. We introduce PG-Flow, a deterministic policy-gradie...",
      "pdf_url": "https://arxiv.org/pdf/2512.06633v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Data-driven functional state estimation of complex networks",
      "arxiv_id": "2512.06614v1",
      "published": "2025-12-07 01:12:08+00:00",
      "year": 2025,
      "authors": "Yuan Zhang, Ziyuan Luo, Wenxuan Xu, Jiayu Wu, Wenqi Cao, Ranbo Cheng, Tingting Qin, Yuanqing Xia, Mohamed Darouach, Aming Li, Tyrone Fernando",
      "summary": "The internal state of a dynamical system, a set of variables that defines its evolving configuration, is often hidden and cannot be fully measured, posing a central challenge for real-time monitoring and control. While observers are designed to estimate these latent states from sensor outputs, their classical designs rely on precise system models, which are often unattainable for complex network systems. Here, we introduce a data-driven framework for estimating a targeted set of state variables,...",
      "pdf_url": "https://arxiv.org/pdf/2512.06614v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Situation-Aware Interactive MPC Switching for Autonomous Driving",
      "arxiv_id": "2512.06182v1",
      "published": "2025-12-05 22:02:53+00:00",
      "year": 2025,
      "authors": "Shuhao Qi, Qiling Aori, Luyao Zhang, Mircea Lazar, Sofie Haesaert",
      "summary": "To enable autonomous driving in interactive traffic scenarios, various model predictive control (MPC) formulations have been proposed, each employing different interaction models. While higher-fidelity models enable more intelligent behavior, they incur increased computational cost. Since strong interactions are relatively infrequent in traffic, a practical strategy for balancing performance and computational overhead is to invoke an appropriate controller based on situational demands. To achiev...",
      "pdf_url": "https://arxiv.org/pdf/2512.06182v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Toward Efficient and Robust Behavior Models for Multi-Agent Driving Simulation",
      "arxiv_id": "2512.05812v2",
      "published": "2025-12-05 15:32:36+00:00",
      "year": 2025,
      "authors": "Fabian Konstantinidis, Moritz Sackmann, Ulrich Hofmann, Christoph Stiller",
      "summary": "Scalable multi-agent driving simulation requires behavior models that are both realistic and computationally efficient. We address this by optimizing the behavior model that controls individual traffic participants. To improve efficiency, we adopt an instance-centric scene representation, where each traffic participant and map element is modeled in its own local coordinate frame. This design enables efficient, viewpoint-invariant scene encoding and allows static map tokens to be reused across si...",
      "pdf_url": "https://arxiv.org/pdf/2512.05812v2",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Open Data, Privacy, and Fair Information Principles: Towards a Balancing Framework",
      "arxiv_id": "2512.05728v1",
      "published": "2025-12-05 14:08:26+00:00",
      "year": 2025,
      "authors": "Frederik Zuiderveen Borgesius, Jonathan Gray, Mireille van Eechoud",
      "summary": "Open data are held to contribute to a wide variety of social and political goals, including strengthening transparency, public participation and democratic accountability, promoting economic growth and innovation, and enabling greater public sector efficiency and cost savings. However, releasing government data that contain personal information may threaten privacy and related rights and interests. In this Article we ask how these privacy interests can be respected, without unduly hampering bene...",
      "pdf_url": "https://arxiv.org/pdf/2512.05728v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "BERTO: an Adaptive BERT-based Network Time Series Predictor with Operator Preferences in Natural Language",
      "arxiv_id": "2512.05721v1",
      "published": "2025-12-05 13:54:31+00:00",
      "year": 2025,
      "authors": "Nitin Priyadarshini Shankar, Vaibhav Singh, Sheetal Kalyani, Christian Maciocco",
      "summary": "We introduce BERTO, a BERT-based framework for traffic prediction and energy optimization in cellular networks. Built on transformer architectures, BERTO delivers high prediction accuracy, while its Balancing Loss Function and prompt-based customization allow operators to adjust the trade-off between power savings and performance. Natural language prompts guide the model to manage underprediction and overprediction in accordance with the operator's intent. Experiments on real-world datasets show...",
      "pdf_url": "https://arxiv.org/pdf/2512.05721v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "LA-RL: Language Action-guided Reinforcement Learning with Safety Guarantees for Autonomous Highway Driving",
      "arxiv_id": "2512.05686v1",
      "published": "2025-12-05 13:02:44+00:00",
      "year": 2025,
      "authors": "Yiming Shu, Jiahui Xu, Jiwei Tang, Ruiyang Gao, Chen Sun",
      "summary": "Autonomous highway driving demands a critical balance between proactive, efficiency-seeking behavior and robust safety guarantees. This paper proposes Language Action-guided Reinforcement Learning (LA-RL) with Safety Guarantees, a novel framework that integrates the semantic reasoning of large language models (LLMs) into the actor-critic architecture with an improved safety layer. Within this framework, task-specific reward shaping harmonizes the dual objectives of maximizing driving efficiency ...",
      "pdf_url": "https://arxiv.org/pdf/2512.05686v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Multi-state Modeling of Delay Evolution in Suburban Rail Transports",
      "arxiv_id": "2512.05521v1",
      "published": "2025-12-05 08:30:29+00:00",
      "year": 2025,
      "authors": "Stefania Colombo, Alfredo Gimenez Zapiola, Francesca Ieva, Simone Vantini",
      "summary": "Train delays are a persistent issue in railway systems, particularly in suburban networks where operational complexity is heightened by frequent services and high passenger volumes. Traditional delay models often overlook the temporal and structural dynamics of real delay propagation.\n  This work applies continuous-time multi-state models to analyze the temporal evolution of delay on the S5 suburban line in Lombardy, Italy. Using detailed operational, meteorological, and contextual data, the stu...",
      "pdf_url": "https://arxiv.org/pdf/2512.05521v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "LoC-Path: Learning to Compress for Pathology Multimodal Large Language Models",
      "arxiv_id": "2512.05391v1",
      "published": "2025-12-05 03:16:46+00:00",
      "year": 2025,
      "authors": "Qingqiao Hu, Weimin Lyu, Meilong Xu, Kehan Qi, Xiaoling Hu, Saumya Gupta, Jiawei Zhou, Chao Chen",
      "summary": "Whole Slide Image (WSI) understanding is fundamentally challenging due to its gigapixel scale and the extreme sparsity of diagnostically relevant regions. Unlike human experts who primarily rely on key areas to arrive at a diagnosis, existing slide-level multimodal large language models (MLLMs) for pathology rely on heavy slide-level encoders that process thousands of patch features in a brute-force manner, resulting in excessive computational cost. In this work, we revisit the WSI-language mode...",
      "pdf_url": "https://arxiv.org/pdf/2512.05391v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Spectrally-selective dynamic radiative thermoregulation via phase engineering",
      "arxiv_id": "2512.05388v1",
      "published": "2025-12-05 03:11:29+00:00",
      "year": 2025,
      "authors": "Qizhang Li, Yuanke Chen, Zhuang Luo, Chenxi Sui, Xubing Wu, Ronghui Wu, Qingsong Fan, Ching-Tai Fu, Pei-Jan Hung, Gangbin Yan, Genesis Higueros, Ting-Hsuan Chen, Po-Chun Hsu",
      "summary": "Maintaining comfortable temperatures for buildings, humans, and devices consumes a substantial portion of global energy, underscoring the urgent need for energy-efficient thermoregulation technologies. Dynamic radiative thermal emitters that can switch between passive cooling and heating modes offer a promising solution, but most existing devices exhibit broadband optical responses, resulting in unwanted parasitic heat exchange and limited performance. Here, we introduce an elegant strategy that...",
      "pdf_url": "https://arxiv.org/pdf/2512.05388v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Hierarchical Reinforcement Learning for the Dynamic VNE with Alternatives Problem",
      "arxiv_id": "2512.05207v1",
      "published": "2025-12-04 19:22:40+00:00",
      "year": 2025,
      "authors": "Ali Al Housseini, Cristina Rottondi, Omran Ayoub",
      "summary": "Virtual Network Embedding (VNE) is a key enabler of network slicing, yet most formulations assume that each Virtual Network Request (VNR) has a fixed topology. Recently, VNE with Alternative topologies (VNEAP) was introduced to capture malleable VNRs, where each request can be instantiated using one of several functionally equivalent topologies that trade resources differently. While this flexibility enlarges the feasible space, it also introduces an additional decision layer, making dynamic emb...",
      "pdf_url": "https://arxiv.org/pdf/2512.05207v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "SQuARE: Structured Query & Adaptive Retrieval Engine For Tabular Formats",
      "arxiv_id": "2512.04292v1",
      "published": "2025-12-03 22:11:45+00:00",
      "year": 2025,
      "authors": "Chinmay Gondhalekar, Urjitkumar Patel, Fang-Chun Yeh",
      "summary": "Accurate question answering over real spreadsheets remains difficult due to multirow headers, merged cells, and unit annotations that disrupt naive chunking, while rigid SQL views fail on files lacking consistent schemas. We present SQuARE, a hybrid retrieval framework with sheet-level, complexity-aware routing. It computes a continuous score based on header depth and merge density, then routes queries either through structure-preserving chunk retrieval or SQL over an automatically constructed r...",
      "pdf_url": "https://arxiv.org/pdf/2512.04292v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "High-order two-component fractional quantum Hall states around filling factor $ν= 1$",
      "arxiv_id": "2512.04050v1",
      "published": "2025-12-03 18:34:06+00:00",
      "year": 2025,
      "authors": "E. Bell, K. W. Baldwin, L. N. Pfeiffer, K. W. West, M. A. Zudov",
      "summary": "Two-component fractional quantum Hall (2C-FQH) states in electron bilayers have been known for decades, yet their experimental realization remained limited to low-order fractions. Here we report on several families of high-order 2C-FQH states that emerge when an in-plane magnetic field drives a controlled monolayer-to-bilayer transition in an ultra-high-mobility GaAs quantum well. These families of states proliferate symmetrically toward the filling factor $ν= 1$, from both $ν= 2/3$ and $ν= 4/3$...",
      "pdf_url": "https://arxiv.org/pdf/2512.04050v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "A Theoretical Framework for Auxiliary-Loss-Free Load Balancing of Sparse Mixture-of-Experts in Large-Scale AI Models",
      "arxiv_id": "2512.03915v2",
      "published": "2025-12-03 16:00:02+00:00",
      "year": 2025,
      "authors": "X. Y. Han, Yuan Zhong",
      "summary": "In large-scale AI training, Sparse Mixture-of-Experts (s-MoE) layers enable scaling by activating only a small subset of experts per token. An operational challenge in this design is load balancing: routing tokens to minimize the number of idle experts, which is important for the efficient utilization of (costly) GPUs. We provide a theoretical framework for analyzing the Auxiliary-Loss-Free Load Balancing (ALF-LB) procedure -- proposed by DeepSeek's Wang et al. (2024) -- by casting it as a one-s...",
      "pdf_url": "https://arxiv.org/pdf/2512.03915v2",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Traffic Image Restoration under Adverse Weather via Frequency-Aware Mamba",
      "arxiv_id": "2512.03852v1",
      "published": "2025-12-03 14:50:20+00:00",
      "year": 2025,
      "authors": "Liwen Pan, Longguang Wang, Guangwei Gao, Jun Wang, Jun Shi, Juncheng Li",
      "summary": "Traffic image restoration under adverse weather conditions remains a critical challenge for intelligent transportation systems. Existing methods primarily focus on spatial-domain modeling but neglect frequency-domain priors. Although the emerging Mamba architecture excels at long-range dependency modeling through patch-wise correlation analysis, its potential for frequency-domain feature extraction remains unexplored. To address this, we propose Frequency-Aware Mamba (FAMamba), a novel framework...",
      "pdf_url": "https://arxiv.org/pdf/2512.03852v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "FFTrainer: Fast Failover in Large-Language Model Training with Almost-Free State Management",
      "arxiv_id": "2512.03644v1",
      "published": "2025-12-03 10:27:35+00:00",
      "year": 2025,
      "authors": "Bohan Zhao, Yuanhong Wang, Chenglin Liu, Jiagi Pan, Guang Yang, Ruitao Liu, Tingrui Zhang, Kai Luo, Wei Xu",
      "summary": "Recent developments in large language models (LLMs) have introduced new requirements for efficient and robust training. As LLM clusters scale, node failures, lengthy recoveries, and bulky checkpoints erode efficiency. Infrequent asynchronous checkpoints trigger costly rollbacks, yet higher frequencies add prohibitive overhead. To address these challenges, we propose FFTrainer, a system designed for robust LLM training. FFTrainer leverages surplus network capacity to quickly save and load states,...",
      "pdf_url": "https://arxiv.org/pdf/2512.03644v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Observation-driven correction of numerical weather prediction for marine winds",
      "arxiv_id": "2512.03606v1",
      "published": "2025-12-03 09:39:44+00:00",
      "year": 2025,
      "authors": "Matteo Peduto, Qidong Yang, Jonathan Giezendanner, Devis Tuia, Sherrie Wang",
      "summary": "Accurate marine wind forecasts are essential for safe navigation, ship routing, and energy operations, yet they remain challenging because observations over the ocean are sparse, heterogeneous, and temporally variable. We reformulate wind forecasting as observation-informed correction of a global numerical weather prediction (NWP) model. Rather than forecasting winds directly, we learn local correction patterns by assimilating the latest in-situ observations to adjust the Global Forecast System ...",
      "pdf_url": "https://arxiv.org/pdf/2512.03606v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "MAGE-ID: A Multimodal Generative Framework for Intrusion Detection Systems",
      "arxiv_id": "2512.03375v1",
      "published": "2025-12-03 02:22:21+00:00",
      "year": 2025,
      "authors": "Mahdi Arab Loodaricheh, Mohammad Hossein Manshaei, Anita Raja",
      "summary": "Modern Intrusion Detection Systems (IDS) face severe challenges due to heterogeneous network traffic, evolving cyber threats, and pronounced data imbalance between benign and attack flows. While generative models have shown promise in data augmentation, existing approaches are limited to single modalities and fail to capture cross-domain dependencies. This paper introduces MAGE-ID (Multimodal Attack Generator for Intrusion Detection), a diffusion-based generative framework that couples tabular f...",
      "pdf_url": "https://arxiv.org/pdf/2512.03375v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Theoretical analysis of beaconless geocast protocols in 1D",
      "arxiv_id": "2512.02663v1",
      "published": "2025-12-02 11:31:19+00:00",
      "year": 2025,
      "authors": "Joachim Gudmundsson, Irina Kostitsyna, Maarten Löffler, Tobias Müller, Vera Sacristán, Rodrigo I. Silveira",
      "summary": "Beaconless geocast protocols are routing protocols used to send messages in mobile ad-hoc wireless networks, in which the only information available to each node is its own location. Messages get routed in a distributed manner: each node uses local decision rules based on the message source and destination, and its own location. In this paper we analyze six different beaconless geocast protocols, focusing on two relevant 1D scenarios. The selection of protocols reflects the most relevant types o...",
      "pdf_url": "https://arxiv.org/pdf/2512.02663v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "SkyMoE: A Vision-Language Foundation Model for Enhancing Geospatial Interpretation with Mixture of Experts",
      "arxiv_id": "2512.02517v1",
      "published": "2025-12-02 08:17:16+00:00",
      "year": 2025,
      "authors": "Jiaqi Liu, Ronghao Fu, Lang Sun, Haoran Liu, Xiao Yang, Weipeng Zhang, Xu Na, Zhuoran Duan, Bo Yang",
      "summary": "The emergence of large vision-language models (VLMs) has significantly enhanced the efficiency and flexibility of geospatial interpretation. However, general-purpose VLMs remain suboptimal for remote sensing (RS) tasks. Existing geospatial VLMs typically adopt a unified modeling strategy and struggle to differentiate between task types and interpretation granularities, limiting their ability to balance local detail perception and global contextual understanding. In this paper, we present SkyMoE,...",
      "pdf_url": "https://arxiv.org/pdf/2512.02517v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Identifying preferred routes of sharing information on social networks",
      "arxiv_id": "2512.02483v1",
      "published": "2025-12-02 07:18:46+00:00",
      "year": 2025,
      "authors": "Rozhin Mohammadikian, Parsa Bigdeli, Behrouz Askari, G. Reza Jafari",
      "summary": "The spread of information has become faster and wider than ever with the advent of social network platforms. The question raised in this study is whether information dissemination in social networks is random or follows a discernible structure. Our results from real-world hashtag data suggest that the spread of hashtags is not random and follows specific patterns. This study proposes two preferential models to explore how news spreads on social media. Specifically, we examine global and local pr...",
      "pdf_url": "https://arxiv.org/pdf/2512.02483v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "StructuredDNA: A Bio-Physical Framework for Energy-Aware Transformer Routing",
      "arxiv_id": "2512.08968v1",
      "published": "2025-12-01 21:34:20+00:00",
      "year": 2025,
      "authors": "Mustapha Hamdi",
      "summary": "The rapid scaling of large computational models has led to a critical increase in energy and compute costs. Inspired by biological systems where structure and function emerge from low-energy configurations, we introduce StructuredDNA, a sparse architecture framework for modular, energy-aware Transformer routing. StructuredDNA replaces dense Mixture-of-Experts routing with a bio-physical, energy-guided routing layer based on semantic energy minimization. Inputs are dynamically grouped into semant...",
      "pdf_url": "https://arxiv.org/pdf/2512.08968v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Dual Randomized Smoothing: Beyond Global Noise Variance",
      "arxiv_id": "2512.01782v1",
      "published": "2025-12-01 15:23:00+00:00",
      "year": 2025,
      "authors": "Chenhao Sun, Yuhao Mao, Martin Vechev",
      "summary": "Randomized Smoothing (RS) is a prominent technique for certifying the robustness of neural networks against adversarial perturbations. With RS, achieving high accuracy at small radii requires a small noise variance, while achieving high accuracy at large radii requires a large noise variance. However, the global noise variance used in the standard RS formulation leads to a fundamental limitation: there exists no global noise variance that simultaneously achieves strong performance at both small ...",
      "pdf_url": "https://arxiv.org/pdf/2512.01782v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Bridging the Scale Gap: Balanced Tiny and General Object Detection in Remote Sensing Imagery",
      "arxiv_id": "2512.01665v1",
      "published": "2025-12-01 13:36:09+00:00",
      "year": 2025,
      "authors": "Zhicheng Zhao, Yin Huang, Lingma Sun, Chenglong Li, Jin Tang",
      "summary": "Tiny object detection in remote sensing imagery has attracted significant research interest in recent years. Despite recent progress, achieving balanced detection performance across diverse object scales remains a formidable challenge, particularly in scenarios where dense tiny objects and large objects coexist. Although large foundation models have revolutionized general vision tasks, their application to tiny object detection remains unexplored due to the extreme scale variation and density di...",
      "pdf_url": "https://arxiv.org/pdf/2512.01665v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Competition among seaports through Mean Field Games and real-world data",
      "arxiv_id": "2512.01438v1",
      "published": "2025-12-01 09:23:09+00:00",
      "year": 2025,
      "authors": "Charles-Albert Lehalle, Giulia Livieri",
      "summary": "This paper presents a Mean Field Game (MFG) model for maritime traffic flow, treating the navigation of ships between seaports as a large-scale stochastic control problem. The MFG framework enables the modeling of agents at a microscopic level as rational decision-makers who seek to optimize their utility, thereby translating complex microscopic behaviors into macroscopic models. We build upon this MFG framework to develop a mesoscopic-scale MFG model that defines the payoff and cost functions f...",
      "pdf_url": "https://arxiv.org/pdf/2512.01438v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Metasurface Holography on a Relative-Phase Manifold for Stable and High Fidelity Tweezer-Array Generation",
      "arxiv_id": "2512.01180v1",
      "published": "2025-12-01 01:38:05+00:00",
      "year": 2025,
      "authors": "Yichen Zhu, Zifeng Li, Xiaopeng Li, Jiacheng Sun, Baichuan Yang, Yi Cui, Tao Li",
      "summary": "We present a new holographic approach for generating large scale, polarization resolved optical tweezer arrays. By analyzing the ideal Jones fields that realize a target pattern, we identify that the fundamental degrees of freedom are the relative phases of the individual tweezers, rather than the full spatial phase profile. Leveraging this insight, we formulate a reverse projection optimization that adjusts only a small set of phase parameters to approximate the ideal operator within the physic...",
      "pdf_url": "https://arxiv.org/pdf/2512.01180v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Age Optimal Sampling and Routing under Intermittent Links and Energy Constraints",
      "arxiv_id": "2512.00985v1",
      "published": "2025-11-30 17:13:26+00:00",
      "year": 2025,
      "authors": "Adem Utku Atasayar, Aimin Li, Çağrı Arı, Elif Uysal",
      "summary": "Links in practical systems, such as satellite-terrestrial integrated networks, exhibit distinct delay distributions, intermittent availability, and heterogeneous energy costs. These characteristics pose significant challenges to maintaining timely and energy-efficient status updates. While link availability restricts feasible transmission routes, routing decisions determine the actual delay and energy expenditure. This paper tackles these challenges by jointly optimizing sampling and routing dec...",
      "pdf_url": "https://arxiv.org/pdf/2512.00985v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "A WASM-Subset Stack Architecture for Low-cost FPGAs using Open-Source EDA Flows",
      "arxiv_id": "2512.00974v1",
      "published": "2025-11-30 16:43:45+00:00",
      "year": 2025,
      "authors": "Aradhya Chakrabarti",
      "summary": "Soft-core processors on resource-constrained FPGAs often suffer from low code density and reliance on proprietary toolchains. This paper details the design, implementation, and evaluation of a 32-bit dual-stack microprocessor architecture optimized for low-cost, resource-constrained Field-Programmable Gate Arrays (FPGAs). Implemented on the Gowin GW1NR-9 (Tang Nano 9K), the processor utilizes an instruction set architecture (ISA) inspired from a subset of the WebAssembly (WASM) specification to ...",
      "pdf_url": "https://arxiv.org/pdf/2512.00974v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Prediction-space knowledge markets for communication-efficient federated learning on multimedia tasks",
      "arxiv_id": "2512.00841v1",
      "published": "2025-11-30 11:24:19+00:00",
      "year": 2025,
      "authors": "Wenzhang Du",
      "summary": "Federated learning (FL) enables collaborative training over distributed multimedia data but suffers acutely from statistical heterogeneity and communication constraints, especially when clients deploy large models. Classic parameter-averaging methods such as FedAvg transmit full model weights and can diverge under nonindependent and identically distributed (non-IID) data. We propose KTA v2, a prediction-space knowledge trading market for FL. Each round, clients locally train on their private dat...",
      "pdf_url": "https://arxiv.org/pdf/2512.00841v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Augmented Runtime Collaboration for Self-Organizing Multi-Agent Systems: A Hybrid Bi-Criteria Routing Approach",
      "arxiv_id": "2512.00740v1",
      "published": "2025-11-30 05:26:10+00:00",
      "year": 2025,
      "authors": "Qingwen Yang, Feiyu Qu, Tiezheng Guo, Yanyi Liu, Yingyou Wen",
      "summary": "LLM-based multi-agent systems have demonstrated significant capabilities across diverse domains. However, the task performance and efficiency are fundamentally constrained by their collaboration strategies. Prevailing approaches rely on static topologies and centralized global planning, a paradigm that limits their scalability and adaptability in open, decentralized networks. Effective collaboration planning in distributed systems using only local information thus remains a formidable challenge....",
      "pdf_url": "https://arxiv.org/pdf/2512.00740v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "Orion-Bix: Bi-Axial Attention for Tabular In-Context Learning",
      "arxiv_id": "2512.00181v1",
      "published": "2025-11-28 19:42:09+00:00",
      "year": 2025,
      "authors": "Mohamed Bouadi, Pratinav Seth, Aditya Tanna, Vinay Kumar Sankarapu",
      "summary": "Tabular data drive most real-world machine learning applications, yet building general-purpose models for them remains difficult. Mixed numeric and categorical fields, weak feature structure, and limited labeled data make scaling and generalization challenging. To this end, we introduce Orion-Bix, a tabular foundation model that combines biaxial attention with meta-learned in-context reasoning for few-shot tabular learning. Its encoder alternates standard, grouped, hierarchical, and relational a...",
      "pdf_url": "https://arxiv.org/pdf/2512.00181v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "ParaGate: Parasitic-Driven Domain Adaptation Transfer Learning for Netlist Performance Prediction",
      "arxiv_id": "2511.23340v1",
      "published": "2025-11-28 16:49:25+00:00",
      "year": 2025,
      "authors": "Bin Sun, Jingyi Zhou, Jianan Mu, Zhiteng Chao, Tianmeng Yang, Ziyue Xu, Jing Ye, Huawei Li",
      "summary": "In traditional EDA flows, layout-level performance metrics are only obtainable after placement and routing, hindering global optimization at earlier stages. Although some neural-network-based solutions predict layout-level performance directly from netlists, they often face generalization challenges due to the black-box heuristics of commercial placement-and-routing tools, which create disparate data across designs. To this end, we propose ParaGate, a three-step cross-stage prediction framework ...",
      "pdf_url": "https://arxiv.org/pdf/2511.23340v1",
      "category": "traffic_routing",
      "query_name": "global_traffic_routing",
      "is_us_institution": false
    },
    {
      "title": "FFTrainer: Fast Failover in Large-Language Model Training with Almost-Free State Management",
      "arxiv_id": "2512.03644v1",
      "published": "2025-12-03 10:27:35+00:00",
      "year": 2025,
      "authors": "Bohan Zhao, Yuanhong Wang, Chenglin Liu, Jiagi Pan, Guang Yang, Ruitao Liu, Tingrui Zhang, Kai Luo, Wei Xu",
      "summary": "Recent developments in large language models (LLMs) have introduced new requirements for efficient and robust training. As LLM clusters scale, node failures, lengthy recoveries, and bulky checkpoints erode efficiency. Infrequent asynchronous checkpoints trigger costly rollbacks, yet higher frequencies add prohibitive overhead. To address these challenges, we propose FFTrainer, a system designed for robust LLM training. FFTrainer leverages surplus network capacity to quickly save and load states,...",
      "pdf_url": "https://arxiv.org/pdf/2512.03644v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Memory-Guided Point Cloud Completion for Dental Reconstruction",
      "arxiv_id": "2512.03598v1",
      "published": "2025-12-03 09:31:07+00:00",
      "year": 2025,
      "authors": "Jianan Sun, Yukang Huang, Dongzhihan Wang, Mingyu Fan",
      "summary": "Partial dental point clouds often suffer from large missing regions caused by occlusion and limited scanning views, which bias encoder-only global features and force decoders to hallucinate structures. We propose a retrieval-augmented framework for tooth completion that integrates a prototype memory into standard encoder--decoder pipelines. After encoding a partial input into a global descriptor, the model retrieves the nearest manifold prototype from a learnable memory and fuses it with the que...",
      "pdf_url": "https://arxiv.org/pdf/2512.03598v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Inferring planet occurrence rates from radial velocities",
      "arxiv_id": "2512.01804v1",
      "published": "2025-12-01 15:38:39+00:00",
      "year": 2025,
      "authors": "J. P. Faria, J. -B. Delisle, D. Ségransan",
      "summary": "We introduce a new method to infer the posterior distribution for planet occurrence rates from radial-velocity (RV) observations. The approach combines posterior samples from the analysis of individual RV datasets of several stars, using importance sampling to reweight them appropriately. This eliminates the need for injection-recovery tests to compute detection limits and avoids the explicit definition of a detection threshold. We validate the method on simulated RV datasets and show that it yi...",
      "pdf_url": "https://arxiv.org/pdf/2512.01804v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "FlowEO: Generative Unsupervised Domain Adaptation for Earth Observation",
      "arxiv_id": "2512.05140v1",
      "published": "2025-12-01 10:29:01+00:00",
      "year": 2025,
      "authors": "Georges Le Bellier, Nicolas Audebert",
      "summary": "The increasing availability of Earth observation data offers unprecedented opportunities for large-scale environmental monitoring and analysis. However, these datasets are inherently heterogeneous, stemming from diverse sensors, geographical regions, acquisition times, and atmospheric conditions. Distribution shifts between training and deployment domains severely limit the generalization of pretrained remote sensing models, making unsupervised domain adaptation (UDA) crucial for real-world appl...",
      "pdf_url": "https://arxiv.org/pdf/2512.05140v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Understanding Regional Inertia Dynamics in CAISO from Real Grid Disturbances",
      "arxiv_id": "2511.21387v1",
      "published": "2025-11-26 13:35:56+00:00",
      "year": 2025,
      "authors": "Saurav Dulal, Mohammed M. Olama, Ali R. Ekti, Nils M. Stenvig, Yilu Liu",
      "summary": "The shift from synchronous generators to inverter-based resources has caused power system inertia to be unevenly distributed across power grids. As a result, certain grid regions are more vulnerable to high rate-of-change of frequency (RoCoF) during disturbances. This paper presents a measurement-based framework for estimating grid inertia in CAISO (California Independent System Operator) region using real disturbance-driven frequency data from the Frequency Monitoring Network (FNET/GridEye). By...",
      "pdf_url": "https://arxiv.org/pdf/2511.21387v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Sensor Informativeness, Identifiability, and Uncertainty in Bayesian Inverse Problems for Structural Health Monitoring",
      "arxiv_id": "2511.16628v2",
      "published": "2025-11-20 18:34:27+00:00",
      "year": 2025,
      "authors": "Tammam Bakeer, Max Herbers, Steffen Marx",
      "summary": "In Structural Health Monitoring (SHM), the recovery of distributed mechanical parameters from sparse data is often ill-posed, raising critical questions about identifiability and the reliability of inferred states. While deterministic regularization methods such as Tikhonov stabilise the inversion, they provide little insight into the spatial limits of resolution or the inherent uncertainty of the solution. This paper presents a Bayesian inverse framework that rigorously quantifies these limits,...",
      "pdf_url": "https://arxiv.org/pdf/2511.16628v2",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "GeoShield: Byzantine Fault Detection and Recovery for Geo-Distributed Real-Time Cyber-Physical Systems",
      "arxiv_id": "2511.15031v1",
      "published": "2025-11-19 01:57:38+00:00",
      "year": 2025,
      "authors": "Yifan Cai, Linh Thi Xuan Phan",
      "summary": "Large-scale cyber-physical systems (CPS), such as railway control systems and smart grids, consist of geographically distributed subsystems that are connected via unreliable, asynchronous inter-region networks. Their scale and distribution make them especially vulnerable to faults and attacks. Unfortunately, existing fault-tolerant methods either consume excessive resources or provide only eventual guarantees, making them unsuitable for real-time resource-constrained CPS.\n  We present GeoShield,...",
      "pdf_url": "https://arxiv.org/pdf/2511.15031v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Doppler imaging combined with high-cadence photometry. I. Revisiting the surface of a pre-main-sequence flare star",
      "arxiv_id": "2511.12190v2",
      "published": "2025-11-15 12:50:51+00:00",
      "year": 2025,
      "authors": "Sanghee Lee, Engin Bahar, Hakan Volkan Şenavcı, Emre Işık, Kai Ikuta, Kosuke Namekata, Haruhi Nagata, Kiyoe Kawauchi, Masashi Omiya, Hideyuki Izumiura, Akito Tajitsu, Bun'ei Sato, Satoshi Honda, Daisaku Nogami",
      "summary": "Latitude distribution of stellar magnetic activity is not well constrained by observations, despite its importance for a better understanding of stellar dynamos. We aim to obtain an accurate reconstruction of the surface spot distribution on the young, rapidly rotating K2 star PW And by combining spectroscopic and photometric diagnostics. In particular, we seek to assess how the inclusion of continuous high-precision TESS photometry in parallel with high-resolution spectroscopy improves latitude...",
      "pdf_url": "https://arxiv.org/pdf/2511.12190v2",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "COMBUST: Gridded combustible mass estimates of the built environment in the conterminous United States (1975-2020)",
      "arxiv_id": "2511.08893v1",
      "published": "2025-11-12 02:06:02+00:00",
      "year": 2025,
      "authors": "Johannes H. Uhl, Maxwell C. Cook, Cibele Amaral, Stefan Leyk, Jennifer K. Balch, Alan Robock, Owen B. Toon",
      "summary": "The increasing occurrence of natural hazards such as wildfires and drought, along with urban expansion and land consumption, causes increasing levels of fire risk to populations and human settlements. Moreover, increasing geopolitical instability in many regions of the world requires evaluation of scenarios related to potential hazards caused by military operations. Quantitative knowledge on burnable fuels and their spatio-temporal distribution across landscapes is crucial for risk and potential...",
      "pdf_url": "https://arxiv.org/pdf/2511.08893v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "MTTR-A: Measuring Cognitive Recovery Latency in Multi-Agent Systems",
      "arxiv_id": "2511.20663v2",
      "published": "2025-11-08 21:29:18+00:00",
      "year": 2025,
      "authors": "Barak Or",
      "summary": "Ensuring cognitive stability in autonomous multi-agent systems (MAS) is a central challenge for large-scale, distributed AI. While existing observability tools monitor system outputs, they cannot quantify how rapidly agentic workflows recover once reasoning coherence has been lost. We adapt classical reliability metrics-Mean Time-to-Recovery (MTTR), Mean Time Between Failures (MTBF), and related ratios-into the cognitive domain, defining MTTR-A (Mean Time-to-Recovery for Agentic Systems) as a ru...",
      "pdf_url": "https://arxiv.org/pdf/2511.20663v2",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Upper limits on atmospheric abundances of KELT-11b and WASP-69b from a retrieval approach",
      "arxiv_id": "2511.05154v1",
      "published": "2025-11-07 11:11:35+00:00",
      "year": 2025,
      "authors": "F. Lesjak, L. Nortmann, D. Cont, P. J. Amado, M. Azzaro, J. A. Caballero, S. Czesla, A. Hatzes, Th. Henning, M. López-Puertas, K. Molaverdikhani, D. Montes, J. Orell-Miquel, E. Pallé, A. Peláez-Torres, A. Quirrenbach, A. Reiners, I. Ribas, A. Sánchez-López, A. Schweitzer, F. Yan",
      "summary": "WASP-69b and KELT-11b are two low-density hot Jupiters, which are expected to show strong atmospheric features in their transmission spectra. Such features offer valuable insights into the chemical composition, thermal structure, and cloud properties of exoplanet atmospheres. High-resolution spectroscopic observations can be used to study the line-forming regions in exoplanet atmospheres and potentially detect signals despite the presence of clouds. We aimed to detect various molecular species a...",
      "pdf_url": "https://arxiv.org/pdf/2511.05154v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "FoodRL: A Reinforcement Learning Ensembling Framework For In-Kind Food Donation Forecasting",
      "arxiv_id": "2511.04865v1",
      "published": "2025-11-06 23:08:19+00:00",
      "year": 2025,
      "authors": "Esha Sharma, Lauren Davis, Julie Ivy, Min Chi",
      "summary": "Food banks are crucial for alleviating food insecurity, but their effectiveness hinges on accurately forecasting highly volatile in-kind donations to ensure equitable and efficient resource distribution. Traditional forecasting models often fail to maintain consistent accuracy due to unpredictable fluctuations and concept drift driven by seasonal variations and natural disasters such as hurricanes in the Southeastern U.S. and wildfires in the West Coast. To address these challenges, we propose F...",
      "pdf_url": "https://arxiv.org/pdf/2511.04865v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Deployable Vision-driven UAV River Navigation via Human-in-the-loop Preference Alignment",
      "arxiv_id": "2511.01083v1",
      "published": "2025-11-02 21:30:29+00:00",
      "year": 2025,
      "authors": "Zihan Wang, Jianwen Li, Li-Fan Wu, Nina Mahmoudian",
      "summary": "Rivers are critical corridors for environmental monitoring and disaster response, where Unmanned Aerial Vehicles (UAVs) guided by vision-driven policies can provide fast, low-cost coverage. However, deployment exposes simulation-trained policies with distribution shift and safety risks and requires efficient adaptation from limited human interventions. We study human-in-the-loop (HITL) learning with a conservative overseer who vetoes unsafe or inefficient actions and provides statewise preferenc...",
      "pdf_url": "https://arxiv.org/pdf/2511.01083v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "DCcluster-Opt: Benchmarking Dynamic Multi-Objective Optimization for Geo-Distributed Data Center Workloads",
      "arxiv_id": "2511.00117v1",
      "published": "2025-10-31 03:07:12+00:00",
      "year": 2025,
      "authors": "Antonio Guillen-Perez, Avisek Naug, Vineet Gundecha, Sahand Ghorbanpour, Ricardo Luna Gutierrez, Ashwin Ramesh Babu, Munther Salim, Shubhanker Banerjee, Eoin H. Oude Essink, Damien Fay, Soumyendu Sarkar",
      "summary": "The increasing energy demands and carbon footprint of large-scale AI require intelligent workload management in globally distributed data centers. Yet progress is limited by the absence of benchmarks that realistically capture the interplay of time-varying environmental factors (grid carbon intensity, electricity prices, weather), detailed data center physics (CPUs, GPUs, memory, HVAC energy), and geo-distributed network dynamics (latency and transmission costs). To bridge this gap, we present D...",
      "pdf_url": "https://arxiv.org/pdf/2511.00117v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Self-Improving Vision-Language-Action Models with Data Generation via Residual RL",
      "arxiv_id": "2511.00091v1",
      "published": "2025-10-30 06:24:04+00:00",
      "year": 2025,
      "authors": "Wenli Xiao, Haotian Lin, Andy Peng, Haoru Xue, Tairan He, Yuqi Xie, Fengyuan Hu, Jimmy Wu, Zhengyi Luo, Linxi \"Jim\" Fan, Guanya Shi, Yuke Zhu",
      "summary": "Supervised fine-tuning (SFT) has become the de facto post-training strategy for large vision-language-action (VLA) models, but its reliance on costly human demonstrations limits scalability and generalization. We propose Probe, Learn, Distill (PLD), a three-stage plug-and-play framework that improves VLAs through residual reinforcement learning (RL) and distribution-aware data collection. In Stage 1, we train lightweight residual actors to probe failure regions of the VLA generalist. In Stage 2,...",
      "pdf_url": "https://arxiv.org/pdf/2511.00091v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Fare: Failure Resilience in Learned Visual Navigation Control",
      "arxiv_id": "2510.24680v1",
      "published": "2025-10-28 17:45:26+00:00",
      "year": 2025,
      "authors": "Zishuo Wang, Joel Loo, David Hsu",
      "summary": "While imitation learning (IL) enables effective visual navigation, IL policies are prone to unpredictable failures in out-of-distribution (OOD) scenarios. We advance the notion of failure-resilient policies, which not only detect failures but also recover from them automatically. Failure recognition that identifies the factors causing failure is key to informing recovery: e.g. pinpointing image regions triggering failure detections can provide cues to guide recovery. We present Fare, a framework...",
      "pdf_url": "https://arxiv.org/pdf/2510.24680v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "JWST observations of photodissociation regions III. Dust modelling at the illuminated edge of the Horsehead PDR",
      "arxiv_id": "2510.24573v1",
      "published": "2025-10-28 16:08:39+00:00",
      "year": 2025,
      "authors": "M. Elyajouri, A. Abergel, N. Ysard, E. Habart, T. Schirmer, A. Jones, M. Juvela, B. Tabone, L. Verstraete, K. Misselt, K. D. Gordon, A. Noriega-Crespo, P. Guillard, A. N. Witt, M. Baes, P. Bouchet, B. R. Brandl, O. Kannavou, P. Dellova, P. Klassen, B. Trahin, D. Van De Putte",
      "summary": "Carbonaceous nano-grains are a significant component of interstellar dust and dominate the mid-infrared emission of photodissociation regions (PDRs). We study the evolution of nano-grains across the illuminated edge of the Horsehead PDR, especially their abundance and size properties. This work is part of the Physics and Chemistry of PDR Fronts program studying dust and gas in PDRs with JWST. We use NIRCam+MIRI photometric bands and NIRSpec+MRS spectroscopy to map the illuminated edge. We model ...",
      "pdf_url": "https://arxiv.org/pdf/2510.24573v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "A Spatio-Temporal Graph Learning Approach to Real-Time Economic Dispatch with Multi-Transmission-Node DER Aggregation",
      "arxiv_id": "2510.23873v1",
      "published": "2025-10-27 21:25:29+00:00",
      "year": 2025,
      "authors": "Zhentong Shao, Jingtao Qin, Xianbang Chen, Nanpeng Yu",
      "summary": "The integration of distributed energy resources (DERs) into wholesale electricity markets, as mandated by FERC Order 2222, imposes new challenges on system operations. To remain consistent with existing market structures, regional transmission organizations (RTOs) have advanced the aggregation of transmission-node-level DERs (T-DERs), where a nodal virtual power plant (VPP) represents the mapping of all distribution-level DERs to their respective transmission nodes. This paper develops a real-ti...",
      "pdf_url": "https://arxiv.org/pdf/2510.23873v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "X-SYCON: Xylem-Inspired Passive Gradient Control for Communication-Free Swarm Response in Dynamic Disaster Environments",
      "arxiv_id": "2512.00018v1",
      "published": "2025-10-27 18:06:03+00:00",
      "year": 2025,
      "authors": "Arthur Ji Sung Baek, Geoffrey Martin",
      "summary": "We present X-SYCON, a xylem-inspired multi-agent architecture in which coordination emerges from passive field dynamics rather than explicit planning or communication. Incidents (demands) and obstructions (hazards) continually write diffusing and decaying scalar fields, and agents greedily ascend a local utility $U=φ_{\\mathrm{DE}}-κ\\,φ_{\\mathrm{HZ}}$ with light anti-congestion and separation. A beaconing rule triggered on first contact temporarily deepens the local demand sink, accelerating comp...",
      "pdf_url": "https://arxiv.org/pdf/2512.00018v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "On quantum large sieve inequalities and operator recovery from incomplete information",
      "arxiv_id": "2510.23676v2",
      "published": "2025-10-27 09:50:19+00:00",
      "year": 2025,
      "authors": "Luís Daniel Abreu, Michael Speckbacher, Erling A. T. Svela",
      "summary": "We obtain large sieve type inequalities for the Rayleigh quotient of the restriction of phase space representations of higher rank operators, via an operator analogue of the short-time Fourier transform (STFT). The resulting bounds are referred to as `quantum large sieve inequalities'. On the shoulders of Donoho and Stark, we demonstrate that these inequalities guarantee the recovery of an operator whose phase-space information is missing or unobservable over a 'measure-sparse' region $Ω$, by so...",
      "pdf_url": "https://arxiv.org/pdf/2510.23676v2",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Deep learning-based automated damage detection in concrete structures using images from earthquake events",
      "arxiv_id": "2510.21063v1",
      "published": "2025-10-24 00:35:14+00:00",
      "year": 2025,
      "authors": "Abdullah Turer, Yongsheng Bai, Halil Sezen, Alper Yilmaz",
      "summary": "Timely assessment of integrity of structures after seismic events is crucial for public safety and emergency response. This study focuses on assessing the structural damage conditions using deep learning methods to detect exposed steel reinforcement in concrete buildings and bridges after large earthquakes. Steel bars are typically exposed after concrete spalling or large flexural or shear cracks. The amount and distribution of exposed steel reinforcement is an indication of structural damage an...",
      "pdf_url": "https://arxiv.org/pdf/2510.21063v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Diagnostics of a Multicusp-Assisted Inductively-Coupled Radio-Frequency Plasma Source for Plasma Immersion Ion Implantation",
      "arxiv_id": "2510.18384v1",
      "published": "2025-10-21 08:03:30+00:00",
      "year": 2025,
      "authors": "Moreno Joel, Jimenez Marilyn, Okerstrom Daniel, Bradley Michael P., Couëdel Lénaïc",
      "summary": "In this article, we present a detailed characterisation of a multicusp-assisted inductively coupled RF plasma source for plasma immersion ion implantation (PIII). Using laser-induced fluorescence (LIF) and RF-compensated Langmuir probe diagnostics, we measured ion temperature T i and drift velocity v z in argon plasmas near an immersed electrode. The multicusp configuration enhances plasma density at low pressure, enabling stable operation down to 0.8 mTorr. Timeaveraged measurements show no det...",
      "pdf_url": "https://arxiv.org/pdf/2510.18384v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Enhancing reliability in AI inference services: An empirical study on real production incidents",
      "arxiv_id": "2511.07424v1",
      "published": "2025-10-17 23:16:29+00:00",
      "year": 2025,
      "authors": "Bhala Ranganathan, Mickey Zhang, Kai Wu",
      "summary": "Hyperscale large language model (LLM) inference places extraordinary demands on cloud systems, where even brief failures can translate into significant user and business impact. To better understand and mitigate these risks, we present one of the first provider-internal, practice-based analysis of LLM inference incidents. We developed a taxonomy and methodology grounded in a year of operational experience, validating it on 156 high-severity incidents, and conducted a focused quantitative study o...",
      "pdf_url": "https://arxiv.org/pdf/2511.07424v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Multi-agent Power Grid Restoration Under Uncertainty Considering Coupled Transportation-Power Networks",
      "arxiv_id": "2510.10399v2",
      "published": "2025-10-12 01:28:12+00:00",
      "year": 2025,
      "authors": "Harshal D. Kaushik, Roshni Anna Jacob, Souma Chowdhury, Jie Zhang",
      "summary": "Restoring power distribution systems after extreme events such as tornadoes presents significant logistical and computational challenges. The complexity arises from the need to coordinate multiple repair crews under uncertainty, manage interdependent infrastructure failures, and respect strict sequencing and routing constraints. Existing methods often rely on deterministic heuristics or simplified models that fail to capture the interdependencies between power and transportation networks, do not...",
      "pdf_url": "https://arxiv.org/pdf/2510.10399v2",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Visibility-Aware Densification for 3D Gaussian Splatting in Dynamic Urban Scenes",
      "arxiv_id": "2510.09364v1",
      "published": "2025-10-10 13:22:12+00:00",
      "year": 2025,
      "authors": "Yikang Zhang, Rui Fan",
      "summary": "3D Gaussian splatting (3DGS) has demonstrated impressive performance in synthesizing high-fidelity novel views. Nonetheless, its effectiveness critically depends on the quality of the initialized point cloud. Specifically, achieving uniform and complete point coverage over the underlying scene structure requires overlapping observation frustums, an assumption that is often violated in unbounded, dynamic urban environments. Training Gaussian models with partially initialized point clouds often le...",
      "pdf_url": "https://arxiv.org/pdf/2510.09364v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "SimCast: Enhancing Precipitation Nowcasting with Short-to-Long Term Knowledge Distillation",
      "arxiv_id": "2510.07953v1",
      "published": "2025-10-09 08:49:16+00:00",
      "year": 2025,
      "authors": "Yifang Yin, Shengkai Chen, Yiyao Li, Lu Wang, Ruibing Jin, Wei Cui, Shili Xiang",
      "summary": "Precipitation nowcasting predicts future radar sequences based on current observations, which is a highly challenging task driven by the inherent complexity of the Earth system. Accurate nowcasting is of utmost importance for addressing various societal needs, including disaster management, agriculture, transportation, and energy optimization. As a complementary to existing non-autoregressive nowcasting approaches, we investigate the impact of prediction horizons on nowcasting models and propose...",
      "pdf_url": "https://arxiv.org/pdf/2510.07953v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "UltraLED: Learning to See Everything in Ultra-High Dynamic Range Scenes",
      "arxiv_id": "2510.07741v1",
      "published": "2025-10-09 03:29:39+00:00",
      "year": 2025,
      "authors": "Yuang Meng, Xin Jin, Lina Lei, Chun-Le Guo, Chongyi Li",
      "summary": "Ultra-high dynamic range (UHDR) scenes exhibit significant exposure disparities between bright and dark regions. Such conditions are commonly encountered in nighttime scenes with light sources. Even with standard exposure settings, a bimodal intensity distribution with boundary peaks often emerges, making it difficult to preserve both highlight and shadow details simultaneously. RGB-based bracketing methods can capture details at both ends using short-long exposure pairs, but are susceptible to ...",
      "pdf_url": "https://arxiv.org/pdf/2510.07741v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "A4FN: an Agentic AI Architecture for Autonomous Flying Networks",
      "arxiv_id": "2510.03829v1",
      "published": "2025-10-04 15:02:03+00:00",
      "year": 2025,
      "authors": "André Coelho, Pedro Ribeiro, Helder Fontes, Rui Campos",
      "summary": "This position paper presents A4FN, an Agentic Artificial Intelligence (AI) architecture for intent-driven automation in Flying Networks (FNs) using Unmanned Aerial Vehicles (UAVs) as access nodes. A4FN leverages Generative AI and Large Language Models (LLMs) to enable real-time, context-aware network control via a distributed agentic system. It comprises two components: the Perception Agent (PA), which semantically interprets multimodal input -- including imagery, audio, and telemetry data -- fr...",
      "pdf_url": "https://arxiv.org/pdf/2510.03829v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Foundation models for equation discovery in high energy physics",
      "arxiv_id": "2510.03397v1",
      "published": "2025-10-03 18:00:01+00:00",
      "year": 2025,
      "authors": "Manuel Morales-Alvarado",
      "summary": "Foundation models, large machine learning models trained on broad, multimodal datasets, have been gaining increasing attention in scientific applications due to their strong performance on diverse downstream tasks. Large Language Models (LLMs), a prominent instance of foundation models, have achieved remarkable success in tasks such as text and image generation. In this work, we investigate their potential for equation discovery in high energy physics, focusing on symbolic regression. We apply t...",
      "pdf_url": "https://arxiv.org/pdf/2510.03397v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "DescribeEarth: Describe Anything for Remote Sensing Images",
      "arxiv_id": "2509.25654v1",
      "published": "2025-09-30 01:53:34+00:00",
      "year": 2025,
      "authors": "Kaiyu Li, Zixuan Jiang, Xiangyong Cao, Jiayu Wang, Yuchen Xiao, Deyu Meng, Zhi Wang",
      "summary": "Automated textual description of remote sensing images is crucial for unlocking their full potential in diverse applications, from environmental monitoring to urban planning and disaster management. However, existing studies in remote sensing image captioning primarily focus on the image level, lacking object-level fine-grained interpretation, which prevents the full utilization and transformation of the rich semantic and structural information contained in remote sensing images. To address this...",
      "pdf_url": "https://arxiv.org/pdf/2509.25654v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "CasPoinTr: Point Cloud Completion with Cascaded Networks and Knowledge Distillation",
      "arxiv_id": "2509.23375v1",
      "published": "2025-09-27 15:49:24+00:00",
      "year": 2025,
      "authors": "Yifan Yang, Yuxiang Yan, Boda Liu, Jian Pu",
      "summary": "Point clouds collected from real-world environments are often incomplete due to factors such as limited sensor resolution, single viewpoints, occlusions, and noise. These challenges make point cloud completion essential for various applications. A key difficulty in this task is predicting the overall shape and reconstructing missing regions from highly incomplete point clouds. To address this, we introduce CasPoinTr, a novel point cloud completion framework using cascaded networks and knowledge ...",
      "pdf_url": "https://arxiv.org/pdf/2509.23375v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Optimized Fish Locomotion using Design-by-Morphing and Bayesian Optimization",
      "arxiv_id": "2510.00044v1",
      "published": "2025-09-27 09:24:18+00:00",
      "year": 2025,
      "authors": "Hamayun Farooq, Imran Akhtar, Muhammad Saif Ullah Khalid, Haris Moazam Sheikh",
      "summary": "This study presents a computational framework for optimizing undulatory swimming profiles using a combination of design-by-morphing and Bayesian optimization strategies. The body deformation is expressed as a linear combination of five baseline bio-inspired profiles, including two unconventional shapes to enhance diversity in the design space. The optimization objective is to maximize propulsive efficiency over a wide range of frequency-wavelength combinations. The Arbitrary Lagrangian--Eulerian...",
      "pdf_url": "https://arxiv.org/pdf/2510.00044v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Designing Ethereum's Geographical (De)Centralization Beyond the Atlantic",
      "arxiv_id": "2509.21475v1",
      "published": "2025-09-25 19:40:49+00:00",
      "year": 2025,
      "authors": "Sen Yang, Burak Öz, Fei Wu, Fan Zhang",
      "summary": "Decentralization has a geographic dimension that conventional metrics such as stake distribution overlook. Where validators run affects resilience to regional shocks (outages, disasters, government intervention) and fairness in reward access. Yet in permissionless systems, locations cannot be mandated, but they emerge from incentives. Today, Ethereum's validators cluster along the Atlantic (EU and U.S. East Coast), where latency is structurally favorable. This raises a key question: when some re...",
      "pdf_url": "https://arxiv.org/pdf/2509.21475v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Deep learning for 3D point cloud processing - from approaches, tasks to its implications on urban and environmental applications",
      "arxiv_id": "2509.12452v1",
      "published": "2025-09-15 21:03:39+00:00",
      "year": 2025,
      "authors": "Zhenxin Zhang, Zhihua Xu, Yuwei Cao, Ningli Xu, Shuye Wang, Shen'ao Cui, Zhen Li, Rongjun Qin",
      "summary": "Point cloud processing as a fundamental task in the field of geomatics and computer vision, has been supporting tasks and applications at different scales from air to ground, including mapping, environmental monitoring, urban/tree structure modeling, automated driving, robotics, disaster responses etc. Due to the rapid development of deep learning, point cloud processing algorithms have nowadays been almost explicitly dominated by learning-based approaches, most of which are yet transitioned int...",
      "pdf_url": "https://arxiv.org/pdf/2509.12452v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "3DAeroRelief: The first 3D Benchmark UAV Dataset for Post-Disaster Assessment",
      "arxiv_id": "2509.11097v1",
      "published": "2025-09-14 05:27:19+00:00",
      "year": 2025,
      "authors": "Nhut Le, Ehsan Karimi, Maryam Rahnemoonfar",
      "summary": "Timely assessment of structural damage is critical for disaster response and recovery. However, most prior work in natural disaster analysis relies on 2D imagery, which lacks depth, suffers from occlusions, and provides limited spatial context. 3D semantic segmentation offers a richer alternative, but existing 3D benchmarks focus mainly on urban or indoor scenes, with little attention to disaster-affected areas. To address this gap, we present 3DAeroRelief--the first 3D benchmark dataset specifi...",
      "pdf_url": "https://arxiv.org/pdf/2509.11097v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "GraphCSVAE: Graph Categorical Structured Variational Autoencoder for Spatiotemporal Auditing of Physical Vulnerability Towards Sustainable Post-Disaster Risk Reduction",
      "arxiv_id": "2509.10308v1",
      "published": "2025-09-12 14:50:56+00:00",
      "year": 2025,
      "authors": "Joshua Dimasaka, Christian Geiß, Robert Muir-Wood, Emily So",
      "summary": "In the aftermath of disasters, many institutions worldwide face challenges in continually monitoring changes in disaster risk, limiting the ability of key decision-makers to assess progress towards the UN Sendai Framework for Disaster Risk Reduction 2015-2030. While numerous efforts have substantially advanced the large-scale modeling of hazard and exposure through Earth observation and data-driven methods, progress remains limited in modeling another equally important yet challenging element of...",
      "pdf_url": "https://arxiv.org/pdf/2509.10308v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "ArtifactGen: Benchmarking WGAN-GP vs Diffusion for Label-Aware EEG Artifact Synthesis",
      "arxiv_id": "2509.08188v1",
      "published": "2025-09-09 23:25:33+00:00",
      "year": 2025,
      "authors": "Hritik Arasu, Faisal R Jahangiri",
      "summary": "Artifacts in electroencephalography (EEG) -- muscle, eye movement, electrode, chewing, and shiver -- confound automated analysis yet are costly to label at scale. We study whether modern generative models can synthesize realistic, label-aware artifact segments suitable for augmentation and stress-testing. Using the TUH EEG Artifact (TUAR) corpus, we curate subject-wise splits and fixed-length multi-channel windows (e.g., 250 samples) with preprocessing tailored to each model (per-window min-max ...",
      "pdf_url": "https://arxiv.org/pdf/2509.08188v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "MAUSAM: An Observations-focused assessment of Global AI Weather Prediction Models During the South Asian Monsoon",
      "arxiv_id": "2509.01879v2",
      "published": "2025-09-02 01:51:40+00:00",
      "year": 2025,
      "authors": "Aman Gupta, Aditi Sheshadri, Dhruv Suri",
      "summary": "Accurate weather forecasts are critical for societal planning and disaster preparedness. Yet these forecasts remain challenging to produce and evaluate, especially in regions with sparse observational coverage. Current evaluation of artificial intelligence (AI) weather prediction relies primarily on reanalyses, which can obscure important deficiencies. Here we present MAUSAM (Measuring AI Uncertainty during South Asian Monsoon), an evaluation of seven leading AI-based forecasting systems - FourC...",
      "pdf_url": "https://arxiv.org/pdf/2509.01879v2",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Resurrecting the Salmon: Rethinking Mechanistic Interpretability with Domain-Specific Sparse Autoencoders",
      "arxiv_id": "2508.09363v1",
      "published": "2025-08-12 21:45:10+00:00",
      "year": 2025,
      "authors": "Charles O'Neill, Mudith Jayasekara, Max Kirkby",
      "summary": "Sparse autoencoders (SAEs) decompose large language model (LLM) activations into latent features that reveal mechanistic structure. Conventional SAEs train on broad data distributions, forcing a fixed latent budget to capture only high-frequency, generic patterns. This often results in significant linear ``dark matter'' in reconstruction error and produces latents that fragment or absorb each other, complicating interpretation. We show that restricting SAE training to a well-defined domain (medi...",
      "pdf_url": "https://arxiv.org/pdf/2508.09363v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Abundance and Phase-Space Distribution of Subhalos in Cosmological N-body Simulations: Testing Numerical Convergence and Correction Methods",
      "arxiv_id": "2508.07678v2",
      "published": "2025-08-11 06:54:22+00:00",
      "year": 2025,
      "authors": "Kun Xu",
      "summary": "Subhalos play a crucial role in accurately modeling galaxy formation and galaxy-based cosmological probes within the highly nonlinear, virialized regime. However, numerical convergence of subhalo evolution is difficult to achieve, especially in the inner regions of host halos where tidal forces are strongest. I investigate the numerical convergence and correction methods for the abundance, spatial, and velocity distributions of subhalos using two $6144^3$-particle cosmological N-body simulations...",
      "pdf_url": "https://arxiv.org/pdf/2508.07678v2",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "AerialDB: A Federated Peer-to-Peer Spatio-temporal Edge Datastore for Drone Fleets",
      "arxiv_id": "2508.07124v1",
      "published": "2025-08-10 00:14:55+00:00",
      "year": 2025,
      "authors": "Shashwat Jaiswal, Suman Raj, Subhajit Sidhanta, Yogesh Simmhan",
      "summary": "Recent years have seen an unprecedented growth in research that leverages the newest computing paradigm of Internet of Drones, comprising a fleet of connected Unmanned Aerial Vehicles (UAVs) used for a wide range of tasks such as monitoring and analytics in highly mobile and changing environments characteristic of disaster regions. Given that the typical data (i.e., videos and images) collected by the fleet of UAVs deployed in such scenarios can be considerably larger than what the onboard compu...",
      "pdf_url": "https://arxiv.org/pdf/2508.07124v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "CS-SHRED: Enhancing SHRED for Robust Recovery of Spatiotemporal Dynamics",
      "arxiv_id": "2507.22303v2",
      "published": "2025-07-30 00:27:18+00:00",
      "year": 2025,
      "authors": "Romulo B. da Silva, Diego Passos, Cássio M. Oishi, J. Nathan Kutz",
      "summary": "We present CS-SHRED, a novel deep learning architecture that integrates Compressed Sensing (CS) into a Shallow Recurrent Decoder (SHRED) to reconstruct spatiotemporal dynamics from incomplete, compressed, or corrupted data. Our approach introduces two key innovations. First, by incorporating CS techniques into the SHRED architecture, our method leverages a batch-based forward framework with $\\ell_1$ regularization to robustly recover signals even in scenarios with sparse sensor placements, noisy...",
      "pdf_url": "https://arxiv.org/pdf/2507.22303v2",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "ARRC: Explainable, Workflow-Integrated Recommender for Sustainable Resource Optimization Across the Edge-Cloud Continuum",
      "arxiv_id": "2507.12032v1",
      "published": "2025-07-16 08:48:04+00:00",
      "year": 2025,
      "authors": "Brian-Frederik Jahnke, René Brinkhege, Jan Peter Meyer, Daniel Tebernum, Falk Howar",
      "summary": "Achieving sustainable, explainable, and maintainable automation for resource optimization is a core challenge across the edge-cloud continuum. Persistent overprovisioning and operational complexity often stem from heterogeneous platforms and layered abstractions, while systems lacking explainability and maintainability become fragile, impede safe recovery, and accumulate technical debt. Existing solutions are frequently reactive, limited to single abstraction layers, or require intrusive platfor...",
      "pdf_url": "https://arxiv.org/pdf/2507.12032v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "Exploring the Frontiers of kNN Noisy Feature Detection and Recovery for Self-Driving Labs",
      "arxiv_id": "2507.16833v1",
      "published": "2025-07-15 03:35:56+00:00",
      "year": 2025,
      "authors": "Qiuyu Shi, Kangming Li, Yao Fehlis, Daniel Persaud, Robert Black, Jason Hattrick-Simpers",
      "summary": "Self-driving laboratories (SDLs) have shown promise to accelerate materials discovery by integrating machine learning with automated experimental platforms. However, errors in the capture of input parameters may corrupt the features used to model system performance, compromising current and future campaigns. This study develops an automated workflow to systematically detect noisy features, determine sample-feature pairings that can be corrected, and finally recover the correct feature values. A ...",
      "pdf_url": "https://arxiv.org/pdf/2507.16833v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "A Transfer Learning-Based Method for Water Body Segmentation in Remote Sensing Imagery: A Case Study of the Zhada Tulin Area",
      "arxiv_id": "2507.10084v2",
      "published": "2025-07-14 09:11:33+00:00",
      "year": 2025,
      "authors": "Haonan Chen, Xin Tong",
      "summary": "The Tibetan Plateau, known as the Asian Water Tower, faces significant water security challenges due to its high sensitivity to climate change. Advancing Earth observation for sustainable water monitoring is thus essential for building climate resilience in this region. This study proposes a two-stage transfer learning strategy using the SegFormer model to overcome domain shift and data scarcit--key barriers in developing robust AI for climate-sensitive applications. After pre-training on a dive...",
      "pdf_url": "https://arxiv.org/pdf/2507.10084v2",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    },
    {
      "title": "On-Demand HAPS-Assisted Communication System for Public Safety in Emergency and Disaster Response",
      "arxiv_id": "2507.09153v1",
      "published": "2025-07-12 05:55:56+00:00",
      "year": 2025,
      "authors": "Bilal Karaman, Ilhan Baştürk, Ferdi Kara, Engin Zeydan, Esra Aycan Beyazıt, Sezai Taşkın, Emil Björnson, Halim Yanikomeroglu",
      "summary": "Natural disasters often disrupt communication networks and severely hamper emergency response and disaster management. Existing solutions, such as portable communication units and cloud-based network architectures, have improved disaster resilience but fall short if both the Radio Access Network (RAN) and backhaul infrastructure become inoperable. To address these challenges, we propose a demand-driven communication system supported by High Altitude Platform Stations (HAPS) to restore communicat...",
      "pdf_url": "https://arxiv.org/pdf/2507.09153v1",
      "category": "disaster_recovery",
      "query_name": "disaster_recovery",
      "is_us_institution": false
    }
  ]
}