[
  {
    "id": "http://arxiv.org/abs/2506.08252v1",
    "arxiv_id": "2506.08252v1",
    "title": "PoSyn: Secure Power Side-Channel Aware Synthesis",
    "summary": "Power Side-Channel (PSC) attacks exploit power consumption patterns to extract sensitive information, posing risks to cryptographic operations crucial for secure systems. Traditional countermeasures, such as masking, face challenges including complex integration during synthesis, substantial area overhead, and susceptibility to optimization removal during logic synthesis. To address these issues, we introduce PoSyn, a novel logic synthesis framework designed to enhance cryptographic hardware resistance against PSC attacks. Our method centers on optimal bipartite mapping of vulnerable RTL components to standard cells from the technology library, aiming to minimize PSC leakage. By utilizing a cost function integrating critical characteristics from both the RTL design and the standard cell library, we strategically modify mapping criteria during RTL-to-netlist conversion without altering design functionality. Furthermore, we theoretically establish that PoSyn minimizes mutual information leakage, strengthening its security against PSC vulnerabilities. We evaluate PoSyn across various cryptographic hardware implementations, including AES, RSA, PRESENT, and post-quantum cryptographic algorithms such as Saber and CRYSTALS-Kyber, at technology nodes of 65nm, 45nm, and 15nm. Experimental results demonstrate a substantial reduction in success rates for Differential Power Analysis (DPA) and Correlation Power Analysis (CPA) attacks, achieving lows of 3% and 6%, respectively. TVLA analysis further confirms that synthesized netlists exhibit negligible leakage. Additionally, compared to conventional countermeasures like masking and shuffling, PoSyn significantly lowers attack success rates, achieving reductions of up to 72%, while simultaneously enhancing area efficiency by as much as 3.79 times.",
    "published": "2025-06-09T21:41:47Z",
    "updated": "2025-06-09T21:41:47Z",
    "authors": [
      "Amisha Srivastava",
      "Samit S. Miftah",
      "Hyunmin Kim",
      "Debjit Pal",
      "Kanad Basu"
    ],
    "affiliations": [],
    "first_author": "Amisha Srivastava",
    "pdf_url": "https://arxiv.org/pdf/2506.08252v1",
    "primary_category": "cs.CR",
    "relevance_score": 20.0
  },
  {
    "id": "http://arxiv.org/abs/2501.04394v1",
    "arxiv_id": "2501.04394v1",
    "title": "Modern Hardware Security: A Review of Attacks and Countermeasures",
    "summary": "With the exponential rise in the use of cloud services, smart devices, and IoT devices, advanced cyber attacks have become increasingly sophisticated and ubiquitous. Furthermore, the rapid evolution of computing architectures and memory technologies has created an urgent need to understand and address hardware security vulnerabilities. In this paper, we review the current state of vulnerabilities and mitigation strategies in contemporary computing systems. We discuss cache side-channel attacks (including Spectre and Meltdown), power side-channel attacks (such as Simple Power Analysis, Differential Power Analysis, Correlation Power Analysis, and Template Attacks), and advanced techniques like Voltage Glitching and Electromagnetic Analysis to help understand and build robust cybersecurity defense systems and guide further research. We also examine memory encryption, focusing on confidentiality, granularity, key management, masking, and re-keying strategies. Additionally, we cover Cryptographic Instruction Set Architectures, Secure Boot, Root of Trust mechanisms, Physical Unclonable Functions, and hardware fault injection techniques. The paper concludes with an analysis of the RISC-V architecture's unique security challenges. The comprehensive analysis presented in this paper is essential for building resilient hardware security solutions that can protect against both current and emerging threats in an increasingly challenging security landscape.",
    "published": "2025-01-08T10:14:19Z",
    "updated": "2025-01-08T10:14:19Z",
    "authors": [
      "Jyotiprakash Mishra",
      "Sanjay K. Sahay"
    ],
    "affiliations": [],
    "first_author": "Jyotiprakash Mishra",
    "pdf_url": "https://arxiv.org/pdf/2501.04394v1",
    "primary_category": "cs.CR",
    "relevance_score": 18.0
  },
  {
    "id": "http://arxiv.org/abs/2507.01423v1",
    "arxiv_id": "2507.01423v1",
    "title": "A Compact 16-bit S-box over Tower Field $\\F_{(((2^2)^2)^2)^2}$ with High Security",
    "summary": "This paper introduces a compact and secure 16-bit substitution box (S-box) designed over the composite field $\\F_{(((2^2)^2)^2)^2}$, optimized for both hardware efficiency and cryptographic robustness. The proposed S-box decomposes operations into subfields, leveraging a tower field architecture. This enables significant hardware reduction through optimized field inversion and a low-cost affine transformation. Security evaluations confirm resilience against linear, differential, algebraic and DPA attacks, validated via metrics including Nonlinearity (32512), Differential Uniformity (4), Algebraic Degree (15), Transparency order (15.9875) and SNR (0.34e-08). The hardware results, in 65 nm CMOS technology, show the proposed 16-bit S-box has lower hardware resources consumption and lower critical path delay (CPD) than those of other 16-bit S-boxes. By integrating high algebraic complexity with resource-efficient structures, this work addresses the growing demand for scalable cryptographic primitives in data-sensitive applications, demonstrating that larger S-boxes can enhance security without proportional hardware costs. The results underscore the viability of composite field-based architectures in balancing security and efficiency for modern block ciphers.",
    "published": "2025-07-02T07:22:22Z",
    "updated": "2025-07-02T07:22:22Z",
    "authors": [
      "Bahram Rashidi",
      "Behrooz Khadem"
    ],
    "affiliations": [],
    "first_author": "Bahram Rashidi",
    "pdf_url": "https://arxiv.org/pdf/2507.01423v1",
    "primary_category": "cs.CR",
    "relevance_score": 14.0
  },
  {
    "id": "http://arxiv.org/abs/2505.05366v2",
    "arxiv_id": "2505.05366v2",
    "title": "SDR-RDMA: Software-Defined Reliability Architecture for Planetary Scale RDMA Communication",
    "summary": "RDMA is vital for efficient distributed training across datacenters, but millisecond-scale latencies complicate the design of its reliability layer. We show that depending on long-haul link characteristics, such as drop rate, distance and bandwidth, the widely used Selective Repeat algorithm can be inefficient, warranting alternatives like Erasure Coding. To enable such alternatives on existing hardware, we propose SDR-RDMA, a software-defined reliability stack for RDMA. Its core is a lightweight SDR SDK that extends standard point-to-point RDMA semantics -- fundamental to AI networking stacks -- with a receive buffer bitmap. SDR bitmap enables partial message completion to let applications implement custom reliability schemes tailored to specific deployments, while preserving zero-copy RDMA benefits. By offloading the SDR backend to NVIDIA's Data Path Accelerator (DPA), we achieve line-rate performance, enabling efficient inter-datacenter communication and advancing reliability innovation for inter-datacenter training.",
    "published": "2025-05-08T16:03:35Z",
    "updated": "2025-05-10T12:08:23Z",
    "authors": [
      "Mikhail Khalilov",
      "Siyuan Shen",
      "Marcin Chrapek",
      "Tiancheng Chen",
      "Kenji Nakano",
      "Peter-Jan Gootzen",
      "Salvatore Di Girolamo",
      "Rami Nudelman",
      "Gil Bloch",
      "Sreevatsa Anantharamu",
      "Mahmoud Elhaddad",
      "Jithin Jose",
      "Abdul Kabbani",
      "Scott Moe",
      "Konstantin Taranov",
      "Zhuolong Yu",
      "Jie Zhang",
      "Nicola Mazzoletti",
      "Torsten Hoefler"
    ],
    "affiliations": [],
    "first_author": "Mikhail Khalilov",
    "pdf_url": "https://arxiv.org/pdf/2505.05366v2",
    "primary_category": "cs.NI",
    "relevance_score": 12.0
  },
  {
    "id": "http://arxiv.org/abs/2412.20166v2",
    "arxiv_id": "2412.20166v2",
    "title": "LoL-PIM: Long-Context LLM Decoding with Scalable DRAM-PIM System",
    "summary": "The expansion of large language models (LLMs) with hundreds of billions of parameters presents significant challenges to computational resources, particularly data movement and memory bandwidth. Long-context LLMs, which process sequences of tens of thousands of tokens, further increase the demand on the memory system as the complexity in attention layers and key-value cache sizes is proportional to the context length. Processing-in-Memory (PIM) maximizes memory bandwidth by moving compute to the data and can address the memory bandwidth challenges; however, PIM is not necessarily scalable to accelerate long-context LLM because of limited per-module memory capacity and the inflexibility of fixed-functional unit PIM architecture and static memory management. In this work, we propose LoL-PIM which is a multi-node PIM architecture that accelerates long context LLM through hardware-software co-design. In particular, we propose how pipeline parallelism can be exploited across a multi-PIM module while a direct PIM access (DPA) controller (or DMA for PIM) is proposed that enables dynamic PIM memory management and results in efficient PIM utilization across a diverse range of context length. We developed an MLIR-based compiler for LoL-PIM extending a commercial PIM-based compiler where the software modifications were implemented and evaluated, while the hardware changes were modeled in the simulator. Our evaluations demonstrate that LoL-PIM significantly improves throughput and reduces latency for long-context LLM inference, outperforming both multi-GPU and GPU-PIM systems (up to 8.54x and 16.0x speedup, respectively), thereby enabling more efficient deployment of LLMs in real-world applications.",
    "published": "2024-12-28T14:38:16Z",
    "updated": "2025-01-15T01:34:46Z",
    "authors": [
      "Hyucksung Kwon",
      "Kyungmo Koo",
      "Janghyeon Kim",
      "Woongkyu Lee",
      "Minjae Lee",
      "Hyungdeok Lee",
      "Yousub Jung",
      "Jaehan Park",
      "Yosub Song",
      "Byeongsu Yang",
      "Haerang Choi",
      "Guhyun Kim",
      "Jongsoon Won",
      "Woojae Shin",
      "Changhyun Kim",
      "Gyeongcheol Shin",
      "Yongkee Kwon",
      "Ilkon Kim",
      "Euicheol Lim",
      "John Kim",
      "Jungwook Choi"
    ],
    "affiliations": [],
    "first_author": "Hyucksung Kwon",
    "pdf_url": "https://arxiv.org/pdf/2412.20166v2",
    "primary_category": "cs.AR",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2407.21012v2",
    "arxiv_id": "2407.21012v2",
    "title": "Uplink Wave-Domain Combiner for Stacked Intelligent Metasurfaces Accounting for Hardware Limitations",
    "summary": "Refractive metasurfaces (RMTSs) offer a promising solution to improve energy efficiency of wireless systems. To address the limitations of single-layer RMTS, stacked intelligent metasurfaces (SIMs), which form the desired precoder and combiner in the wave domain, have been proposed. However, previous analyses overlooked hardware non-idealities that significantly affect SIM performance. In this paper, we study the achievable sum-rate of SIM antennas in an uplink scenario, accounting for hardware constraints. We propose a system model that includes noise and hardware effects, formulate a non-convex sum-rate optimization problem, and solve it using gradient ascent and interior point methods. We compare SIMs and digital phased arrays (DPAs) under Rayleigh fading and 3GPP channels with two conditions: equal number of RF chains and equal physical aperture size. Our results show SIMs outperform DPAs under equal number of RF chains but underperform DPAs with equal aperture size.",
    "published": "2024-07-30T17:57:56Z",
    "updated": "2024-09-26T14:35:41Z",
    "authors": [
      "Maryam Rezvani",
      "Raviraj Adve",
      "Akram bin Sediq",
      "Amr El-Keyi"
    ],
    "affiliations": [],
    "first_author": "Maryam Rezvani",
    "pdf_url": "https://arxiv.org/pdf/2407.21012v2",
    "primary_category": "eess.SP",
    "relevance_score": 7.0
  },
  {
    "id": "http://arxiv.org/abs/2402.03041v4",
    "arxiv_id": "2402.03041v4",
    "title": "Demystifying Datapath Accelerator Enhanced Off-path SmartNIC",
    "summary": "Network speeds grow quickly in the modern cloud, so SmartNICs are introduced to offload network processing tasks, even application logic. However, typical multicore SmartNICs such as BlueFiled-2 are only capable of processing control-plane tasks with their embedded processors that have limited memory bandwidth and computing power. On the other hand, cloud applications evolve rapidly, such that a limited number of fixed hardware engines in a SmartNIC cannot satisfy the requirements of cloud applications. Therefore, SmartNIC programmers call for a programmable datapath accelerator (DPA) to process network traffic at line rate. However, no existing work has unveiled the performance characteristics of the existing DPA. To this end, we present the first architectural characterization of the latest DPA-enhanced BlueFiled-3 (BF3) SmartNIC. Our evaluation results indicate that BF3's DPA is significantly wimpier than the off-path Arm processor and the host CPU. However, we still identify that DPA has three unique architectural characteristics that unleash the performance potential of DPA. Specifically, we demonstrate how to take advantage of DPA's three architectural characteristics regarding computing, networking, and memory subsystems. Then we propose three important guidelines for programmers to fully unleash the potential of DPA. To demonstrate the effectiveness of our approach, we conduct detailed case studies regarding each guideline. Our case study on key-value aggregation achieves up to 4.3$\\times$ higher throughput by using our guidelines to optimize memory combinations.",
    "published": "2024-02-05T14:25:08Z",
    "updated": "2024-09-09T07:30:20Z",
    "authors": [
      "Xuzheng Chen",
      "Jie Zhang",
      "Ting Fu",
      "Yifan Shen",
      "Shu Ma",
      "Kun Qian",
      "Lingjun Zhu",
      "Chao Shi",
      "Yin Zhang",
      "Ming Liu",
      "Zeke Wang"
    ],
    "affiliations": [],
    "first_author": "Xuzheng Chen",
    "pdf_url": "https://arxiv.org/pdf/2402.03041v4",
    "primary_category": "cs.NI",
    "relevance_score": 7.0
  }
]